[
    {
        "name": "Alexander (magician)",
        "description": "Claude Alexander Conlin (June 30, 1880 – August 5, 1954), also known as Alexander, C. Alexander, Alexander the Crystal Seer, and Alexander the Man Who Knows, was an American spiritual author, vaudeville magician who specialized in mentalism and psychic reading acts, dressed in Oriental style robes and a feathered turban, and often used a crystal ball as a prop. In addition to performing, he also worked privately for clients, giving readings. He was the author of several pitch books, New Thought pamphlets, and psychology books, as well as texts for stage performers. His stage name was \"Alexander,\" and as an author he wrote under the name \"C. Alexander.\""
    },
    {
        "name": "Allan Ackerman",
        "description": "Allan Ackerman is an American magician who specializes in sleight of hand magic with playing cards. He has written a series of books, and performed on several instructional DVDs that teach elementary sleight of hand all the way up through advanced card work. Ackerman has also been a professor of mathematics at the University of Nevada, Las Vegas, and in addition to card magic, he also performs coin magic.\nHe has studied under Ed Marlo, the famous Chicago cardician, and now lives in Las Vegas. At the Community College of Southern Nevada he teaches MCSE, MCSA, Net+ & A+ Certifications. He has a daughter named Debbie Ackerman who also does magic."
    },
    {
        "name": "Amazing Johnathan",
        "description": ""
    },
    {
        "name": "Criss Angel",
        "description": "Christopher Nicholas Sarantakos (born December 19, 1967), better known by the stage name Criss Angel, is an American magician and illusionist. Angel began his career in New York City, before moving his base of operations to the Las Vegas Valley. He is known for starring in the television and stage show Criss Angel Mindfreak and his previous live performance illusion show Criss Angel Believe in collaboration with Cirque du Soleil at the Luxor casino in Las Vegas. The show generated $150 million in tourist revenue to Las Vegas in 2010, but has since been replaced by Mindfreak LIVE on 11 May 2016 (this new show is still part produced by Cirque, however the directive rights are entirely with Criss Angel). He also starred in the television series Believe on Spike TV, the television show Phenomenon, and the 2014 stage show Criss Angel Magicjam.\nAngel has been on primetime television for more hours than any other magician in history, between his television series and various specials on cable and network television. He also holds multiple world-records made during his magic performances, and was named Magician of the Decade in 2009 and Magician of the Century in 2010 by the International Magicians Society. In addition to his career as an illusionist, Angel was the lead singer for his industrial band Angeldust, which released five albums between 1998 and 2003. He also authored the book Mindfreak: Secret Revelations."
    },
    {
        "name": "Curtis Adams (magician)",
        "description": "Alan Curtis Adams (born October 12, 1984) is an American magician who, when 16 years old, appeared on The Young Magicians Showcase produced by magician Lance Burton and Fox Television.\nAdams was born in Long Beach, California. In his teens he began his own production company and became one of the youngest magicians to perform in Reno, Nevada casinos. He graduated from high school a year early, at the age of 17, to pursue his career with Creative Director Don Wayne, best known for creating and producing material for David Copperfield's TV specials.\nIn 2006 Curtis Adams was the headliner in the main showroom of The Plaza Hotel and Casino in Las Vegas. In 2007 he launched a national tour of his Las Vegas production \"Curtis Adams - Magic That Rocks\".\nAdams' shows incorporate hip hop dance, pop music, comedy and motorcycle stunts."
    },
    {
        "name": "David Abbott (magician)",
        "description": "David Phelps Abbott (September 22, 1863 – June 12, 1934) was a magician, author and inventor who created such effects as the floating ball, later made famous by Okito. The best known of his books is Behind the Scenes with the Mediums (1907) considered to be one of the best exposures of the tricks used by mediums. One exposure being the \"spirit portrait paintings\" by the Bangs Sisters."
    },
    {
        "name": "David Acer",
        "description": "David Acer (pronounced \/ˈækər\/, born 27 February 1970) is a Canadian author, stand-up comedian, close-up magician inventor of magic tricks, and co-host\/co-writer of the syndicated television series Mystery Hunters.\nHis writing on Mystery Hunters earned him two Gemini Awards nominations (the Canadian equivalent of the Emmys) for Best Writing in a Children's Non-Fiction series (2005 and 2007), and he wrote a book based on his segments on the series called \"Gotcha! 18 Amazing Ways to Freak Out Your Friends,\" published by Kids Can Press in 2008.\n\"Gotcha!\"  was a Canadian best-seller and was nominated for two children's book awards, a Willow Award and a Hackmatack Children's Choice Award, and won the Hackmatack award in 2008\/2009.\nDavid, a native of Montreal, has also written for other Canadian television shows such as Popular Mechanics for Kids, YTV's Prank Patrol and TVO's Finding Stuff Out.\nHis career as a stand-up comedian began in 1989. By then, he was a recognized close-up magician and inventor of magic tricks, and had published original sleight-of-hand effects in a multitude of trade magazines. But stand-up comedy evolved as a separate career, with little to no overlap in terms of content. As a stand-up comedian, David has appeared on Canadian television shows such as CBC's Just For Laughs, The Comedy Network's Just For Laughs: The Lost Tapes, CTV's Comedy Now, Comedy at Club 54 and in the U.S. on A&E's Comedy on the Road and ABC's America's Funniest People. In 2013 he won his first national (comedic) debate on CBC radio's popular series, The Debaters.\nAs a close-up magician he has lectured around the world on his original tricks and authored four books. His latest, \"More Power To You\", was published in 2011 by Hermetic Press (Seattle, WA), and has since been translated into French and published by Marchand de Trucs as \"Anthologie: David Acer\". David also appeared on the cover of the October 2010 issue of the American magic periodical Genii (magazine), and has performed his original magic on Discovery's Grand Illusions, in England on Sky One's The Secret World of Magic, and in Japan on NHK's F.I.S.M. 2000.\nIn 2007, Acer was invited to lecture at Fechter's Finger Flicking Frolic, a close-up magic convention held in upstate New York (USA) and limited to fewer than 150 hand-picked attendees.\nHe has also performed at The Magic Castle and FISM. He has also authored several books on magic. Since 2002, he has had a regular column in Genii magazine. Acer wrote 5 episodes of the 1997-2001 series, \"Popular Mechanics for Kids\".\nAs a comedian and actor, he has had roles on the television program Mystery Hunters and in the film Levity as well as performed numerous times at Montreal's Just for Laughs festival. He also appeared on YTV's popular show Prank Patrol, where he helped one of the young pranksters by showing her how to do some easy magic tricks."
    },
    {
        "name": "Fergus Anckorn",
        "description": "Fergus Gordon Anckorn (born 10 December 1918) is a former British soldier who, as starting as the conjurer Wizardus at age 18, is now the longest-serving member of the Magic Circle.\nHe was born on 10 December 1918 and, at the age of eighteen, became the youngest member of the Magic Circle. During World War II, he was captured by the Japanese during the fall of Singapore and forced, as a prisoner of war, to work on the Burma Railway and the famous bridge on the River Kwai. Fergus Anckorn's story was recounted in an interview with Andrew Eborn at The Magic Circle  \nIn 2016, during the tenth series of Britain's Got Talent, Anckorn was featured during the final act of magician Richard Jones, who eventually was chosen as the series' winner.\nFergus Anckorn married his wartime sweetheart Lucy \"Lucille\" Hose and has two children and four grandchildren."
    },
    {
        "name": "Harry Anderson",
        "description": "Harry Laverne Anderson (born October 14, 1952) is an American actor, screenwriter, director and magician. He is best known for the role of Judge Harry Stone on the 1984–92 television series Night Court. In addition to eight appearances on Saturday Night Live between 1981 and 1985, Anderson had a recurring guest role as con man Harry \"The Hat\" Gittes on Cheers, toured extensively as a magician, and did several magic\/comedy shows for broadcast, including Harry Anderson's Sideshow (1987)."
    },
    {
        "name": "Ivan Amodei",
        "description": "Ivan Amodei (born August 22, 1976) is a magician who specializes in close-up magic, parlor magic and sleight of hand. Ivan performs at the Beverly Wilshire – A Four Seasons Hotel in Beverly Hills California."
    },
    {
        "name": "Jay Alexander (magician)",
        "description": ""
    },
    {
        "name": "Jeffery Atkins (illusionist)",
        "description": "Henry Jeffery Atkins (3 September 1919 – 19 March 2001) was a British magician. He is cited as a major force in the International Brotherhood of Magicians (IBM) British Ring, for which he was honorary secretary and convention organizer for many years. He also served a term as international president of the IBM. As a performer he specialized in revivals or re-creations of antique magic. He made a number of appearances on national television in the United Kingdom. On one occasion he staged a revival of the Radium Girl illusion for the Paul Daniels Magic Show. He is commemorated through the Jeffery Atkins memorial lecture held at the annual convention of the British Ring of the IBM.\n\n"
    },
    {
        "name": "Jerry Andrus",
        "description": "Jerry Andrus (January 28, 1918 – August 26, 2007) was an American magician and writer known internationally for his original close-up, sleight-of-hand tricks and optical illusions, such as the \"Linking Pins\"."
    },
    {
        "name": "Jewel Aich",
        "description": "Jewel Aich is a Bangladeshi magician and bansuri player. He is a veteran of the 1971 Bangladesh liberation war that culminated in the birth of his country. He has been called as Bangladesh's leading magician."
    },
    {
        "name": "John Archer (magician)",
        "description": "John Archer is a British comedy magician."
    },
    {
        "name": "John Henry Anderson",
        "description": "John Henry Anderson (1814–1874) was a Scottish professional magician. Anderson is credited with helping bring the art of magic from street performances into theatres and presenting magic performances to entertain and delight the audience."
    },
    {
        "name": "Michael Ammar",
        "description": "Michael Ammar (born June 25, 1956) is an American close-up magician. He is recognized worldwide as one of the greatest living magicians."
    },
    {
        "name": "Simo Aalto",
        "description": "Simo Aalto (born March 19, 1960 in Oulu) is a Finnish magician.\n\n"
    },
    {
        "name": "Theodore Annemann",
        "description": "Theodore 'Theo' Annemann (stage name Ted Anneman) born Theodore John Squires (February 22, 1907 – January 12, 1942) was an American professional magician who specialized in the field of mentalism. Annemann is most famous for inventing and refining many of the standard mentalism routines that continue to be used by magicians today."
    },
    {
        "name": "Tony Andruzzi",
        "description": "Tony Andruzzi (born May 22, 1925 in Cheyenne, Wyoming – died December 22, 1991 in Chicago, Illinois) was the name adopted by professional magician Tom S. Palmer from the age of 45 to the end of his life."
    },
    {
        "name": "Al Baker (magician)",
        "description": "Al Baker (September 4, 1874 – October 24, 1951) was a professional magician. Al Baker was an inventor of many tricks that he marketed including his Dictionary Test, Al Baker Slates and his version of the Rice bowls. Many of his silk magic effects were included in Rice's Encyclopedia of Silk Magic. Al Baker opened a magic shop with Martin Sunshine in Times Square. Al Baker also regularly contributed to The Sphinx and other magic magazines."
    },
    {
        "name": "Ariann Black",
        "description": "Ariann Black (also spelled Arian Black earlier in her career) is a professional magician who is based in Las Vegas, Nevada, USA. She has headlined her own show in Vegas and appeared on a number of national and international television shows. She is known in the magic world for her efforts to encourage and promote other female performers. She was voted Female Magician of the Year in 2004 and International Female Magician of the Year in 2008 & 2009. most recently Ariann was awarded \"Magician of the Year by the International Conclave of Illusionists.\nBlack was born in Canada and began doing magic when she was five years old. She turned professional when she was 19 and moved to New York, where she ended up working at the Trump Plaza and Trump's Castle in Atlantic City. That led to various international work and after several years she settled in Las Vegas.\nIn Vegas she has headlined her own magic show Secrets, which first played at the Fitzgerald's Hotel and Casino. A new larger version of Secrets opened at the Westin Hotel Casino in 2010. Ariann has also appeared in a number of other shows in major venues, such as Splash at the Riveria Hotel and Casino. In 2008 she was the opening act for The Amazing Jonathan. In addition she does a large amount of corporate work.\nOn television she has been seen in two episodes of Steve Harvey's Big Time on the WB network. She has also appeared on an Animal Planet special with Lance Burton. She has appeared in BBC shows, and series for French and Italian networks and for the Canadian network CBC. She made her last TV appearance on Pawn Stars in 2014.\nBlack studied with the late Doug Henning. She also has a qualification in magic having studied with Dale Salwack at the Chavez School of Magic."
    },
    {
        "name": "Arnold de Biere",
        "description": "Arnold De Biere (1878 - 6 August 1934) was a German magician.\nBiere who was of Jewish origin was born in Germany in 1878 and moved to the United States as a child. He spent most of his childhood in Bradford, Pennsylvania where he developed an interest in magic tricks. He originally worked as a shop keeper, but took interest in magic shows and stage illusions.\nBiere became well known in Europe and Australia where he toured. His most well known tricks were the Egg Bag, Clock Dial and the Ten-Ichi Thumb Tie. He also performed the vanishing bird cage act and in the 1920s gave stage illusions at the St. George's Hall. He died in London on August 6, 1934.\nBiere had once invested in a movie of Harry Houdini, but lost a considerable amount of money as the film was not a success.\nBiere had stated that he had solved the riddle of how to perform the Indian rope trick in open air. A few days before his death he claimed he was going to perform this feat and reveal its secret."
    },
    {
        "name": "Banachek",
        "description": "Steven Shaw (born 30 November 1960), known professionally as Banachek, is a mentalist. He has written books on mentalism and has invented various magic and mentalism effects, including the Penn & Teller bullet catch and the original \"buried alive\" stunt. He is the Director of the James Randi Educational Foundation (JREF) One Million Dollar Paranormal Challenge."
    },
    {
        "name": "Barry and Stuart",
        "description": "Barry and Stuart (Barry Jones and Stuart MacLeod) are two Scottish BAFTA nominated magicians and comedians whose work has been seen on television and on stage around the world. The double act are known for their comically dark performing style, for taking as inspiration the accounts of Biblical miracles and faking paranormal phenomena to form the basis for some of their illusions."
    },
    {
        "name": "Carl Ballantine",
        "description": "Carl Ballantine (September 27, 1917 – November 3, 2009) was an American magician, comedian and actor. Billing himself as \"The Great Ballantine\", \"The Amazing Ballantine\" or \"Ballantine: The World's Greatest Magician\", his vaudeville-style comedy routine involved transparent or incompetent stage magic tricks, which tended to flop and go \"hilariously awry\" to the wisecracking Ballantine's mock chagrin. He has been credited with creating comedy magic and has influenced both comics and magicians."
    },
    {
        "name": "Charles Bertram (magician)",
        "description": "Charles Bertram (26 April 1853 – 28 February 1907) was a British magician known as \"The Royal Conjurer\" as he performed for royalty."
    },
    {
        "name": "David (Fu Manchu) Bamberg",
        "description": ""
    },
    {
        "name": "David Ben",
        "description": "David Ben is a Canadian stage magician, sleight of hand artist, illusionist, author, publisher, keynote speaker, magic historian, magic consultant, magic collector and former tax lawyer.\nHe has been a professional magician, performer, entertainer and keynote speaker since 1990. Ben is known for his sleight-of-hand technique, his knowledge of magic history and his collection of magic.\nHe is one of the founders of Magicana—a performing arts organization dedicated to the study, exploration and advancement of magic as a performing art—and currently serves its Artistic Director. He is the publisher and editor of Magicol, a quarterly journal of magic history and collectibles. He is the sole protégé of a fellow Canadian, twentieth century sleight-of-hand artist, Ross Bertram, and biographer (and representative of the Estate) of celebrated magician, Dai Vernon.\n\n"
    },
    {
        "name": "David Berglas",
        "description": "David Berglas (born June 30, 1926) is a magician and mentalist.\n\n"
    },
    {
        "name": "Ed Balducci",
        "description": "Ed Balducci (1906 – 1988) is often named as the creator of the \"Balducci levitation\", which has been popularized by magician David Blaine."
    },
    {
        "name": "Gay Blackstone",
        "description": "Gay (also Gaye) Blackstone is a television and stage producer, director, consultant, lecturer and author. She was president of the Academy of Magical Arts and was named one of \"2007 Hollywood's Women of Distinction\" by the Hollywood Chamber of Commerce. She is also the international ambassador of the International Brotherhood of Magicians. Blackstone was the executive producer for the 2013 revival of the television show Masters of Illusion.\n2013 – 2005\n•Executive Producer - “Masters of Illusion” Television Series for 2014 release CW Network http:\/\/www.hollywoodreporter.com\/live-feed\/cw-revives-magic-show-masters-585645\n•Executive Producer - “Masters of Illusion” Television Series for immediate release for Sony International\n•Executive Producer – “Masters of Illusion –LIVE!” Tour 2011 to Present – US, Canada, Singapore, Manila, and Peru - 80 shows in 46 venues, 26 states, 5 countries, and 3 continents (first two seasons)\n•Executive Producer – “Masters of Illusion” – January 2009 to Present – 40 Hour Network Television Series\n•Executive Producer – “World Magic Awards” 5 - 2 Hour Network Specials Hosts Neil Patrick Harris, Sir Roger Moore, Robert Wagner, Jonathon Franks, and Bob Saget\n•Past President of the Academy of Magical Arts – at The Magic Castle\n•Creative Consultant & Segment Producer for Illusionist “Hans Klok – The Beauty of Magic” Featuring Pamela Anderson June 2007 at The Planet Hollywood Resort & Casino in Las Vegas, Nevada\n•Woman of Distinction Award from Hollywood Chamber of Commerce - 2007 Honoree\n•Executive Producer – “Masters of Illusion- Impossible Magic!” 15 hours of Magic and Variety\n•Producer\/Creator Magic Stage Show at The Bayside Theater Lighthouse in Fukuoka, Japan - 2010\n•Community Leaders Board for the College of Arts and Letters at California State University San Bernardino\n•Producer\/Creator “Ai & Yuki” Show – US and Asia 2007 - 2009\n•Creative Consultant – Illusionist David Blaine Television\n•NAACP Image Awards Special Effects Consultant for Television - 2005\n•Producer Illusionist “Darren Romeo: The Voice of Magic” at The Welk Theatre in Branson, MO\n•Producer - “Live in Berlin” at Pump, Duck and Circumstance\n•Producer & Creator of International Female Illusionist My Uyen – Television Special and Casino Stage Show\n•Creative Consultant\/Show Analyst for Disney Cruise Line\n•Producer of Telly Award Winning Four Part Television series for Time Life – “Kids 100 Favorite Songs”\n•Creative Advisor for Penn and Teller “Sin City” Television Series\n•Creative Consultant, Staging & Segment Producer for “Siegfried & Roy Present – Darren Romeo: The Voice of Magic” at the Mirage Hotel and Casino in Las Vegas\n•Adjunct Professor University of Southern California – Choreography for television and film, performance and production, advisor George Burns Award\n•Hosted multiple episodes of “The Story of Magic” – Canadian Television Series\n•Author of “Around the House Magic”\n•Special Events Producer – Amazon, Nickelodeon\n•Corporate Events Producer\/Consultant\/Performer – The Money Store, Henley Health, Cadillac, Honda, California Dental Association, Ontario Convention Center\nCo-Produced “The Blackstone Magic Show” 1974 – 1997 •Broadway – Holds the record for the longest running Magic Show in Broadway History\n•Tour – U.S. and International\n•Casinos – Las Vegas, Atlantic City, Lake Tahoe, Reno\n•Television – Multiple one and two-hour specials: PBS, HBO, CBS, NBC and PAX\n•International television specials, Japan, England, Paris and EuroDisney\n•Television – “Mystic, Magic, 3D Video”\n•Honda Introduction\n•Cadillac Introduction Show\nRock & Roll and Live Music Shows (Special Effects, Staging\/Rigging for Venues, Arenas, Stadiums and Sheds)\n•New Kids On The Block The Magic Summer Tour – U.S. and International and No More Games Tour\n•Earth, Wind & Fire – U.S. and International\n•Alice Cooper – Welcome to my Nightmare\n•Vanilla Ice – Special Effects\n•Michael Jackson, Victory Tour – Special Effects\n•Sea World – The Super Heroes, Florida and Ohio\n•Boys Choir of Harlem and Friend on Broadway\nAwards, Recognition, and Associations\n•Member of Academy of Television Arts & Sciences as Executive Producer\n•Magic Castle: The Academy of Magical Arts- President: 2006 -2008 Vice President 2004 -2006 Board of Directors: 2002 – 2012\n•“Face of Redlands” Honoree for local Philanthropy and Community Service\n•International Ambassador for the Society of American Magicians and the International Brotherhood of Magicians\n•Recipient of the Milbourne Christopher Award\n•2013 Society of American Magicians Presidential Citation\n•Community Leaders Board for the College of Arts and Letters at California State University San Bernardino\n•Woman of Distinction Award from Hollywood Chamber of Commerce - 2007 Honoree\n•Los Angeles Business Journal – Front Page Feature Story “Woman of Distinction”\n•Released top selling “Blackstone Magical Moments” DVD"
    },
    {
        "name": "Guy Bavli",
        "description": "Guy Bavli (Hebrew: גיא בבלי‎‎; born 1971) is an Israeli mentalist, illusionist, and lecturer. He is known for being the first Israeli citizen to win an international magic competition in the United States. He owns the entertainment company \"Master of the Mind\", based in Fort Lauderdale, Florida."
    },
    {
        "name": "Harry Blackstone, Jr.",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Harry Blackstone, Sr.",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Herbert L. Becker",
        "description": "Herbert Lawrence Becker is a former magician who also wrote a computer program described by him as \"broadcasting analog signals over the internet in real time\" in 2000. He is also the author of several books, an actor, and the creator\/director of the Masked Magician TV specials for Fox TV.\n\n"
    },
    {
        "name": "János Bartl",
        "description": "János Bartl (1878–1958), a descendant of a German craftsman family which had emigrated to Hungary, was one of the most important magic supply dealers of the pre-war era."
    },
    {
        "name": "Keith Barry",
        "description": "Keith Patrick Barry (born 2 October 1976) is an Irish mentalist, hypnotist, magician and activist for the elderly."
    },
    {
        "name": "Samri Baldwin",
        "description": "Samuel Spencer Baldwin (January 21, 1848 – March 12, 1924), or Samri Baldwin, most well known as \"The White Mahatma\" was an American magician."
    },
    {
        "name": "Tobias Bamberg",
        "description": "Tobias \"Theo\" Leendert Bamberg (1875 – 1963) was a professional magician. Born in the Netherlands, Bamberg performed under the name Okito which was an anagram of Tokio (Tokyo). His father had been court magician to King William III of the Netherlands making Okito the sixth generation in a family of outstanding magicians known as the Bamberg Magical Dynasty."
    },
    {
        "name": "Alessandro Cagliostro",
        "description": "Count Alessandro di Cagliostro (Italian: [alesˈsandro kaʎˈʎɔstro]; 2 June 1743 – 26 August 1795) was the alias of the occultist Giuseppe Balsamo ([dʒuˈzɛppe ˈbalsamo]; in French usually referred to as Joseph Balsamo).\nCagliostro was an Italian adventurer and self-styled magician. He became a glamorous figure associated with the royal courts of Europe where he pursued various occult arts, including psychic healing, alchemy and scrying. His reputation lingered for many decades after his death, but continued to deteriorate, as he came to be regarded as a charlatan and impostor, this view fortified by the savage attack of Thomas Carlyle (1795–1881) in 1833, who pronounced him the \"Prince of Quacks\". Later works—such as that of W.R.H. Trowbridge (1866-1938) in his Cagliostro: the Splendour and Misery of a Master of Magic (1910)—attempted a rehabilitation."
    },
    {
        "name": "Ali Bongo",
        "description": "William Oliver Wallace (8 December 1929 – 8 March 2009), known by his stage name Ali Bongo, was a British comedy magician and president of The Magic Circle who performed an act in which he was known as the \"Shriek of Araby\"."
    },
    {
        "name": "Brian Brushwood",
        "description": "Brian Allen Brushwood (born January 17, 1975) is an American magician, podcaster, author, lecturer and comedian. Brushwood is known for the series Scam School, a show where he teaches the audience entertaining tricks at bars so they can \"scam\" a free drink from their friends. In addition to Scam School Brushwood co-hosts the podcasts Weird Things with Andrew Mayne and Justin Robert Young, Cordkillers with Tom Merritt and Night Attack with Young. Brushwood was also a regular guest on the This Week in Tech podcast. Brushwood performs his Bizarre Magic stage show across the United States and is the author of six books. Brushwood also co-hosts a YouTube show along with Jason Murphy called The Modern Rogue. Brushwood has appeared on national television numerous times including on The Tonight Show with Jay Leno, CNN and Food Network.\n\n"
    },
    {
        "name": "Charles Cameron (magician)",
        "description": "Charles Wesley Cameron (31 October 1927 – 7 January 2001) was a professional magician who specialised in a style known as bizarre magic. He was born in Edinburgh, Scotland, and has a younger brother.\nHe was a magician, and commonly dubbed as the Godfather of Bizarre Magic."
    },
    {
        "name": "David Blaine",
        "description": "David Blaine (born David Blaine White; April 4, 1973) is an American magician, illusionist and endurance artist. He is best known for his high-profile feats of endurance, and has set and broken several world records.\nBlaine’s first television special, Street Magic, has been called \"the best TV magic special ever done and the biggest breakthrough in our lifetime\". Blaine revolutionized the way magic is shown on television by focusing on spectator reactions. His idea was to turn the camera around on the people watching instead of the performer, to make the audience watch the audience. The New York Times noted that \"he's taken a craft that's been around for hundreds of years and done something unique and fresh with it.\" According to the New York Daily News, \"Blaine can lay claim to his own brand of wizardry. The magic he offers operates on an uncommonly personal level.\""
    },
    {
        "name": "Derren Brown",
        "description": "Derren Victor Brown (born 27 February 1971) is an English mentalist and illusionist. Since his television debut with Derren Brown: Mind Control in 2000, he has produced several other shows both for the stage, and for television in both series and specials. He has also written books for magicians as well as the general public.\nBrown does not claim to possess any super-natural powers, indeed his acts are often designed to expose the methods of those who do, such as faith healers and mediums. He makes clear in his performances that all of his apparent abilities, which manifest on stage\/screen as feats of memory, intuition, mind-reading and control of other objects\/people, are achieved through a variety of psychological means, such as hypnosis, suggestion, cold reading, misdirection, and showmanship, and in many cases he will often give detailed explanations of his specific methods during or after the performance. In some performances he also uses his techniques to explore issues of personality such as fears and motivation."
    },
    {
        "name": "Dick Brooks (entertainer)",
        "description": ""
    },
    {
        "name": "Eugene Burger",
        "description": "Eugene Burger is an American magician. He was born in 1939 and is based in Chicago, Illinois. He is reputed for his close-up skills and his work in mentalism and bizarre magic.\nHe is also a philosopher and a historian of religion. He has degrees in philosophy and Divinity from Yale University and has taught university courses in comparative religion and philosophy.\nBurger frequently teaches with Jeff McBride in the McBride Magic & Mystery School in Las Vegas, Nevada.\nHe is the author of books on the presentation of close up magic and is featured on several instructional DVDs and videos for magicians. He has also produced an audio program called Growing in the Art of Magic."
    },
    {
        "name": "H. J. Burlingame",
        "description": "Hardin Jasper Burlingame (1852–1915) was an American magician and magic historian.\nBurlingame had taken lessons from the magician David Bamberg. He later used the stage name \"Jasper Bamberg\" when he performed in Chicago.\nBurlingame is most well known for his book Hermann the Magician (1897), a biography of the magician Alexander Herrmann.\nHe also wrote a biography of Baron Hartwig Seeman, a noted Swedish magician."
    },
    {
        "name": "J.B. Bobo",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "James Brown (magician)",
        "description": "James Brown is an English magician from Dorset.\nHe was awarded The Magic Circle close-up magician of the year in 2006 [1] and also came second in the 2006 International Magic Convention Close-Up competition [2]. His style of magic is a cross between close-up magic hypnosis and pickpocketing, all presented in a humorous manner.\n\n"
    },
    {
        "name": "John Born",
        "description": "John B. Born is an American parlor magician, the winner of multiple awards including \"Close-Up Magician of the Year\" from the International Brotherhood of Magicians in 2006. He has written two books, appeared on ten instructional DVDs created in Las Vegas and Reno, and is a frequent lecturer on the subject of magic techniques. Also a writer, his book Meant to Be features sections from Allan Ackerman, Ken Krenzel, Banachek, Luke Jermay, Martin Joyal, Tony Miller, Mike Powers, Joshua Jay, and Jason Dean. His latest book, \"Cheating at Texas Hold'em: A Modern Guide to the Art of Deception and Illicit Play at the Card Table\" was released in 2010, featuring 560 pages about cheating at poker - how it works, how to detect it, and how to prevent it."
    },
    {
        "name": "John Calvert (magician)",
        "description": "Madren Elbern \"John\" Calvert (August 5, 1911 – September 27, 2013) was an American magician who performed on stage (including Broadway) for eight decades both in the United States and worldwide. Siegfried and Roy cited him as an inspiration, and Bess Houdini said that he was second only to Harry Houdini in \"play(ing) the part of a magician.\"\nHe was also a film actor who appeared in numerous movies and was the subject of a biographical documentary entitled John Calvert – His Magic and Adventures. The Society of Young Magicians (S.Y.M.) Assembly #29 of the Boston area was solely named after John Calvert until 2012 when David Oliver was also added to the name.\n\n"
    },
    {
        "name": "Kuda Bux",
        "description": "Kuda Bux (17 February 1905 – 5 February 1981), born Khudah Bukhsh, was a Pakistani mystic, magician and fire walker."
    },
    {
        "name": "L. H. Branson",
        "description": "Major Lionel Hugh Branson (8 April 1879 – April 1946) was a British magician and officer of the British Indian Army."
    },
    {
        "name": "Lance Burton",
        "description": "William Lance Burton (born March 10, 1960 in Columbia, Kentucky) is an American stage magician. He performed more than 15,000 shows in Las Vegas for over 5,000,000 people. In 2010 he ended his 31-year career."
    },
    {
        "name": "Mark Cairns (magician)",
        "description": "Mark Cairns (born 28 March 1970) is an UK based magician and mentalist.\nCairns was born and raised in New Zealand. Unusually for a performer, he did not develop an interest in magic until his late 20's, when he acquired and refined basic sleight-of-hand conjuring skills over the course of a year while travelling in West Asia and the Middle East. On his return to his home country, Cairns served his performing apprenticeship in Wellington, working part-time as a magician for corporate audiences, launches and charity events.\nIt was during this time that Cairns developed an interest in mind reading, and in 2001 he moved to the United Kingdom with his wife and children to pursue a full-time career as a close up mind reader when his talents in this field outgrew the opportunities in his home country.\nNot well known amongst the general public, Cairns primarily performs in corporate and society circles where he is known for an intellectually engaging yet informal one-on-one approach to his craft. Although he primarily performs in the UK, Cairns has also performed in Dubai, Antwerp, and Monaco for corporate clients, celebrities and local royalty. He also uses his talents in support of various charities, such as The Children's Society."
    },
    {
        "name": "Marshall Brodien",
        "description": "Marshall Brodien, known for his role as Wizzo the Wizard, played a wizard clown that performed on WGN-TV's Bozo's Circus and The Bozo Show from 1968-1994.\nBrodien, who had been making semi-regular guest appearances since 1968, later appeared as a wizard character in an Arabian Nights-inspired costume which evolved into Wizzo the Wizard by the early 1970s. He was billed as being from \"Arobia\" and possessed the Stone of Zanzabar. According to Brodien, the first time he touched Bozo (Bob Bell) with the stone, Bozo quipped \"I remember when you got stoned at the Zanzabar.\" During the mid-1970s it was rumored that Wizzo (the character, not Brodien) was a Jewish convert to Islam. Producers of the show during that time, however, denied this rumor and claimed that the storyline would have just \"confused small children\" watching the show.\nOliver O. Oliver (Ray Rayner) left Bozo's Circus in 1971 and was briefly replaced by Pat Tobin as Oliver's cousin Elrod T. Potter, and then by magician John Thompson (an acquaintance of Roy Brown's and Brodien's) as Clod Hopper. By 1973, WGN gave up on Thompson and increased Brodien's appearances as Wizzo. Brodien left the program in 1994.\nIn 1970, Brodien was the spokesperson and creator for a trick magic card deck known as TV Magic Cards, which was a renamed Svengali deck. The deck resembled a regular playing card deck, except that the cards could be shown as all the same card. Many other card tricks could be performed with the deck. Over 17 million decks of the cards were sold.\nIn the '80s Marshall Brodien would drive around the Chicago area in a Cadillac Eldorado with vanity license plates reading \"WIZ\" and custom pin-striping which contained a tiny \"WIZ\" within the striping.\nBrodien currently designs magic trick sets for children through a company called Cadaco Toys. He occasionally makes public appearances in the Chicago area and his autobiography, The Magical Life Of Marshall Brodien, was published. One of his Wizzo costumes is in the Bozo's Circus collection of the Museum of Broadcast Communications."
    },
    {
        "name": "Matthias Buchinger",
        "description": "Matthias Buchinger (June 2, 1674 – January 17, 1740), sometimes called Matthew Buckinger in English, was a German artist, magician, calligrapher, and performer who was born without hands or feet and was 29 in (74 cm) tall. Buchinger was especially noted for his micrography, in which illustrations consist of infinitesimal text."
    },
    {
        "name": "Mike Caldwell (magician)",
        "description": "Mike Caldwell (deceased August 17, 1995) was an accomplished comedy magician.\nMuch of Caldwell's comedy stemmed from his large size. At more than 400 pounds, Caldwell became famous for being able to do a complete backflip from a standing position, and he featured this stunt in a series of television commercials for many advertisers throughout the 1960s and 1970s."
    },
    {
        "name": "Chef Anton (page does not exist)",
        "description": null
    },
    {
        "name": "Al Cohen (magician)",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Aldo Colombini",
        "description": "Aldo Colombini (19 March 1951 – 12 February 2014) was an Italian-born magician, lecturer, author and media producer. His wife, Rachel who is also a magician, currently resides in Florida. When he first moved to the United States (from his native Modena, Italy) in 1993, he spoke no English.\n\nHe created and marketed hundreds of magic tricks, along with numerous books and instructional videos on the topic of magic. He wrote a long-running column for The Linking Ring magazine, entitled, \"As Always, Aldo\"."
    },
    {
        "name": "Ali Cook",
        "description": "Ali Cook (also credited as Alistair Cook) is an English magician and actor originating from Yorkshire. Cook is known best for writing and starring in seven British television magic shows for Channel 4, Channel 5, and Sky1, produced by Objective Productions. Cook is a headliner on the British stand up comedy circuit. His 2010 Edinburgh show \"Pieces of Strange\" was in the top 2% of best reviewed shows according to the British Comedy Guide. Chortle said it caused a sensation with a \"genuinely astounding\" Houdini-inspired water tank escape. His 2011 show \"Principles and Deceptions\" was nominated for Broadway Baby's six-star award."
    },
    {
        "name": "Canuplin",
        "description": "Canuto Francia (January 28, 1904 – September 4, 1979), better known as Canuplin, was a Filipino stage performer and magician who gained fame for his impersonation of Charlie Chaplin in Filipino movies and the local bodabil circuit."
    },
    {
        "name": "Charles Joseph Carter",
        "description": "Charles Joseph Carter (June 14, 1874 – February 13, 1936) was an American stage magician, also known as Carter the Great."
    },
    {
        "name": "Comus (Nicolas Philippe Ledru)",
        "description": ""
    },
    {
        "name": "Dean Carnegie",
        "description": "Dean Alan Carnegie is an American stage magician, escape artist and painter. He has appeared on numerous television programs and has performed for three different US Presidents. He is called 'The Artist of Mystery'."
    },
    {
        "name": "Francis Carlyle",
        "description": "Francis Carlyle (17 September 1912 - 27 December 1975) was a professional magician who was a regular and popular performer at Hollywood's Magic Castle.\n\n"
    },
    {
        "name": "John Carney (magician)",
        "description": "John Carney (born January 23, 1958 in Des Moines, Iowa) is a professional sleight of hand artist, author and comic actor. He has won Hollywood’s Magic Castle award for Magician of the Year seven times. In 1988 and 1991, he was an award winner at the world FISM magic championships. Carney studied under Dai Vernon.\n\nCarney's performances include corporate speaking and entertainment for parties and other events, as well as his theatre show, Carney's Wonders. He has performed in casinos in Atlantic City, Lake Tahoe and Las Vegas. He has also appeared on The Jerry Seinfeld HBO Special and CBS Magicians Favorite Magicians, David Letterman's Late Show, and has served as a spokesman for MasterCard, performing magic for their national television commercials.\nCarney is also a teacher of magic, having lectured and conducted seminars around the world. He has written five books, Carney Knowledge, Carneycopia, Magic by design, The Book of Secrets and Wizard Academy.\nCarney currently resides in Los Angeles, California."
    },
    {
        "name": "John Cassidy (magician)",
        "description": "John Cassidy is a professional comedian, magician, and balloon artist who holds several Guinness World Record speed records for balloon sculpting. In November 2007, Cassidy inflated and sculpted a record 747 balloons in one hour. He secured another record when he created thirteen balloon sculptures within one minute.\nJohn has appeared numerous times on television as either a stand-up comedian, magician or as a Guinness Book of Records celebrity. He has been a guest on Late Night with Conan O'Brien, Martha Stewart Living, The Weakest Link, NBC's Today Show, Live With Regis and Kelly, and the Jerry Lewis MDA Telethon four years in a row. He has also been featured in numerous periodicals including Better Homes and Gardens and The Philadelphia Inquirer, and he has performed at The White House, The Magic Castle, Foxwoods Casino, the Golden Nugget Las Vegas, the Flamingo Las Vegas and The Comedy and Magic Club in Hermosa Beach, CA.\nThe more unusual staples of his stage show include a lawn dart cannon, a \"telekinetic\" cymbal-banging monkey toy, and a six-foot red balloon that John climbs into to complete a magic trick.\nCassidy and his wife Jennifer are lifelong residents of the greater Philadelphia metropolitan area but regularly tour and perform dates nationwide."
    },
    {
        "name": "Juliana Chen",
        "description": "Juliana Chen is a Chinese magician, who was born in the Hunan province of China. She has appeared on the cover of The Linking Ring, published by the International Brotherhood of Magicians."
    },
    {
        "name": "Louis Comte",
        "description": "Louis Apollinaire Christien Emmanuel Comte \"The King's Conjurer\" (born Geneva, June 22, 1788 – Rueil, November 25, 1859), also known simply as Comte, was a celebrated nineteenth-century Parisian magician, greatly admired by Robert-Houdin.\nHe performed for Louis XVIII at the Tuileries Palace and was made a Chevalier de la Légion d'Honneur by Louis-Philippe. He was sometimes called \"The Conjurer of the Three Kings\" (Louis XVIII, Charles X, and Louis-Philippe). In 1814, Comte became the first conjurer on record to pull a white rabbit out of a top hat though this is also attributed to the much later John Henry Anderson.\nComte owned the Théâtre Comte passage des Panoramas of the 2nd arrondissement of Paris and another one in the Passage Choiseul."
    },
    {
        "name": "Lu Chen (magician)",
        "description": "Lu \"Louis\" Chen (Chinese: 劉謙; pinyin: Liú Qiān; Wade–Giles: Liu Ch'ien; Pe̍h-ōe-jī: Lâu Khiam; born June 25, 1976) is a Taiwanese magician and is credited to be the only Taiwanese magician to perform in Hollywood's Magic Castle, commonly referred to as Taiwan's most renowned magician. He graduated from Soochow University with a degree in Japanese literature.\nLu Chen has made multiple appearances internationally, performing in Japan, South Korea, Europe, and the United States. His first public appearance in the mainland China was in 2009, during CCTV's annual Spring Festival, performing a close-range three-part magic show, which included \"teleporting\" an engagement ring into a real egg. Guests were invited to try basic magic after the show was over.\nHe has been the recipient of many international awards, including the famed \"Neil Foster\/Bill Baird Award for Excellence in Manipulation\", which is handed out yearly by the Chavez College of Magic."
    },
    {
        "name": "Mike Caveney",
        "description": "Michael Douglas \"Mike\" Caveney (born June 17, 1950) is an American magician, author, publisher, magic historian and collector. He is a life-member of the Magic Castle in Hollywood and a member of The Magic Circle of London. His work as a magician and publisher spans over four decades. He has appeared onstage or on TV in more than 20 countries worldwide and most of the 50 States."
    },
    {
        "name": "Milbourne Christopher",
        "description": "Milbourne Christopher (23 March 1914 – 17 June 1984) was a prominent American illusionist, magic historian, and author.\nPresident of the Society of American Magicians, an honorary vice-president to The Magic Circle, and one of the founding members of the Committee for Skeptical Inquiry, Christopher wrote a number of books, including a biography of Harry Houdini titled Houdini: The Untold Story, a chronicle of his own craft titled The Illustrated History Of Magic, and thousands of essays relating to magic and mentalism."
    },
    {
        "name": "Richard Valentine Pitchford",
        "description": "Richard Valentine Pitchford (24 November 1895 – 13 November 1973) was a master magician under the name Cardini, whose career spanned almost half a century. Born in Britain, he worked chiefly in the United States of America."
    },
    {
        "name": "Rudy Coby",
        "description": "Rudy Coby (born Rudolph Coby; April 22, 1964), also known as \"Labman\", is an American comedic magician. He is a member of the Magic Castle in Los Angeles. In the early 1990s, Coby appeared in several small theatrical live shows, and on broadcast television. He is known for delivering eclectic and original comedic performances, of which stage magic plays a large part. He also works closely with rock musician and film director Marilyn Manson.\nIn the mid-1990s, Coby and his troupe of illusionist comrades performed in the Gem Theatre in downtown Detroit for an unprecedented thirteen weeks thanks to the cult following, and radio support. Coby also published a bundle of lecture notes, titled \"How To Become A World Famous Magician\".\nAfter a hiatus of 14 years, Coby returned to performing in 2009, including a well-received twelve-week run between June 13 - September 7 at the Galaxy Theater at Valleyfair, a theme park in Minneapolis. In 2012, he performed on the YouTube episode of America's Got Talent during its seventh season, but did not advance to the semifinals.\n\n"
    },
    {
        "name": "Steve Cohen (magician)",
        "description": "Steve Cohen (born February 1, 1971) is an American magician who specializes in parlor magic. Sometimes called the \"millionaires' magician\", he performs regularly in a suite at the Waldorf Astoria New York in Manhattan and at private parties in other places."
    },
    {
        "name": "Tommy Cooper",
        "description": "Thomas Frederick Cooper (19 March 1921 – 15 April 1984) was a British prop comedian and magician. Cooper was a member of the Magic Circle, and respected by traditional magicians. He was famed for his red tarboosh, and his appearance was large and lumbering, at 6 feet 4 inches (1.93 m) and more than 15 stone (210 lb; 95 kg) in weight. On 15 April 1984 Cooper collapsed with a heart attack on live national television. He died soon afterwards."
    },
    {
        "name": "Buatier De Kolta",
        "description": "Buatier de Kolta (né Joseph Buatier; b. 1845, Caluire-et-Cuire (Rhône, France); d. October 1903 in New Orleans) was a French magician who performed throughout the latter part of the 1800s in Europe and America. Buatier de Kolta was a contemporary of fellow French magician Jean Eugène Robert-Houdin. Many of his illusions, such as Multiplying balls, the Expanding Die, the Vanishing Lady, Spring Flowers from a Cone, and the vanishing bird cage, are performed by magicians today.\nIt is the Vanishing Lady that is so particularly known today and still used that magicians now refer to it as the De Kolta Chair. A woman is seated on a chair, was then covered by a large cloth, and would appear to vanish before an audience. The effect was a signature piece of Richiardi Jr - after he vanished the woman she apparently reappeared moments later from an empty trunk on the other side of the stage.\nDe Kolta is the subject of the book Buatier de Kolta: Genius of Illusion by Peter Warlock.\nIn 1903 he died in New Orleans of acute Bright's disease."
    },
    {
        "name": "Chris Cox (Mind Reader)",
        "description": ""
    },
    {
        "name": "Dante (Harry August Jansen)",
        "description": ""
    },
    {
        "name": "Daryl (magician)",
        "description": "Daryl (born August 13, 1955) is the professional name of Daryl Easton, formerly Daryl Martinez, an American magician based in Las Vegas. In his marketing he uses the self-proclaimed title of \"The Magician's Magician.\" Daryl usually goes by his forename only.\nHe specializes in card tricks, close-up and parlor magic."
    },
    {
        "name": "Davenport Brothers",
        "description": "From other capitalisation: This is a redirect from a title with another method of capitalisation. It leads to the title in accordance with the Wikipedia naming conventions for capitalisation, or it leads to a title that is associated in some way with the conventional capitalisation of this redirect title. This may help writing, searching and international language issues.\nIf this redirect is an incorrect capitalisation, then {{R from miscapitalisation}} should be used instead, and pages that use this link should be updated to link directly to the target. Miscapitalisations can be tagged in any namespace.\nUse this rcat to tag only mainspace redirects; when other capitalisations are in other namespaces, use {{R from modification}} instead."
    },
    {
        "name": "David Copperfield (illusionist)",
        "description": "David Seth Kotkin (born September 16, 1956), known professionally as David Copperfield, is an American illusionist, described by Forbes as the most commercially successful magician in history.\nCopperfield's television specials have won 21 Emmy Awards of a total 38 nominations. Best known for his combination of storytelling and illusion, Copperfield's career of over 40 years has earned him 11 Guinness World Records, a star on the Hollywood Walk of Fame, a knighthood by the French government, and he has been named a Living Legend by the US Library of Congress.\nCopperfield has so far sold 33 million tickets and grossed over $4 billion, which is more than any other solo entertainer in history. In 2015, Forbes listed his earnings at $63 million for the previous 12 months and ranked him the 20th highest earning celebrity in the world.\nWhen not performing, he manages his chain of eleven resort islands in the Bahamas, which he calls \"Musha Cay and the Islands of Copperfield Bay\"."
    },
    {
        "name": "David Devant",
        "description": "David Devant (22 February 1868 – 13 October 1941) was an English magician, shadowgraphist and film exhibitor. He was born David Wighton in Holloway, London. He is regarded by magicians as a consummate exponent of suave and witty presentation of stage illusion."
    },
    {
        "name": "Dean Dill",
        "description": "Dean Dill was a magician and effects designer who lived and worked in Glendale, California, USA. He appeared on The Tonight Show in November 1990. His performance focused mostly on closeup effects, and he had a particular passion for and expertise in coin magic. He created and marketed a number of effects, including \"Dean's Box,\" \"Blizzard\", and \"A New World\" (created with magic innovator Michael Weber).\nHe appeared on the cover of the October 2003 edition of The Linking Ring magazine.\nDill died on February 7, 2015."
    },
    {
        "name": "Dedi",
        "description": "Dedi (also Djedi or Djedi of Djed-Sneferu) is the name of a fictional ancient Egyptian magician appearing in the fourth chapter of a story told in the legendary Westcar Papyrus. He is said to have worked wonders during the reign of king (pharaoh) Khufu (4th Dynasty)."
    },
    {
        "name": "Derek Dingle",
        "description": "Derek Dingle (1937–2004) was an English close-up magician."
    },
    {
        "name": "Dinardi",
        "description": "Alfred Körber (18 June 1911 – 3 October 1996), known by his stage name Rolf Dinardi (or simply Dinardi) was a German magician best known for his performances with feather flowers."
    },
    {
        "name": "Dorothy Dietrich",
        "description": "Dorothy Dietrich is a famous American stage magician and escapologist, who tops most best female magicians lists and is best known as the first and only woman to have performed the bullet catch in her mouth, sawing men in half and the first female to perform a straitjacket escape while suspended hundreds of feet in the air from a burning rope (as shown on a Home Box Office Special). She was the first woman to gain prominence as an escape artist since the days of Houdini, breaking the glass ceiling for women in the field of escapes and magic. She has been named as one of the top four escape artists in history. The 2006 Columbia Encyclopedia  included Dietrich among their \"eight most noted magicians of the late 20th century\", and entertainment writer Samantha Hart in her definitive book \"The Hollywood Walk of Fame\" called her a \"world-class magician\" and \"one of the world's leading female magicians\". Early on, as a teenager, she already was dubbed as \"The First Lady of Magic.\"  Dietrich, often called the female Houdini, has duplicated many of Houdini's original escapes, and has gone one step further by doing the Jinxed Bullet Catch Stunt – the one that Houdini backed away from."
    },
    {
        "name": "Fred Culpitt",
        "description": "Frederick Willis Culpitt (9 May 1877 in Southwark St Saviour, London; 1944 in Wandsworth, London) was an English stage magician and magic inventor. He achieved stage success in the early part of the 20th century with a comedy magic act and is also notable as the first magician to appear on a regularly scheduled television show.\nCulpitt got his first big break when the American \"chinese-style\" magician Chung Ling Soo booked him for a tour of Australia in 1909. Between 1914 and 1918 Culpitt replaced David Devant at St. George's Hall, London, performing as a \"magical comedian\".\nCulpitt is credited with inventing the Doll's House Illusion, the Costume Trunk Illusion and the Silk To Egg Trick, which continue to be used by magicians. He is also credited with devising methods for the Torn and restored newspaper trick and various other effects that have become a part of the stage magic repertoire.\nIn 1936 the BBC began test broadcasts from Alexandra Palace, London, for the world's first regular television service. In an effort to find material that would work well on the new medium the corporation sought entertainment acts that had a strong visual element. Culpitt was recruited to present magic, thus helping to establish a lasting place for magic in television variety programming.\nAlso in 1936, Culpitt appeared in the film Keep Your Seats, Please, which starred George Formby. According to the British Film Catalogue, Culpitt, in a small supporting role, played a magician."
    },
    {
        "name": "Jason Dean (magician)",
        "description": "Jason Dean (born 1980) is an American magician. At a young age, he was described by Max Maven as someone \"with the power to raise even the most jaded eyebrows\". In Kansas City, Missouri, he won the title of \"Closeup Magician of the Year\" for four years running, from 2002 to 2005."
    },
    {
        "name": "Lewis Davenport",
        "description": "Lewis Davenport was a fictional character in UK soap opera Family Affairs, played by Sam Stockman from 2002 until 2004."
    },
    {
        "name": "Paul Curry",
        "description": "Paul Curry (1917–1986) was the vice-president of the Blue Cross Insurance Company of New York, and a famous amateur magician who became well known in the magic community for inventing highly-original card magic.\nMany magicians have performed illusions and effects created by Curry. Doug Henning used Curry's \"The Sliding Knot\" in one of his TV specials. Curry's most famous creation is Out of This World, which he created in 1942, at the age of 25. Curry is the author of a number of books and manuscripts dealing with his many original magical creations.\nHe has also been credited with inventing the missing square puzzle.\nOn 12 March 1977, the Academy of Magical Arts at The Magic Castle awarded Paul Curry a \"Creative Fellowship\" award."
    },
    {
        "name": "Paul Daniels",
        "description": "Newton Edward \"Paul\" Daniels (6 April 1938 – 17 March 2016) was an English magician and television presenter. Daniels achieved international fame through his television series The Paul Daniels Magic Show, which ran on the BBC from 1979 to 1994. He was known for his catchphrase of \"You'll like this ... not a lot, but you'll like it\" and also for his marriage to his assistant, Debbie McGee. He was awarded the \"Magician of the Year’\" Award by the Academy of Magical Arts in 1982, the first magician from outside the United States to receive it. He also won the Golden Rose of Montreux in 1985.\nDaniels was known for being outspoken on matters including politics and current affairs as well as magic, entertainment and fellow celebrities. He also appeared in reality television shows. He has been widely described as \"The Godfather of Modern Magic\" and was repeatedly credited with inspiring many top professional magicians to start in the profession."
    },
    {
        "name": "Persi Diaconis",
        "description": "Persi Warren Diaconis (born January 31, 1945) is an American mathematician of Greek descent and former professional magician. He is the Mary V. Sunseri Professor of Statistics and Mathematics at Stanford University. He is particularly known for tackling mathematical problems involving randomness and randomization, such as coin flipping and shuffling playing cards."
    },
    {
        "name": "Thomas Nelson Downs",
        "description": "Thomas Nelson Downs, also T. Nelson Downs, (March 16, 1867 – September 11, 1938) was one of the most famous manipulative magicians renowned for his coin tricks. Downs was also known as \"The King of Koins\".\nMagic historian David Price has written that Downs \"was the first of the great manipulative magicians and probably the greatest of them all.\""
    },
    {
        "name": "Tony Corinda",
        "description": "Tony Corinda (May 17, 1930 – July 1, 2010) was an English mentalist, magic dealer, magic inventor and businessman who wrote the book Thirteen Steps To Mentalism. Corinda did not make his birthplace public although it is believed he was born in Mill Hill, London. Born Thomas William Simpson, he took the name Tony Corinda (a variation on the name Conradi) when he began working as a mentalist in the UK. In 1950, he opened a magic studio where he sold all types of magic, but catered especially to mentalists. Later, he took over The Magic Shop in Oxford Street,London which was originally run by Dick Chavel. This store was at street level so catered mainly to the lay public, so many of the items sold were either practical jokes or beginners' tricks, but other items and small illusions for semi-professional magicians and hobbyists were also sold over the counter. Around the same period, Corinda had the magic concession in Hamleys Toy Shop in Regent Street.\nFrom 1956 to 1958, Corinda wrote a series of thirteen booklets on mentalism, each one dealing with a different aspect of mentalism or an allied art. The booklets were originally published as 13 individual 'courses'. Compiled as the encyclopedic \"Corinda's 'Thirteen Steps to Mentalism'\" the series was produced circa 1961 as a hardcover bound volume by Harry Clarke, a printer who produced many other books for magic studios at that time. Jon Tremaine and Eric Mason did much of the artwork.{ John Henley 2014 and later published in 1964 as a complete volume by D. Robbins and Co. From then the book went on to be regarded as the essential 'mentalism' reference book.\nIn 2011 Corinda's Thirteen Steps to Mentalism was republished in the Encyclopedia of Mentalism and Mentalists. http:\/\/www.mysticlightpress.com\/index.php?page_id=156 .\nThe book was later adapted into video format by mentalist and magician, Richard Osterlind.\nHis inventions are mainly from that book.\nHe lived out his retirement in Norfolk, England, and died on July 1, 2010."
    },
    {
        "name": "Alex Elmsley",
        "description": "Alex Elmsley (2 March 1929 – 8 January 2006) was a Scottish magician and computer programmer. He was notable for his invention of the Ghost Count or Elmsley Count, creating mathematical card tricks, and for publishing the mathematics of playing card shuffling.\nHe began practising magic in 1946, as a teenager. He studied physics and mathematics at Cambridge University; whilst there he was also secretary of the Pentacle Club. He was a patent agent, and later a computer expert, in his day job. Otherwise, he was an amateur card and close-up magician. He was awarded an Academy of Magical Arts Creative Fellowship in 1972.\nHe created a number of magic tricks, including the Ghost Count, Between Your Palms, Point Of Departure and Diamond Cut Diamond.\nHe wrote Elmsley's 4 Card Trick (1967) and Cardwork (1975), and was the subject of The Collected Works of Alex Elmsley (vol. 1 1991, vol. 2 1994).\nThe special count used in Elmsley's 4 Card Trick was renamed after him as the Elmsley Count."
    },
    {
        "name": "Christian Farla",
        "description": "Christian Farla is a Dutch illusionist\/magician whose homebase is in Rhoon, near Rotterdam. Christian Farla is one of the few magicians who are specialized in mega-illusions. In 2006 and 2009, he won the Merlin Award, the highest international award for magicians."
    },
    {
        "name": "Doc Eason",
        "description": "William H 'Doc' Eason (born July 22, 1947) is an American magician who specializes in bar magic. For 27 years, he was the featured entertainer at John Denver's World Famous Tower Comedy\/ Magic Bar in Snowmass Village, CO. (1977–2004). He is also a corporate entertainer, a lecturer, public speaker, author, teacher, consultant and recently was involved in the Fox TV show \"Masters of Illusion\". He talks to corporate and association groups about \"The Therapy of Laughter\" and connecting with customers. His remarkable memory for names is just one of his trademarks.\nWidely recognized as one of the premier bar magicians of our time, he has lectured on the subject to magicians all over the US as well as Australia, Canada, England, Scotland, Netherlands, Austria, Germany, Denmark, Sweden and Norway and most recently Japan.\nEason credits magician, Bob Sheets, as one of his significant influences. He also names Steve Spill, J. C. Wagner, Eddie Houlihan, Eddie Goldstein, and Bob Read as influences."
    },
    {
        "name": "Dynamo (magician)",
        "description": "Steven Frayne (born 17 December 1982), commonly known by his stage name \"Dynamo\", is an English magician, best known for his television show Dynamo: Magician Impossible which ran from July 2011 to September 2014."
    },
    {
        "name": "Fakir of Ava",
        "description": "Isaiah Harris Hughes (25 December 1813 – 24 May 1891), better known as the Fakir of Ava, was a 19th-century stage magician, the teacher of Harry Kellar."
    },
    {
        "name": "Geoffrey Durham",
        "description": "Geoffrey Durham (born 22 July 1949) is a British comedy magician and actor who was known for many years as \"the Great Soprendo\"."
    },
    {
        "name": "Henry R. Evans",
        "description": "Henry Ridgely Evans (1861–1949) was an American amateur magician and magic historian."
    },
    {
        "name": "Joseph Dunninger",
        "description": "Joseph Dunninger (April 28, 1892 – March 9, 1975), known as \"The Amazing Dunninger\", was one of the most famous and proficient mentalists of all time. He was one of the pioneer performers of magic on radio and television."
    },
    {
        "name": "Michael Finney",
        "description": "Michael Finney is a professional magician. He was born in 1954 in Woodland, California. He moved to Phoenix, Arizona in 1978. He has appeared on numerous television specials and performs regularly throughout the U.S. He has appeared on the cover of The Linking Ring."
    },
    {
        "name": "Paul W. Draper",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Pete Firman",
        "description": "Peter \"Pete\" Firman (born 26 April 1980) is an English magician, comedian and television presenter.\nHe has appeared in magic shows on BBC1, Channel 4, Five, and Sky1. He was also the presenter of two game shows on CBBC: Stake Out and Wait for It..!, and one of the regular magicians on series 2 of the BBC One show The Magicians. Firman performs live in theatres and comedy clubs worldwide."
    },
    {
        "name": "Rich Ferguson (magician)",
        "description": "Rich Ferguson (born Richard Jeffrey Evans; December 1, 1970), aka \"The Ice Breaker\", is an American magician. He is the producer and host of the Official Poker Chip Tricks and Card Handling DVD Series. Ferguson went to college for engineering and worked for United Parcel Service prior to becoming a full-time entertainer and creative consultant in 1997. Ferguson married Traci Adams August 8, 2008. Ferguson also has a YouTube channel with over a million subscribers."
    },
    {
        "name": "S. W. Erdnase",
        "description": "S. W. Erdnase is a pseudonym used by the author of The Expert at the Card Table, a book detailing sleight of hand, cheating and legerdemain using playing cards. Still considered essential reading for any card magician, the book, known also as either the Bible or, commonly, just Erdnase, has been in continual publication since 1902. Erdnase's true identity is one of the enduring mysteries of the magic community."
    },
    {
        "name": "Sermet Erkin",
        "description": "Sermet Erkin (born 1957) is a well-known Turkish stage magician, journalist and former theatre actor."
    },
    {
        "name": "Shawn Farquhar",
        "description": "Shawn Farquhar (born June 7, 1962) is a Canadian magician and illusionist notable for his title as the \"Grand Prix World Champion of Magic\" from the International Federation of Magic Societies.\nHis awards include being the only magician in history to win First Place at the International Brotherhood of Magicians (IBM) for both Stage and Sleight of Hand, twice Canadian Association of Magicians Magician of the Year, First Place at the Society of American Magicians annual magic convention competition, three Silver (2nd Place) awards, and a First (World Championship) in Card Magic and the Grand Prix World Championship for Close Up at FISM, the \"Olympics of Magic\". In August 2009, he won his most prestigious prize at the FISM World Championship of Magic in Beijing. On May 1, 2010, the Canadian Association of Magicians once again named him Canadian Magician of the Year, making him the only two-time recipient of their most prestigious award.\nOriginating from Maple Ridge, British Columbia, Farquhar travels the world extensively performing and lecturing for magicians and consults for TV shows and motion pictures. He has appeared on the cover of the largest magic publications in Asia, Europe and North America. He has appeared on stages all over the world, including the Riveria, Las Vegas, Opera House, Blackpool and Orpheum, Vancouver. He has performed for Elizabeth II on her visit to Charlottetown, PEI and has traveled to Bermuda at the request of The Princess Royal.\nHe is a Past President of the International Brotherhood of Magicians, the Canadian Association of Magicians and Pacific Coast Association of Magicians."
    },
    {
        "name": "Siegfried",
        "description": "Siegfried is a German language male given name, composed from the Germanic elements sig \"victory\" and frithu \"protection, peace\". The German name has the Old Norse cognate Sigfriðr, Sigfrøðr, which gives rise to Swedish Sigfrid (hypocorisms Sigge, Siffer), Danish\/Norwegian Sigfred. In Norway, Sigfrid is given as a feminine name.\nThe name is medieval, and did survive in marginal use into the modern period, but after 1876 it enjoyed renewed popularity due to Wagner's Siegfried.\nNotable people with the name include:\nMedieval\nSigfrid of Sweden (died 1045), English missionary to Sweden and patron saint of Växjö\nSiegfried I, Archbishop of Mainz (died 1084)\nSiegfried of Luxembourg (922-998), founder of Luxembourg\nSiegfried III, Archbishop of Mainz (d. 1249)\nSiegfried I, Prince of Anhalt-Zerbst (c. 1230-1298)\nModern\nSiegfried Lipiner (1856-1911), an Austrian poet and author\nSiegfried Wagner (1869-1930), German composer, conductor, and opera director, the son of Richard Wagner\nSiegfried \"Fritz\" Flesch (1872-1939), Austrian saber fencer\nSiegfried Translateur (1875-1944), an Austrian composer of dance music in the early 20th century\nSiegfried Sassoon (1886-1967), an English poet, named Siegried by his mother because of her love of Wagner's operas.\nSiegfried Rapp (1915–1982), one-armed German pianist\nSiegfried Jerusalem (b. 1940), a German operatic tenor\nSiegfried Ziering (1928-2000), a German-born American business executive, playwright and philanthropist\nFictional characters\nSigurd or Siegfried, the legendary dragon-slaying hero in Nibelungenlied\nSiegfried, leading character in the opera of the same name\nSiegfried, the first of Fritz Lang's two-film series, \"Die Nibelungen\"\nSiegfried, a character in History's Strongest Disciple Kenichi\nSiegfried (Get Smart), fictional character in 1960s American comedy television series Get Smart\nSiegfried, a principal character in the ballet Swan Lake\nSiegfried Farnon, one of the main characters in All Creatures Great and Small\nSiegfried Schtauffen, main character of the Soul series of fighting games\nDubhe Alpha Siegfried, Saint Seiya anime series character"
    },
    {
        "name": "Simon Drake",
        "description": "Simon Drake (born Simon Alexander 1 March 1957) is an English magician based in London. He is best known for the innovative and shocking television series The Secret Cabaret made for Britain's Channel 4."
    },
    {
        "name": "Sophie Evans (magician)",
        "description": "Sophie Evans is an English magician who lives and works mainly in Las Vegas. She works regularly at the famous Hollywood Magic Castle, in the close-up room and the parlor, as well as onstage in the Palace. An international award-winning magician, she took the coveted Closeup Award in Australia in the mid-1990s. She is best known in England for her work on the BBC's \"Sorcerers Apprentice\" magical TV series for children.\nShe comes from an established English show-biz family that goes back 4 generations. Her great-great-grandmother was a Gaiety girl; her great-grandfather a music hall performer and her grandfather was well-known stuntman and technical director, Rupert Evans. Other family members include actress Monica Evans, who understudied Joan Littlewood in Rhinoceros and later became become a Pigeon Sister in \"The Odd Couple\" and is the voice of Maid Marian in the 1973 film Robin Hood.\nEvans is a specialist in close-up and comedy magic, as well performing her burlesque-style magical-fire stage act. She has opened for \"The Amazing Johnathan\" in Vegas, and often works with International Magician Kevin James as part of the Award Winning \"Twisted Cabaret\". She also acts as a magic and fire consultant.\n\n"
    },
    {
        "name": "Terry Evanswood",
        "description": "Terry Evanswood is a Merlin Award-winning professional magician who has appeared in live stage shows and on television throughout the United States as well as on international stages. He has performed professionally since the age of ten. Early in his career, Evanswood was awarded an entertainment scholarship to attend the Chavez College of Magic. In 1991, Evanswood became the youngest illusionist in history to perform at Hollywood's famed Magic Castle. Evanswood was presented with the Certificate of Excellence award, which was the first and only honor given by the American Museum of Magic.\nEvanswood is a member of the International Brotherhood of Magicians and the Society of American Magicians having been endorsed by David Copperfield and Harry Blackstone, Jr.. He is a lifetime member of the International Magicians Society (IMS).\nEvanswood has starred in review shows around the world including \"Rio Ecstasy\" in Cancún, Mexico; \"Stars of Magic\" in Sarnia; \"Fabulous Miami\" in Miami Beach, Florida and \"Grand Illusion\" at the American Hotel and Casino in Aruba. Recently, Evanswood has been touring Alaska as onboard entertainment for several cruise lines. Recently, he had his own theater show called Magic Beyond Belief in Pigeon Forge, Tennessee, which closed in late December 2010. Currently, he performs just down the road from the Magic Beyond Belief building at WonderWorks in a show called \"The Wonders of Magic.\"\nThe Evanswood show is ranked as one of the top \"Things to do\" in Pigeon Forge by TripAdvisor"
    },
    {
        "name": "Tim Ellis",
        "description": "Tim Ellis (born 8 May 1963) is an Australian performer, author and lecturer in the world of magic and illusion."
    },
    {
        "name": "Al Flosso",
        "description": "Albert Levinson (Oct. 10, 1895 - May 13, 1976) was an American magician and entertainer, better known by his stage name Al Flosso."
    },
    {
        "name": "Andi Gladwin",
        "description": "Andi Gladwin (May 10, 1983) is a professional British close-up magician, lecturer, publisher and performer. He has appeared on television numerous times, has lectured for magicians throughout the UK, US and Europe and written \/ published several books on magic (especially on card magic). Gladwin is an Associate of the Inner Magic Circle and was granted the Maskelyne Literary Award from the prestigious club."
    },
    {
        "name": "Ching Ling Foo",
        "description": "Ching Ling Foo (Chinese: 金陵福) was the stage name of the Chinese magician Zhu Liankui (Chinese: 朱連魁,1854–1922). He is credited with being the first modern East Asian magician to achieve world fame."
    },
    {
        "name": "Dariel Fitzkee",
        "description": "Dariel Fitzkee (1898–1977) was the pen name of Dariel Fitzroy. He was a magician and writer, born in Annawan, Illinois. His trilogy, known as The Fitzkee Trilogy is considered by many to be an important contribution to the theory of magic.\nIn his memoir, Born Standing Up, comedian and one-time magician Steve Martin describes Fitzkee's Showmanship for Magicians as \"more important to me than The Catcher In The Rye,\" adding that they were, coincidentally, distant relatives by marriage."
    },
    {
        "name": "Frank Garcia (magician)",
        "description": "Frank Garcia (May 8, 1927 – July 15, 1993) was a magician and professional gambler. He was known as \"The Man With The Million Dollar Hands.\" His specialty was gambling scams and cheating.\nThe son of Spanish immigrants, he decided to become a magician after seeing a performance of David \"Fu Manchu\" Bamberg.\nAs \"The Gambling Investigator\" he demonstrated and exposed cheating methods at trade shows and to law enforcement organizations throughout the United States and on television shows. Frank Garcia wrote and lectured about the subject throughout his life.\nGarcia made \"close-up\" work his domain. His repertory of card manipulations, sponge-ball magic, cups and balls, and sleight-of-hand was highly regarded by his peers.\n\n"
    },
    {
        "name": "Gazzo (magician)",
        "description": "Gary 'Gazzo' Osbourne is a British street magician. An expert in cons and scams he moved to the US in the 1980s where he befriended the legendary Walter Irving Scott (The Phantom). He is Scott's only pupil and the only person with whom Scott entrusted his biography and life's work at card cheating and sleights."
    },
    {
        "name": "Greg Frewin",
        "description": "Greg Frewin (born May 21, 1967 in Hamilton, Ontario, Canada) is an illusionist and \"World Champion of Magic\". His awards include First Place at the International Brotherhood of Magicians (IBM); The Gold Medal of Excellence, also from the IBM; First Place at the Society of American Magicians' annual magic convention competition; and first place at FISM, the \"Olympics of Magic\", which were held in Yokohama, Japan in 1994.\nA command performance for Prince Rainier in Monte Carlo along with over 35 TV appearances worldwide attest to this magician's notoriety, Greg is recognized by his peers all over the world as \"The International Grand Champion of Magic\".\nFrewin has appeared on stages all over the world, including Caesars Palace, Tropicana and the Flamingo Hilton in Las Vegas. He is currently signed to a 20-year performance contract at the Greg Frewin Theatre in Niagara Falls, Canada.\nIn 2009 Frewin won the World Magic Awards Magician of the Year.\nFrogwater Media Inc [1] in association with CBC produced a Holiday Special called Greg Frewin Magic Man Home for the holidays in 2009\n\n"
    },
    {
        "name": "Horace Goldin",
        "description": "Horace Goldin (17 December 1873  – 22 April 1939) was a stage magician who was noted for his lightning fast presentation style and who achieved international fame with his versions of the Sawing a woman in half illusion."
    },
    {
        "name": "Imro Fox",
        "description": "Imro Fox (May 21, 1862 – March 4, 1910) was German-born American chef who became a headlining stage magician billed as the “comic conjuror.” He was active between 1880 and 1910 and was known for the line, “Mahvelous! Everything I do is mahvelous.”"
    },
    {
        "name": "James Freedman (Magician)",
        "description": "From other capitalisation: This is a redirect from a title with another method of capitalisation. It leads to the title in accordance with the Wikipedia naming conventions for capitalisation, or it leads to a title that is associated in some way with the conventional capitalisation of this redirect title. This may help writing, searching and international language issues.\nIf this redirect is an incorrect capitalisation, then {{R from miscapitalisation}} should be used instead, and pages that use this link should be updated to link directly to the target. Miscapitalisations can be tagged in any namespace.\nUse this rcat to tag only mainspace redirects; when other capitalisations are in other namespaces, use {{R from modification}} instead."
    },
    {
        "name": "Justin Flom",
        "description": "Justin Flom (born April 29, 1986) is an American magician. He is best known for his YouTube series and television show Wizard Wars in which he performs magic with ordinary objects. Along with his video and television work, he performs live with either his own touring show or opening for music acts in large venues."
    },
    {
        "name": "Karl Germain",
        "description": "Karl Germain, born Charles Mattmueller, (February 12, 1878 – August 9, 1959) was an American magician and lawyer. He performed under the stage name Germain the Wizard."
    },
    {
        "name": "Lennart Green",
        "description": "Lennart Green (born December 25, 1941) is a Swedish world champion close-up\/card magician, a title which he won in 1991 at the FISM convention in Lausanne, Switzerland. He is known for his seemingly chaotic routines which, in spite of first appearances, display great skill. His original techniques and presentation style form an unorthodox and innovative contribution to sleight of hand magic.\nGreen competed at the 1988 FISM convention in The Hague, Netherlands, and was erroneously disqualified because the judges incorrectly believed he had used stooges in his act to shuffle the cards. In 1991, he performed the same act but insisted that the judges themselves shuffle the cards to prove that he used no stooges. The judges then awarded him first place.\nGreen has appeared on the fourth World's Greatest Magic television special. He lives in Gothenburg, Sweden, and lectures internationally.\nHe appeared at TED in February 2005."
    },
    {
        "name": "Lewis Ganson",
        "description": "Lewis Jack Ganson (1913 West Ham, Essex – 22 December 1980 Hampshire) was an English magician who become one of the most prolific writers in magic, going on to write more than sixty books on the subject."
    },
    {
        "name": "Martin Gardner",
        "description": "Martin Gardner (October 21, 1914 – May 22, 2010) was an American popular mathematics and popular science writer, with interests also encompassing scientific skepticism, micromagic, philosophy, religion, and literature—especially the writings of Lewis Carroll, L. Frank Baum, and G. K. Chesterton. He was considered a leading authority on Lewis Carroll. The Annotated Alice, which incorporated the text of Carroll's two Alice books, was his most successful work and sold over a million copies. He had a lifelong interest in magic and illusion and was regarded as one of the most important magicians of the twentieth century. He was considered the dean of American puzzlers. He was a prolific and versatile author, publishing more than 100 books.\nGardner was best known for creating and sustaining interest in recreational mathematics—and by extension, mathematics in general—throughout the latter half of the 20th century, principally through his \"Mathematical Games\" columns, which appeared for twenty-five years in Scientific American, and his subsequent books collecting them.\nGardner was one of the foremost anti-pseudoscience polemicists of the 20th century. His book Fads and Fallacies in the Name of Science, published in 1957, became a classic and seminal work of the skeptical movement. In 1976 he joined with fellow skeptics to found CSICOP, an organization promoting scientific inquiry and the use of reason in examining extraordinary claims."
    },
    {
        "name": "Mat Franco",
        "description": "Mat Franco (born May 10, 1988) is an American magician and the winner of the ninth season of America's Got Talent. Franco rose above tens of thousands of acts to become the first and only magician in history to win AGT, including the $1 million prize. Best known for his personality-driven, sleight-of-hand style of magic, Mat Franco's TV specials marked the first time NBC produced a spin-off show around their AGT winner. Franco is currently headlining in Las Vegas at The Linq Hotel and Casino.\n\n"
    },
    {
        "name": "Paul Gertner",
        "description": "Paul Gertner is an American close-up magician from Pittsburgh. He is best known in the magic world for his \"Steel and Silver\" book and set of DVDs.\n\n"
    },
    {
        "name": "Uri Geller",
        "description": "Uri Geller (\/ˈʊri ˈɡɛlər\/; Hebrew: אורי גלר‎‎; born 20 December 1946) is an Israeli illusionist, magician, television personality, and self-proclaimed psychic. He is known for his trademark television performances of spoon bending and other supposed psychic effects. Throughout the years, Geller has used skilful conjuring tricks to simulate the effects of psychokinesis and telepathy. Geller's career as an entertainer has spanned more than four decades, with television shows and appearances in many countries."
    },
    {
        "name": "Walter B. Gibson",
        "description": "Walter Brown Gibson (September 12, 1897 – December 6, 1985) was an American author and professional magician, best known for his work on the pulp fiction character The Shadow. Gibson, under the pen-name Maxwell Grant, wrote \"more than 300 novel-length\" Shadow stories, writing up to \"10,000 words a day\" to satisfy public demand during the character's golden age in the 1930s and 1940s. He authored several novels in the Biff Brewster juvenile series of the 1960s. He was married to Litzka R. Gibson, also a writer, and the couple lived in New York state."
    },
    {
        "name": "Will Gray",
        "description": "Will Gray is an English magician and entertainer born in the Midlands (Leicestershire) in 1976.\nHe is known as being one of the UK's top close-up corporate magicians and has received great reviews in The Linking Ring p. 69, and The Magic Circular p. 371, for his Lecture 'Magic with a Capital E', which he's currently lecturing to magicians all over the country.\nIn 2008 Will was promoted to Associate Member of the Inner Magic Circle (AIMC) with Silver Star for performing excellence by The Magic Circle, London.\nIn 2009, 2010 & 2011 he was invited to the 4F's Fechter's Finger Flinging Frolic, a special invitation-only magic convention in New York City for the top 200 close - up magicians in the world.\n\n"
    },
    {
        "name": "Alexander Herrmann",
        "description": "Alexander Herrmann (February 10, 1844 – December 17, 1896) was a French magician, better known as Herrmann the Great."
    },
    {
        "name": "Doug Henning",
        "description": "Douglas James Henning (May 3, 1947 – February 7, 2000) was a Canadian magician, illusionist, escape artist and politician."
    },
    {
        "name": "Emil Jarrow",
        "description": "Emil Jarrow (April 8, 1876 – March 4, 1959) was a celebrated sleight of hand magician. He sometimes referred to himself humorously as a \"prestidigitator.\" Jarrow (also spelled Jaro & Jarow) was perhaps best known for creating the “lemon trick,” in which he would procure paper money from an apparently fresh lemon."
    },
    {
        "name": "Ertuğrul Işınbark",
        "description": "Mehmet Ertuğrul Işınbark (July 24, 1940 – May 28, 2014), aka Mandrake, was a well-known Turkish stage magician."
    },
    {
        "name": "Franz Harary",
        "description": "Franz Harary (born July 18, 1962) is an American magician and inventor who has appeared on television shows such as the first episode of NBC's The World's Greatest Magic, on which Harary made the Space Shuttle appear to vanish.\nWhile studying music at Eastern Michigan University and aspiring to be a singer and dancer on Broadway, Harary was designing illusions as a hobby. He began performing publicly after persuading the university's marching band leader to let him appear as part of the halftime show. Between 1982 and 1984, Harary's Odyssey In Illusion team designed and executed illusions for ballet troupes, ice revues, marching bands, and symphony orchestras. It was featured on ABC-TV's live telecast of the 1983 Thanksgiving Day parade in Detroit. At the end of 1983, Harary sent Michael Jackson a videotape of Odyssey In Illusions greatest hits and within a week was invited to perform as part of the Jacksons' \"Victory Tour\" in 1984. Harary made Jackson levitate and disappear on one side of the stage and reappear with his brothers on the other side. In 1990, a character in World Championship Wrestling called The Black Scorpion used magic in efforts to anger the popular Sting. Wrestling websites claim Harary was the masked man performing the magic.\nAmong other music acts he has designed illusions for are N*SYNC, Cher, Snoop Dogg, Tupac Shakur, Tone Loc, Styx, Dr. Dre, Usher, Boyz II Men, Queen Latifah, Hammer, Tina Turner, Reba McEntire and Missy Elliott.\nIn 1996 Harary created all the magic segments for the Broadway production Ragtime, in which Houdini was one of its main characters.\nHarary's own touring show is especially popular in Asia and the Far East. In the U.S. he is most often seen in Atlantic City.\nFranz Harary recently appeared as a technical advisor for the Magic Challenges during seasons 3 and 5 of America's Best Dance Crew."
    },
    {
        "name": "Gopinath Muthukad",
        "description": "Gopinath Muthukad is a magician, escapologist, life coach, and motivational speaker from Kerala, India. He employs magic as a medium to convey his messages to public. He founded the first magic academy of Asia at Thiruvananthapuram. He won the Kerala Sangeetha Nataka Academy award in 1995. He is also a winner of the International Merlin Award instituted by the International Magicians' Society."
    },
    {
        "name": "Harry Houdini",
        "description": "Harry Houdini (born Erik Weisz, later Ehrich Weiss or Harry Weiss; March 24, 1874 – October 31, 1926) was a Hungarian born American illusionist and stunt performer, noted for his sensational escape acts. He first attracted notice in vaudeville in the US and then as \"Harry Handcuff Houdini\" on a tour of Europe, where he challenged police forces to keep him locked up. Soon he extended his repertoire to include chains, ropes slung from skyscrapers, straitjackets under water, and having to escape from and hold his breath inside a sealed milk can with water in it.\nIn 1904, thousands watched as he tried to escape from special handcuffs commissioned by London's Daily Mirror, keeping them in suspense for an hour. Another stunt saw him buried alive and only just able to claw himself to the surface, emerging in a state of near-breakdown. While many suspected that these escapes were faked, Houdini presented himself as the scourge of fake spiritualists. As President of the Society of American Magicians, he was keen to uphold professional standards and expose fraudulent artists. He was also quick to sue anyone who imitated his escape stunts.\nHoudini made several movies, but quit acting when it failed to bring in money. He was also a keen aviator, and aimed to become the first man to fly a plane in Australia."
    },
    {
        "name": "Hendra Gunawan (magician)",
        "description": "Hendra Gunawan is an Indonesian magician. Also known as Hendramagic, he is a member of the Society of Indonesian Magicians.\nHe developed his knowledge of magic in Jakarta and after performing three days of magic shows with Alford the Magician, Indonesia’s top illusionist, he resolved to make a career in the profesison. He studied under Mr. Lee, Uncle Tan and Dui Montero. He began performing in his local church and gradually received bookings for shows at malls, hotels and corporate events. Aside from performing he is also an inventor of innovative magic boxes which have received orders from as far away as the United States and Serbia."
    },
    {
        "name": "Jean Hugard",
        "description": "Jean Hugard (4 December 1872 - 14 August 1959) was an Australian professional magician."
    },
    {
        "name": "John Hamman",
        "description": "Brother John Charles Hamman S.M. (September 3, 1927 – December 5, 2000) was a Marianist Brother and professional close-up magician. The tricks he invented are still an integral part of many close-up magician's repertoire. Br. Hamman was world-renowned in the magic community. His initial interest in the art started as a child. As he recuperated from polio, he spent hours learning, practicing and inventing card tricks and other magic involving sleight-of-hand. In many cases, he \"reinvented\" classic maneuvers or streamlined them. He was a member of the International Brotherhood of Magicians, the Catholic Magicians' Guild and the Society of American Magicians.\n\n"
    },
    {
        "name": "John Northern Hilliard",
        "description": "John Northern Hilliard (1872 – March 14, 1935) was an American author and journalist. Among his works is a best-selling book on magic, Greater Magic."
    },
    {
        "name": "Kevin James (magician)",
        "description": "Kevin James (born April 28, 1962) is an award-winning French-born American magician, known for creating several unique magical effects, such as the \"Floating Rose\" which is performed by David Copperfield.\nHe had long-running performance runs at venues such as Crazy Horse (Paris) and Caesars Palace. He has won the \"Parlour Magician of the Year\" award from the Magic Castle and also appeared on the CBS television special, \"World's Greatest Magicians at the Magic Castle\". In 2007, he was a contestant on the second season of the televised competition America's Got Talent, where he proceeded as far as the semi-finals."
    },
    {
        "name": "Murray and Teresa Hatfield",
        "description": "Murray and Teresa Hatfield are professional magicians from Victoria, British Columbia, Canada, having lived there since 2006. Murray Hatfield has performed as a solo performer in Germany, Israel, Cyprus, Mexico, North Pole and Japan. Teresa joined Murray in 1992 as a dancer and by 1995 had become his partner on stage. Together they have toured and performed in New Zealand, Australia, Singapore, United Kingdom and throughout North America.\nThey are the recipients of many major awards including the Canadian Association of Magicians 2005-2006 Canadian Magicians of the Year. In 1997, they were awarded the Pacific Coast Association of Magicians Silver Medal in the ProChallenge Competition. In 2009 the President of the International Brotherhood of Magicians, Joan Caesar, awarded them a Presidential Citation for their ongoing contributions to magic.\nIn 2006, Murray Hatfield purchased a magic shop located in Victoria. After seven years of being owned by Hatfield, the store, which has existed in one form or another since the 1970s, closed its doors for good on August 25, 2013.\nCurrently they star and produce the largest touring magic show in Canada."
    },
    {
        "name": "Neil Patrick Harris",
        "description": "Neil Patrick Harris (born June 15, 1973) is an American actor, producer, singer, comedian, magician, and television host. He is known for playing the title character on Doogie Howser, M.D. (1989–93), and for his role as Barney Stinson on How I Met Your Mother (2005–14), for which he was nominated for four Emmy Awards.\nHe is also known for his role as the title character in Joss Whedon's musical Dr. Horrible's Sing-Along Blog (2008) and a fictional version of himself in the Harold & Kumar film series (2004–11). He appeared in the films Starship Troopers (1997), Beastly (2011), The Smurfs (2011), The Smurfs 2 (2013), A Million Ways to Die in the West (2014) and Gone Girl (2014).\nHarris was named one of Time magazine's 100 Most Influential People in 2010. He has hosted the Tony Awards on Broadway in 2009, 2011, 2012 and 2013, for which he won several special class Emmy Awards. He also hosted the Primetime Emmy Awards in 2009 and 2013, and hosted the 87th Academy Awards in 2015, thus making him the first openly gay man to host the Academy Awards. In 2014, he starred in the title role in Hedwig and the Angry Inch on Broadway, for which he won the 2014 Tony Award for Best Leading Actor in a Musical."
    },
    {
        "name": "P. James (magician)",
        "description": "P. James (née V. Kennedy) is a magician from the city of Chennai, in South India. He is best known for his famous guerrilla advertising campaign (inspired by Brooke Bond painted wagons), in which the phrase \"P. James Magic Show\" and his phone number are painted on virtually every street in the city. It has been estimated that there are at least 30,000 instances of his advertisement. James adopted his stage name after his grandfather, also a performing magician.\n\nChennai is a city where the wall space is tightly controlled and shared by competing political parties. It is also dominated by advertisements for commercial goods and services. Despite this, James has achieved a high penetration with his marketing campaign, at a low cost. He has, however, spent a total of 14 years painting, setting out by himself at 9:30 PM. He uses a mixture of black oxide and Fevicol for the paint, as this is cheap, but also survives through rain. James' technique has been called naive by some observers. Indeed, the advertising campaign has not resulted in particularly high market share, although James attributes this to the increasing movement of magic from the stage to the television screen.\nJames' campaign has spawned several imitators, notably A-Z entertainment, which adopts a similar font and style of placement, though at a lower concentration. It is not known what link, if any, exists between the various organizations. It is also unknown what relationship James has with the nationally famous P.C.Sorkar, or with rising local talent, such as JMK Disco Raja.\nIn late 2007, James was requested by the Commissioner of Police to abstain from his sign-painting. This is the culmination of various efforts by authorities to put an end to James' advertising campaign.\n\nIn August 2009 the magician lent his name to a book project called “Looking For P James”. The book was a photo journal of the city of Madras-Chennai which was written by the British author Darren Burnham and published by Global Adjustments"
    },
    {
        "name": "Paul Harris (magician)",
        "description": "Paul Tomas Harris is an American inventor, magician, and writer. Described by the magic magazine Genii (December 1996) as \"the most innovative magic mind of our day,\" Harris is listed in Magic magazine (August 1999) as one of \"the 100 [magicians] who shaped the art [of magic] in America\"."
    },
    {
        "name": "Rob James (magician)",
        "description": "Rob James (born 24 July 1978) is an English magician.\nHe has appeared on several TV shows including the History Channel's Decoding the Past. and has had his original material published (\"Cardboard Metamorphosis\") in the conjuror's magazine Genii."
    },
    {
        "name": "Scott Interrante",
        "description": "Scott Interrante (born August 4, 1961) is an American magician who specializes in escape-artist feats and grand illusions.\nHe is a third-generation magician. At 17, Scott answered an audition posting for the movie Ragtime and got the job to re-create Houdini's stunt of escaping from a strait-jacket while dangling upside-down over the streets of New York City. He was a protégé of one of world's foremost escapists, James Randi, and joined him for his first world tour, celebrating his 18th birthday in Sydney, Australia. While in Australia, Scott appeared with James Randi in the film \"Explorer\" and assisted in public paranormal challenges in an effort to give away the then sum of (U.S.) $100,000 to anyone who could produce such pre-determined paranormal events under fair and supervised conditions. Scott Interrante has won awards from the Society of American Magicians, the International Brotherhood of Magicians and the International Magicians Society."
    },
    {
        "name": "Theodore Hardeen",
        "description": "Theodore \"Dash\" Hardeen (born Ferenc Dezső Weisz (Hungarian name order: Weisz Ferenc Dezső), March 4, 1876 – June 12, 1945), known simply as Hardeen, was a Hungarian magician and escape artist who was the younger brother of Harry Houdini. Hardeen, who usually billed himself as the \"brother of Houdini\", was the founder of the Magician's Guild. Hardeen was the first magician to conceive escaping from a submerged straitjacket in full view of the audience, rather than behind a curtain."
    },
    {
        "name": "Will Goldston",
        "description": "Will Goldston (1878–1948) was a English stage magician in the first half of the 20th century."
    },
    {
        "name": "André Kole",
        "description": "André Kole (born Robert Gurtler Jr.; September 30, 1936) is an American magician and inventor of magical effects. He is also a committed Christian and is a public speaker for the evangelical group Campus Crusade for Christ International. He also is known for using his magical knowledge to debunk frauds and hoaxes.\n\n"
    },
    {
        "name": "Barry Jones (magician)",
        "description": "With possibilities: This is a redirect from a title that potentially could be expanded into a new article or other type of associated page such as a new template. The topic described by this title may be more detailed than is currently provided on the target page or in a section of that page. When used on a template redirect, it will automatically populate Category:Template redirects with possibilities.\nWhen the target page becomes too large or for any reason a new page would be an improvement, this redirect may be replaced with an article, template or other project page that is carved out of the target page. See also {{R to section}} and use together with this rcat when appropriate.\nIf the topic of the redirect is not susceptible to expansion, then use other rcats such as {{R to section}} or {{R to list entry}} instead.\nSince a new page may be created, links to this redirect should not be replaced with a direct link to the target page."
    },
    {
        "name": "Buatier De Kolta",
        "description": "Buatier de Kolta (né Joseph Buatier; b. 1845, Caluire-et-Cuire (Rhône, France); d. October 1903 in New Orleans) was a French magician who performed throughout the latter part of the 1800s in Europe and America. Buatier de Kolta was a contemporary of fellow French magician Jean Eugène Robert-Houdin. Many of his illusions, such as Multiplying balls, the Expanding Die, the Vanishing Lady, Spring Flowers from a Cone, and the vanishing bird cage, are performed by magicians today.\nIt is the Vanishing Lady that is so particularly known today and still used that magicians now refer to it as the De Kolta Chair. A woman is seated on a chair, was then covered by a large cloth, and would appear to vanish before an audience. The effect was a signature piece of Richiardi Jr - after he vanished the woman she apparently reappeared moments later from an empty trunk on the other side of the stage.\nDe Kolta is the subject of the book Buatier de Kolta: Genius of Illusion by Peter Warlock.\nIn 1903 he died in New Orleans of acute Bright's disease."
    },
    {
        "name": "Charles Jordan (magician)",
        "description": "Charles Thorton Jordan (1 October 1888 – 24 April 1944) was an American magician."
    },
    {
        "name": "Emil Kio",
        "description": "Emil Teodorovich Kio, born Emil Teodorovich Girshfeld-Renard (Russian: Эмиль Теодорович Кио, Эмиль Теодорович Гиршфельд-Ренард; 11 April 1894 – 19 December 1965) was Soviet illusionist, People's Artist of the RSFSR.\nHis sons, Igor Kio and Emil Kio, Jr., became famous Soviet magicians as well."
    },
    {
        "name": "Fred Kaps",
        "description": "Fred Kaps (official name Abraham Pieter Adrianus Bongers) (June 8, 1926 – July 22, 1980) was a Dutch magician, famous for being the only magician to become FISM Grand Prix world champion three times. He was the creator of numerous original effects including his version of the color-changing silks. Another popular effect he often performed was the long-pour salt trick. Part of the act has Kaps exhibiting facial expressions of great surprise and disbelief, as he tries unsuccessfully to desperately stop the flow.\nAnother of Kaps' most renowned tricks throughout the world was the Dancing & Floating Cork, which he performed at extremely close quarters, allowing his audience to be really close-up to view the illusion.\nA small cufflink box was shown, then opened to find a wine bottle cork resting inside. With hands being held extremely steady, the cork starts to move and wriggle around inside the box. It is stated that this is a floating cork; well, all corks float on water. This one floats on air. With that, the cork floats outside the box with absolutely no visible means of support.\nA small four-inch diameter metal ring is then passed over the cork every which-way. The cork stays floating. The audience is so close they cannot see anything holding the cork afloat. At the conclusion Kaps would grab the cork and pass it to an audience member watching.\nThis was such a spectacular and successful trick that Fred Kaps then collaborated with London magician Ken Brooke at Ken Brooke's Magic Place, who then marketed the trick to magicians from the early 1970s. Before one could purchase the Kaps Dancing & Floating Cork, one would have to sign a contract with Ken Brooke NOT to reveal or share the secret with anyone, not even fellow magicians. Then one would be permitted to buy the Kaps trick.\nThe cork trick developed such a successful reputation as a close-up illusion that Michael Parkinson had Fred Kaps feature it on the British TV show Parkinson.\nFred Kaps always performed with great joy and worked very hard. He always had beads of sweat on his brow. He'd often joke about it, \"This is a magnificent building\", he said with his tenor voice, \"but I think the roof is leaking.\" This would always get a laugh, which he would milk."
    },
    {
        "name": "Gustavus Katterfelto",
        "description": "Gustavus Katterfelto (or Katerfelto) (c. 1743-1799) was a Prussian conjurer, scientific lecturer, and quack."
    },
    {
        "name": "Hans Klok",
        "description": "Johannes Franciscus Catharinus \"Hans\" Klok (born 22 February 1969) is a Dutch magician, illusionist and actor."
    },
    {
        "name": "Harry Kellar",
        "description": "Harry Kellar (July 11, 1849 – March 10, 1922) was an American magician who presented large stage shows during the late 19th and early 20th centuries.\nKellar was a predecessor of Harry Houdini and a successor of Robert Heller. He was often referred to as the \"Dean of American Magicians\" and performed extensively on five continents. One of his most memorable stage illusions was the levitation of a girl advertised as the \"Levitation of Princess Karnack\", copied from an illusion invented by John Nevil Maskelyne.\nHe was a longtime customer of the Martinka Magic Company, which built many of his illusions and sets, including the \"Blue Room\"."
    },
    {
        "name": "Igor Kio",
        "description": "Igor Kio (13 March 1944 – 30 August 2006) was a Russian illusionist with the Russian Circus Association. A member of the International Brotherhood of Magicians, he won numerous awards including People's Artist of the Russian Federation and an Oscar from Belgium.\nIgor was born into a family of circus performers, to another noted Russian magician Emil Kio. Taught from birth, he began appearing in front of audiences at the age of 5. By the age of 15, he was working professionally as a magician.\nIn addition to his work with the state circus company, he often performed on television, including an annual New Years Day program in the 1980s.\nHe was married briefly to Galina Brezhneva, the daughter of Leonid Brezhnev, a union which lasted only 9 days."
    },
    {
        "name": "Joshua Jay",
        "description": "Joshua Jay (born October 30, 1981) is a magician, author, and lecturer who has performed his show in over 59 countries. In 1998 he was crowned World Champion of Close-up Magic at the World Magic Seminar, and he has subsequently appeared on every major television network. Notably, he has performed on Good Morning America and the Today Show. He is the author of seven books on magic, including Magic: The Complete Course [Workman, 2008], which is available in four languages. Jay specializes in close-up magic and is a headliner at the famous Magic Castle in Hollywood. He attended Ohio State University, where he was a member of the Sigma Alpha Mu fraternity. Joshua Jay currently resides in New York City.\n\n"
    },
    {
        "name": "Kristen Johnson (escape artist)",
        "description": "Kristen Johnson is an award-winning escape artist who works with her husband magician Kevin Ridgeway under the names Living Illusions, Ridgeway & Johnson and Breathless. She was the featured magician on the cover of the June 2009 issue of the magicians' magazine The Linking Ring."
    },
    {
        "name": "Larry Jennings",
        "description": "Larry Jennings (February 17, 1933 – October 17, 1997) was a magician, best known for his card techniques. He has eight books published by, or written about him. He is also known for being close friends with fellow magician Dai Vernon."
    },
    {
        "name": "Luke Jermay",
        "description": "Luke Jermay (born 7 March 1985 in Basildon, Essex, England) is an English magician, mentalist, and writer."
    },
    {
        "name": "Mac King",
        "description": "Mac King (born December 2, 1959) is a comedy magician who has performed on television specials, often as a co-host. He has his own family-friendly show, \"The Mac King Comedy Magic Show,\" at the Harrah's Las Vegas in the Clint Holmes Theater.\nOn the NBC The World's Greatest Magic specials, King taught the audience a minor effect before and after each commercial in segments referred to as the Mac King School of Magic. He is the only magician to be in all five of the network's specials.\nIn addition to the TV specials and Harrah's performances, King performs at more than 60 private corporate events each year. Some of his better-known effects involve goldfish, Fig Newtons, and a yellow raincoat he claims is a magic cloak of invisibility.\nOne of King's most memorable moments occurred while performing his cut-and-restored rope routine. King has said that one of his biggest pet peeves is that some magicians use dull scissors, and he makes it a point to keep his scissors razor sharp. While performing the routine, he accidentally severed the tip of his thumb. He quickly tried to stop the bleeding by wrapping his thumb in tape, but the injury was too severe. He asked the audience if there was a nurse present, and a nurse stepped forward. She managed to stop the bleeding. King continued with his show and finished his second show later that evening before going to the hospital to have his injury treated.\nAfter performances, King greets show attendees as they exit, signing autographs on pictures or books. His typical autograph reads: \"I'm Mac King.\""
    },
    {
        "name": "Paul Kieve",
        "description": "Paul Kieve (born 1967) is an English professional illusionist and whose consulting work for both stage and screen has contributed to changing how magical special effects in productions are approached. He is the only illusionist ever to have won a New York Drama Desk award (for Ghost the Musical on Broadway). He created the illusions for the 2014 Kate Bush concert Before the Dawn."
    },
    {
        "name": "Penn Jillette",
        "description": "Penn Fraser Jillette (born March 5, 1955) is an American magician, juggler, comedian, musician, inventor, actor, and best-selling author known for his work with fellow magician Teller as half of the team Penn & Teller. He is also known for his advocacy of atheism, scientific skepticism, libertarianism and free-market capitalism."
    },
    {
        "name": "Peter Kane (magician)",
        "description": "Peter Kane (1938 – 18 March 2004) was a British magician born in England. Kane created some memorable close-up magic effects. He contributed many routines to various magic periodicals."
    },
    {
        "name": "Ricky Jay",
        "description": "Richard Jay Potash (born 1948), known professionally as Ricky Jay, is an American stage magician, actor, and writer. In a profile for the New Yorker, Mark Singer called Jay \"perhaps the most gifted sleight of hand artist alive\". In addition to sleight of hand, Jay is known for his card tricks, card throwing, memory feats, and stage patter. He has also written extensively on magic and its history. His acting credits include the films The Prestige, The Spanish Prisoner, Mystery Men, Heist, Boogie Nights, Tomorrow Never Dies, and Magnolia, and the HBO series Deadwood."
    },
    {
        "name": "The Amazing Johnathan",
        "description": "John Edward Szeles (born September 9, 1958), better known by the stage name The Amazing Johnathan, is an American stand-up comedian\/magician. His act is mostly composed of hijinks, interaction with one specific audience member, and a few legitimate magic tricks. From 2001 to 2014, he was a year-round headliner in Las Vegas. Self-described as the \"Freddy Krueger of Comedy\", Szeles usually performs wearing his everpresent headband and his shows frequently use gore, such as pretending to suck on his own hanging eyeball, cutting his wrists, and skewering his own tongue. He is also good friends with fellow performer Criss Angel, and has helped Angel perform a variety of illusions, most notably during his three guest appearances on Mindfreak."
    },
    {
        "name": "Al Koran",
        "description": "Al Koran(1914–1972) was a British mentalist, author and inventor. He invented the Ring Flite and popularised a version of the Bagshawe deck which became known as the Koran deck. Al Koran was the stage name of Edward Doe, who was a former hairdresser that turned professional magician\/mentalist. Al appeared many times on The Ed Sullivan Show. He emigrated to the United States in January 1969, first to Cleveland, Ohio and then later settling in Chicago, Illinois. After his death from cancer his ashes were handled by his friend and fellow magician Billy McComb.\nAl Koran is considered by most mentalists to be one of the best to have ever performed. He contributed a great amount of material to the field of mentalism.\n\"Fitness\" magazine wrote of him, in 1958: ... he is as great a psychologist as he is a magician, and has lectured at Cambridge University and before many distinguished audiences. In its relation to physical health, he believes that fitness of the mind plays an all-important part."
    },
    {
        "name": "Curtis Lovell II",
        "description": "Curtis Lovell II is an American illusionist and escape artist. He is known for his high-profile escape performances and his events for corporations. The Washington Times interviewed him for a political piece subtitled \"Houdini Factor\". He was referred to in an article in weekly entertainment newspaper Citizen LA as \"the premiere  [sic] escape artist of our time.\" He has also received coverage for his stunts, including a performance with actor Tony Curtis and Larry King."
    },
    {
        "name": "David Kwong",
        "description": "David Kwong (born 1980) is a magician, puzzle creator, writer, and producer. Founder of the Misdirectors Guild, Kwong is known for creating illusions and puzzles for film and television and for functioning as a consultant and producer in the field. Productions that he has been involved with include Now You See Me (head magic consultant), NBC's Blindspot, The Magnificent Seven, Mission Impossible: Rogue Nation, and The Imitation Game. Kwong also frequently contributes to and writes crossword puzzles for The New York Times along with crossword puzzle editor Will Shortz. Kwong gave a TED Talk on illusion and puzzles at the TED 30th anniversary conference in Vancouver in March 2014.\nKwong is a native of Rochester, New York, where both of his parents are professors at the University of Rochester. He graduated from Harvard University in 2002."
    },
    {
        "name": "Debbie Leifer",
        "description": "Debbie Leifer was named 2006 Greater Atlanta Magician Of The Year by the International Brotherhood of Magicians and the Society Of American Magicians Atlanta chapters. Debbie is the first female corporate magician to receive that honor in the 35-year history of the prestigious award.\nShe is one of the most successful female corporate magicians in the world. She has appeared with Ray Charles, Joan Rivers, Gladys Knight, Phil Collins, The Platters, Earth Wind & Fire, and she had the honor of teaching magic to Muhammad Ali.\nThe subject of a chapter titled \"Wonder Woman\", Debbie was the only female magician featured in the book A Career In Magic. She has appeared on FOX television five times, and was a featured entertainer at the International Energy Exhibition & World's Fair, two Super Bowls, the NBA All-Star Game, and the 1996 Centennial Olympic Games.\nEditor of the Equinox Magical Journal, Debbie serves on the Board of Directors of the Atlanta Georgia chapter of the International Brotherhood of Magicians, and on the National Council of the Society of American Magicians.\nDebbie was the first female demonstrator in the 50-year history of Tannen's Magic Shop in New York City, one of the world's premiere magic stores; she was the only female president of F.A.M.E. (Future American Magical Entertainers), a New York City-based teenage magic club that began in the 1950s; and she is the only female magician featured on the instructional video series \"Magic for Kids\" and \"Magic for Young Adults\".\nArticles profiling Ms. Leifer have appeared in the Atlanta Journal-Constitution, Solutions Magazine, Chai Magazine, the Marietta Daily Journal, the Knoxville News-Sentinel, and her magic shows have been covered by the New York Daily News and the New York Times.\nMs. Leifer was the female star of \"Holiday Magic Show\" in Hong Kong, she has toured Japan five times, and has performed on cruise ships throughout the Caribbean. Star of the sold-out fund-raiser \"A Magical Connection\", Ms. Leifer devotes herself to a significant amount of charitable performances every year, including raising significant money for Tsunami relief and Katrina relief in 2005, and she continues to focus on hunger relief charities."
    },
    {
        "name": "Duane Laflin",
        "description": "Duane Laflin is a noted magician, teacher and innovator. He initially marketed and sold his props, effects and accessories within his company, Laflin Magic but eventually closed his mail-order business to focus strictly on performing and lecturing. Ownership and rights to his props were eventually transferred to his daughter's company, Lock Family Magic. He is a former president of The International Fellowship of Christian Magicians.He is a sought-after lecturer among magic clubs throughout the U.S.\n\nHe was a featured lecturer at ClownFest 2004, a popular clown convention. He was also a featured lecturer at the 2007 convention of The International Brotherhood of Magicians held in Reno, Nevada. He produced and starred in a popular four-volume series of instructional videos on silk magic. He also produced and appeared in the instructional video, \"Simply Beautiful Silk Magic\"."
    },
    {
        "name": "Eliphas Levi",
        "description": "Éliphas Lévi, born Alphonse Louis Constant (February 8, 1810 – May 31, 1875), was a French occult author and ceremonial magician.\n\"Éliphas Lévi\", the name under which he published his books, was his attempt to translate or transliterate his given names \"Alphonse Louis\" into the Hebrew language."
    },
    {
        "name": "Harry Lorayne",
        "description": "Harry Lorayne (born 1926) is an American magician and a memory-training specialist and writer who was called \"The Yoda of Memory Training\" by Time magazine. He is well known for his mnemonic demonstrations and has appeared on numerous television shows including The Tonight Show Starring Johnny Carson. His book The Memory Book was a New York Times bestseller. His card magic, especially his innovations in card sleights, is widely emulated by amateur and professional magicians."
    },
    {
        "name": "Joe Labero",
        "description": "Joe Labero (born 28 July 1963 in Alvesta, Sweden) is a Swedish magician. Joe Labero is a stage name derived from his birthname: Lars Bengt Roland Johansson."
    },
    {
        "name": "John Lovick",
        "description": "John Lovick is an American magician, writer, director, and actor. Since the 1990s he has performed as a magician and actor throughout the United States and Canada, as well as England, Australia, New Zealand, and Malaysia.\nHis performing alter ego, Handsome Jack, is a regular performer at the world-famous Magic Castle in Hollywood, where he is currently serving on the Board of Trustees and has been nominated for the \"Parlour Magician of the Year\" award twelve times. Additionally, he is a writer and has written many cover articles for both MAGIC Magazine and Genii Magazine.\nLovick has invented numerous popular magic effects and regularly lectures at magic conventions. In 2006 he compiled and authored \"SWITCH: Unfolding the $100 Bill Change,\" a comprehensive guide to the bill-switch magic trick, which includes history, performance theory, and presentation ideas for the effect. He has also written the books “Experience: The Magic of Jon Allen”, “Mayhew: What Women Want”, and he co-authored “The Paper Engine.” He produced the popular magic demonstration DVD, \"Reparation,\" which teaches his popular method for the Torn and Restored Card. In August 2016 he released a book detailing his own entire professional magic repertoire, entitled \"The Performance Pieces & Divertissements of the Famous Handsome Jack, etc.\" (generally referred to as \"Handsome Jack, etc.\" and published through SquashPublications.com). This book was a best seller in the magic world and the first printing sold out in less than three months.\nOn July 20, 2015, Lovick (as Handsome Jack) appeared on Penn & Teller: Fool Us and fooled them, with an original Torn and Restored handbill, combined with a presentational angle involving a \"Grappler\" that he purchased from Harry Anderson.\nLovick lives in Los Angeles, California."
    },
    {
        "name": "Justin Kredible",
        "description": ""
    },
    {
        "name": "Kreskin",
        "description": "The Amazing Kreskin, or Kreskin — birthname George Joseph Kresge — is a mentalist who became popular on North American television in the 1970s. He was inspired to become a mentalist by Lee Falk's famous comic strip Mandrake the Magician, which features a crime-fighting stage magician. He has always presented himself as an \"entertainer,\" never as a psychic, who operates on the basis of suggestion, not the paranormal or supernatural."
    },
    {
        "name": "Lou Lancaster",
        "description": "Lou Lancaster (October 31, 1936 – July 5, 2008), born Louis Lancaster McClung, was an American magician and author.\nHis 1984 book Tricks Of The Trade: A Professional Looks at Commercial Closeup Magic OCLC 12995877 [edited by Phyllis Guggenheim; photos by Lancaster & Guggenheim] explained many techniques of close-up magic, and he appeared in several instructional videos produced by the International Magicians Society. The August 2005 issue of The Linking Ring featured a cover story on Lancaster and his innovations.\nLancaster performed at the Magic Castle eighteen times, with multiple engagements throughout Las Vegas, Lake Tahoe, San Francisco, Sacramento, and the Catskills. When in New York he worked at the famous Magic Towne House headed up by Dorothy Dietrich and Dick Brooks. He helped assemble Dietrich's straitjacket escape for the HBO Special The World's Greatest Escapes, in which she appeared as special guest star. She holds the record for the highest stationary escape by a woman from a straitjacket while hanging from a burning rope. She has been quoted as saying, \"I trusted my life to Lou Lancaster!\" She also says he invented the famous Twister illusion for Mark Wilson when he worked on his TV show. He was the resident magician at Magic Island in Newport for two years.\nAfter Lancaster's death, Jeff McBride - who credits Lancaster with giving him his first professional engagement - participated in Lancaster's memorial Broken Wand Ceremony."
    },
    {
        "name": "Minnette Gersh Lenier",
        "description": "Minnette Ella Gersh Lenier (July 9, 1945, Atlanta, Georgia – February 7, 2011, Woodland Hills, Los Angeles, California) was a teacher and professional magician who used stage magic to improve students' reading and learning skills."
    },
    {
        "name": "Misty Lee",
        "description": "Misty Lee (born in Mount Clemens, Michigan) is an American voice actress, comedian, and professional magician."
    },
    {
        "name": "René Lavand",
        "description": "Héctor René Lavandera, known as René Lavand (24 September 1928 – 7 February 2015), was a magician from Argentina specialising in close-up magic. He appeared in Ed Sullivan's and Johnny Carson's television shows as well as shows at Hollywood's Magic Castle.\nAfter losing a hand at the age of 9 in a car crash, Lavand slowly taught himself the art of conjuring because, in his own words, \"all books and techniques are for two-handed magicians\". After working as a cashier in a bank, at the age of 32 he appeared in Buenos Aires' Tabarís Theater, following which his career took off, leading to world tours. The catchphrase he used for one of his most celebrated tricks was \"No se puede hacer más lento\" (Spanish for \"it cannot be done any slower\"), referencing the measured and slow pace of his performances.\nIn between international tours he resided in Tandil, Argentina and adapted a train wagon into a magic saloon where he taught the art of illusion. He also co-wrote (with Richard Kaufman) the book Mysteries of my Life. The book is an autobiography as well as an instructional book on his magic.\nLavand died of pneumonia at the Chacabuco Clinic in Tandil, aged 86."
    },
    {
        "name": "Roadmage",
        "description": "Roadmage is a street magic act created by magician and entertainer Owen Lean.\nSince 2002, Roadmage has been a fixture on Dublin's Grafton Street, London's Covent Garden, Granville Island in Vancouver and at club and festival venues. When Lean graduated in November 2006, the act, with Lean performing in full academical attire on Grafton Street, made national news, including the front page of The Irish Times\n."
    },
    {
        "name": "Servais Le Roy",
        "description": "Servais Le Roy (Spa, Belgium, May 4, 1865 - Keansburg, New Jersey, June 2, 1953 ) was a Belgian magician, illusion designer and businessman. He is known for the act Le Roy, Talma and Bosco and as the inventor of the classic levitation illusion Asrah the Floating Princess.\nLe Roy began his career in Belgium but later moved to London, where he established a supply house for illusions and scenery. At one time he performed with German-born illusionist Imro Fox and Frederick Eugene Powell as The Triple Alliance. However he is best known as a performer for the long-running act he developed with his wife Talma and Leon Bosco. Working as \"Le Roy - Talma - Bosco\" they were sometimes also billed as The Comedians de Mephisto Co. Talma (whose real name was Mary Ford), specialised in sleight of hand and was known as a brilliant manipulator of coins. Bosco, who was a rotund man, played a buffoon character. Although the act was very much a partnership to which all three contributed as magicians, Servais Le Roy sometimes received additional headline billing. According to Wm Rauscher's biography, Monarch of Mystery, Bosco was played by no less than nine different performers over the years.\nServais Le Roy and Talma first performed the Asrah levitation in London in 1914. In this trick, Talma would lie on a couch and Servais would cover her with a sheet. He would then appear to make her rise into the air, pass a large hoop over her floating body, and finally pull away the sheet to reveal that she had vanished. Le Roy is also credited with developing other respected tricks and illusions, including Where do the ducks go?, Modern Cabinet, the Palanquin and the Costume Trunk.\nLe Roy later put his own show into storage and accepted a contract from Horace Goldin to front one of several companies that were touring with Goldin's show, featuring the then sensational Sawing a woman in half illusion."
    },
    {
        "name": "Simon Lovell",
        "description": "Simon Lovell (born 1957 in Manchester) is an English comedy magician, card shark actor, and con man. His trademark pieces are finding an audience member's card in his mouth and a humorous straitjacket escape. Lovell appeared on VH1's popular reality show Celebracadabra, on which he and other magicians trained celebrities to perform magic for audiences.\nThe author of sixteen books, including Billion Dollar Bunco, which covers cons and scams, Lovell starred in a one-man off-Broadway show called Strange and Unusual Hobbies. It ran for over eight years at the SoHo Playhouse in NYC, and the Wall Street Journal complimented it by saying, \"A dazzling 70-minute show.\" The well-reviewed show combined Lovell's off-the-wall sense of humor with demonstrations of his uncanny card cheating and \"jaw-dropping\" magic.\nFormerly residing in New York City, Simon was a regularly featured performer \"Monday Night Magic\", the oldest running off-Broadway show featuring an evening of magicians and related performers.\nHe was the consultant con man as of season 2 for Matt Bommer in the show White Collar."
    },
    {
        "name": "Tina Lenert",
        "description": "Tina Lenert (born June 6, 1948) is an American magician, mime and harpist. She has performed worldwide and is known for combining elements of pantomime and magic. For many years she has been a regular performer at the world-famous Magic Castle in Hollywood, where she has been voted Stage Magician of the Year by the Academy of Magical Arts."
    },
    {
        "name": "Tom London (Magician)",
        "description": ""
    },
    {
        "name": "Bill Malone (magician)",
        "description": "Bill Malone is an American entertainer\/magician\/actor who specializes in card magic, close-up magic and corporate events.\nMalone was raised in Chicago, Illinois and became interested in magic at the age of 17. He is a recipient of the Merlin Award from the International Magicians Society. He appeared on many network specials including, the first World's Greatest Magic Special, World's Wildest Magic Special, as well as Champions of Magic Special.\nMalone moved to Fort Lauderdale, Florida where he owned and operated a comedy magic club called Houdini's Pub. He was partners with Wayne Huizenga at the Boca Raton Resort where they created Malone's Magic Bar.\nMalone is best known for his hilarious and amazing presentations for several Fortune 500 companies.\n\n"
    },
    {
        "name": "Ed Marlo",
        "description": "Ed Marlo (born Edward Malkowski in Chicago, Illinois, October 10, 1913 – November 7, 1991) was a prestidigitator who specialized in card magic. He referred to himself and others of his specialty as \"cardicians\"."
    },
    {
        "name": "Gérard Majax",
        "description": "Gérard Faier, known as Gérard Majax (April 28, 1943) is one of the most famous French illusionists.\nHe has appeared in many television programs, magic demonstrations, and movies.\nFrom 1987 until 2002 he, along with Jacques Théodor and Henri Broch of the Laboratoire de Zététique at the University of Nice Sophia-Antipolis, oversaw the International Zetetic Challenge.\nDuring the 1990s, on a late night television show by Thierry Ardisson Majax gave a demo of the \"rotating table\" supernatural phenomenon: a group of \"randomly\" selected people from the audience stood around a round table, put their hands on it, and the table went up and started rotating. Observation of a video recording made of this event showed that some participants had metal hacks hidden in the sleeves of their jackets. When the participants put the hands on the table, the hacks \"pinched\" the table underneath, allowing it to be lifted.\nIn 2000, he created a new theme park attraction called The Hallucinoscope"
    },
    {
        "name": "Jasper Maskelyne",
        "description": "Jasper Maskelyne (1902–1973) was a British stage magician in the 1930s and 1940s. He was one of an established family of stage magicians, the son of Nevil Maskelyne and a grandson of John Nevil Maskelyne. He is most remembered, however, for his entertaining accounts of his work for British military intelligence during the Second World War, in which he claims that he created large-scale ruses, deception, and camouflage."
    },
    {
        "name": "Jay Marshall (magician)",
        "description": "Jay Marshall (James Ward Marshall) (August 29, 1919 – May 10, 2005) was an American magician and ventriloquist.\n\n"
    },
    {
        "name": "John MacGregor, Baron MacGregor of Pulham Market",
        "description": "John Roddick Russell MacGregor, Baron MacGregor of Pulham Market, OBE PC FKC (born 14 February 1937), is a politician in the United Kingdom. He was educated at Merchiston Castle School, then at the University of St Andrews (MA economics and history, 1959) and at King's College London (LLB, 1962). Prior to the 1979 general election he worked for Hill Samuel, a merchant bank.\nMacGregor is also an accomplished magician and member of The Magic Circle. He gave regular performances on British television, including guest spots on The Best of Magic and an annual children's charity programme on Anglia Television.\nHe was appointed an Officer of the Order of the British Empire (OBE) in the 1971 New Year Honours for political services.\nHe was Conservative MP for South Norfolk, but stepped down at the 2001 election."
    },
    {
        "name": "John Nevil Maskelyne",
        "description": "John Nevil Maskelyne (22 December 1839 – 18 May 1917) was an English stage magician and inventor of the pay toilet, along with many other Victorian-era devices. Working with magicians George Alfred Cooke and David Devant, many of his illusions are still performed today. His book Sharps and Flats: A Complete Revelation of the Secrets of Cheating at Games of Chance and Skill is considered a classic overview of card sharp practices, and in 1914 he founded the Occult Committee, a group whose remit was to \"investigate claims to supernatural power and to expose fraud\"."
    },
    {
        "name": "K Lal",
        "description": "Kantilal Girdharilal Vora (14 January 1924 – 23 September 2012), popularly known as K Lal, also known as Bhaumik Gupta was an Indian magician. In a career spanning 62 years, he staged over 22,000 shows around the world, performing his last show in July 2012.He and his son(K.Lal Junior) performed together for 32 years.In 1968 I.B.M (U.S.A) gave him the title of World's fastest Magician.He is very famous for his unbelievable items like Head Separated From Body(Talking & Moving),'A Giant Killer Saw','The Flying Lady','Evil Joker'. Paul Daniel,Great magician of U.K. says about K.Lal \"He does a stunning illusion show of pure magic.\" Russian magician Kieo says about K.Lal's show \"I have never seen such a giant magnificent show.\" In 2004 he created a world record of staging 20,600 magic shows. He died at his home in Ahmedabad in September 2012 at the age of 88."
    },
    {
        "name": "Leon Mandrake",
        "description": "Leon Giglio (April 11, 1911 – January 27, 1993), better known by his stage name Leon Mandrake, was an Italian-American magician, mentalist, illusionist, escapologist, ventriloquist and stunt performer known worldwide as Mandrake the Magician, albeit simultaneously and unrelatedly to the comic strip character Mandrake the Magician."
    },
    {
        "name": "Luis de Matos",
        "description": "To the same page name with diacritics: This is a redirect from a page name that does not have diacritical marks (accents, umlauts, etc.) to essentially the same page name with diacritical marks or a \"List of...\" page anchored to a promising list item name with diacritics.\nThis redirect aids in searches and may be applied (without piping) when the subject page concerns language translation or foreign language equivalents. Other pages that use this redirect should be updated with a direct link to the redirect target (again, without piping)."
    },
    {
        "name": "Magic Babe Ning",
        "description": "Ning Cai, better known as ‘Magic Babe’ Ning, is a Singaporean magician and entrepreneur. She has been recognised by Channel News Asia as \"South East Asia's First Professional Female Magician\".\nShe is best known for her good looks and the glamour she brings to magic in Asia and her entrepreneurial spirit. She was named \"the sexiest woman in magic\" by MagicSeen (UK's largest magic magazine) which was subsequently used to describe her by many media publications in Singapore. She has graced the cover of numerous local magazines.\nNing, along with partner J C Sum, have been credited for popularising magic in Singapore by the local media and magic organisations.\nNing signed on as a FLY Entertainment artiste in March 2012 and was the one of the honorees of the Singapore Women's Weekly Great Women of our Time 2012 \nIn October 2014, Ning announced her retirement from performing magic. She plans to teach yoga, and released her memoir Who Is Magic Babe Ning? in November. She married her Singaporean partner, who works in the arts, in December."
    },
    {
        "name": "Magic Christian (magician)",
        "description": "Magic Christian is the stage name of Christian Stelzel, a professional Austrian magician and author. Christian was born on July 17, 1945, and presently lives in Vienna.\nHe studied industrial design at the University of Applied Arts Vienna. Christian has received many awards, starting with winning first prize at a competition in Weymouth, 1967, and several awards from all over the continent followed. In 1973 he won the first prize in the category of Manipulation at FISM, the world championships in magic. An accomplishment he repeated at FISM 1976 and FISM 1979 (the later time, also winning the category of Invention).\nIn 1989, Christian became president of the Magic Club of Vienna, and in 2005 the Academy of Magical Art at The Magic Castle, Hollywood, awarded him the \"Performing Fellowship\" for his performances.\nMagic Christian has developed books of magic and magic sets for Piatnik, Austria's renowned playing card, board game and puzzle manufacturer.\nIn later years, Magic Christian has received acclaim for his thorough historic research on the legendary Johann Nepomuk Hofzinser.\n\n"
    },
    {
        "name": "Mahdi Moudini",
        "description": "Mahdi Moudini (born Mahdi moammer; March 14, 1979) is an Iranian illusionist best known for his stage and close-up magic around the world. He has been described as the most commercially demanded magician in Malaysia. Two of his latest wonder shows were the series of Magical Moudini  and levitation along the famous Kuala Lumpur Tower. Moudini currently is the International Magicians Society (IMS) ambassador to Malaysia."
    },
    {
        "name": "Matt Marcy",
        "description": "Matt Marcy (b. 1976, Los Angeles, California) is an American comedian-magician known for his original, comedy illusions. In 1997 Matt was named by the Academy of Magical Arts (The Magic Castle) as its top ranking young magician when he was just 20 years of age. He was also a Master of Ceremonies at Wizardz Dinner Theater at Universal Studios Hollywood. He is now primarily a corporate entertainer, and has performed for a variety of celebrities and dignitaries, including Prince Faisel of Saudi Arabia. He was also an opening act for The Amazing Johnathan at the Sahara Hotel and Casino and the Golden Nugget in Las Vegas, and recently appeared on the A&E TV show Magic Castle After Dark.\nMarcy wrote and consulted for Walt Disney Imagineering in the Theme Park Productions department, including for the Thea award-winning CinéMagique at Walt Disney Studios Park in Disneyland Resort Paris. He has also written for Magic Magazine.\nIn 2006, Marcy released his own instructional DVD, Simple Tricks...To Blow Their Minds!\nHe has a Political Science degree from Brown University."
    },
    {
        "name": "Max Malini",
        "description": "Max Malini (born Max Katz Breit, 1873 – died October 3, 1942) was a Jewish illusionist who at his peak performed for several US Presidents, had command performances at Buckingham Palace, and received gifts from monarchs across Europe and Asia. Magicians are said to revere him for his skill and bold accomplishments."
    },
    {
        "name": "Nevil Maskelyne (magician)",
        "description": "Nevil Maskelyne (1863–1924) was a British magician and inventor."
    },
    {
        "name": "Peter Marvey",
        "description": "Peter Marvey is a magician and illusionist best known for his combination of sleight of hand and large-scale stage illusions."
    },
    {
        "name": "Stuart Macleod (magician)",
        "description": ""
    },
    {
        "name": "Tony Andruzzi",
        "description": "Tony Andruzzi (born May 22, 1925 in Cheyenne, Wyoming – died December 22, 1991 in Chicago, Illinois) was the name adopted by professional magician Tom S. Palmer from the age of 45 to the end of his life."
    },
    {
        "name": "William Marriott (magician)",
        "description": "William S. Marriott (ca. 1910) also known as Dr. Wilmar was a British magician who became well known for exposing fraudulent spiritualist mediums."
    },
    {
        "name": "Andrew Mayne",
        "description": "Andrew Mayne (born Andrew Harter) is a magician, illusion designer and filmmaker. Having written and produced over fifty books, DVDs, and manuscripts on magic, he is considered one of the most prolific magic creators of the last decade. He's the publisher of iTricks.com and host of the Weird Things podcast, one of the top 25 Natural Science podcasts on iTunes. Known for his off-beat magic that mixes science and mystery, his illusions include shrinking his body to two-feet tall and drinking liquid nitrogen."
    },
    {
        "name": "Andy Nyman",
        "description": "Andy Nyman (born 13 April 1966) is an English actor and magician.\n\n"
    },
    {
        "name": "Billy McComb",
        "description": "Billy McComb (April 12, 1922 — April 30, 2006) was a British-born American magician and comedian. He was one of the United Kingdom's leading magicians in the 1950s and 1960s. He was hired to perform at the International Of Magicians in 1962 and stayed at Jim Swogers house, in Pittsburgh, along with his wife and son for six months before taking up residence in Los Angeles, California in the 1970s. He joined The Magic Castle in Hollywood, his number being 3323."
    },
    {
        "name": "Chris Nicholson (magician)",
        "description": "Chris Nicholson is an award winning close up magician who starred in the popular teenage magic show, Playing Tricks."
    },
    {
        "name": "David Minkin",
        "description": "David Minkin is an American magician and an International Champion of Close-Up Magic. He was a cast member on the MTV series Room 401 produced by Ashton Kutcher, and a co-star of the television show \"Magic Outlaws\" on the Travel Channel with fellow magicians Chris Korn and Ben Seidman. Among Minkin's other television appearances was a segment that aired on American Idol, which was filmed in Los Angeles with the show's contestants visiting the Magic Castle."
    },
    {
        "name": "David Nixon (magician)",
        "description": "David Nixon (29 December 1919 – 1 December 1978) was an English magician and television personality. At the height of his career, Nixon was the best-known magician in the UK."
    },
    {
        "name": "Doug McKenzie (magician)",
        "description": "Doug McKenzie (born June 19, 1980 in Stirling, Scotland) is a magician, magic consultant, and magic television producer based in New York City. His style of magic often merges classical sleight of hand techniques with new technologies. He specializes in both close-up magic and pickpocketing."
    },
    {
        "name": "Drummond Money-Coutts",
        "description": "For the poet & librettist see Francis Money-Coutts, 5th Baron Latymer\n\nDrummond William Thomas Money-Coutts (born 11 May 1986), also nicknamed \"DMC\", is an English magician and specialist card sharp. Money-Coutts is the heir apparent to the Latymer Barony. He is currently in a programme on National Geographic Channel with several magic tricks and deception, aired to over 175 countries, named \"Beyond Magic with DMC\"."
    },
    {
        "name": "Georges Méliès",
        "description": "Marie-Georges-Jean Méliès, known as Georges Méliès (\/meɪˈljɛs\/; French: [meljɛs]; 8 December 1861 – 21 January 1938), was a French illusionist and film director who led many technical and narrative developments in the earliest days of cinema. Méliès was an especially prolific innovator in the use of special effects, popularizing such techniques as substitution splices, multiple exposures, time-lapse photography, dissolves, and hand-painted color. He was also the first filmmaker to use storyboards. His films include A Trip to the Moon (1902) and The Impossible Voyage (1904), both involving strange, surreal journeys somewhat in the style of Jules Verne, and are considered among the most important early science fiction films, though their approach is closer to fantasy."
    },
    {
        "name": "Gopinath Muthukad",
        "description": "Gopinath Muthukad is a magician, escapologist, life coach, and motivational speaker from Kerala, India. He employs magic as a medium to convey his messages to public. He founded the first magic academy of Asia at Thiruvananthapuram. He won the Kerala Sangeetha Nataka Academy award in 1995. He is also a winner of the International Merlin Award instituted by the International Magicians' Society."
    },
    {
        "name": "Jeff McBride",
        "description": "Jeff McBride (also known as Magnus; born September 11, 1959) is an American magician from Monticello, New York. He is known for his sleight of hand skills and specializes in the manipulation of playing cards, coins, and other small objects. His stage performances blend elements of kabuki, a Japanese theater form, with traditional conjuring. In addition, he is noted for his contributions to Bizarre magic."
    },
    {
        "name": "John Milner (magician)",
        "description": "John David Milner (born 1948 in Stourbridge, Worcestershire) is an English magician, stage and TV performer. He learnt magic from the performer and mentor to many well-known magicians, Ken Brooke. In 1963, he was a finalist in The Magic Circle's Young Magician of the Year competition. He became a full member of the Magic Circle in 1968 and became a member of British Actors' Equity Association in the same year. Two years later, Milner again was a finalist in the Magic Circle's Young Magician of the Year competition. He became a member of the Inner Magic Circle with a Gold Star in 2000."
    },
    {
        "name": "John Mulholland (magician)",
        "description": "John Mulholland (9 June 1898 in Chicago, Illinois – 25 February 1970 in New York City) was an American magician, author, publisher and intelligence agent."
    },
    {
        "name": "Lisa Menna",
        "description": "Lisa Menna (born July 24, 1967) is a professional magician and philanthropist adventurer. A pioneer in a typically male-dominated profession, she is considered \"The most influential female magician of the 20th century\". \nDue to her original contributions to the art of magic, she became the first woman to be invited to lecture and perform at FISM. She is also the only woman to have performed in every theater of The World Famous Magic Castle in Hollywood.\nIn the 1990s, she achieved notability and worldwide success performing as a trade show magician, known as \"the Darling of Dot Com\".\nIn 2011, Menna founded the non-profit organization \"Cause to Wonder\". It is a theater for social change organization that has produced dozens of events."
    },
    {
        "name": "Matt the Knife",
        "description": "Not to be confused with Matt the Knife the WFTDA referee from Rainy City Roller Girls.\n\"Matt the Knife\" (also called MTK; born 1987) was born in Massachusetts and grew up in Boston, but now resides in Rhode Island. He is a magician and mentalist and has broken a number of Guinness World Records, but began his career as a professional con man."
    },
    {
        "name": "Max Maven",
        "description": "Max Maven (born Philip Goldstein 21 December 1950 in Ithaca, New York) is an American magician and mentalist. He often appears on television magic shows to perform \"interactive\" mind reading tricks that work for the television audience.\nWhile his public persona and performances fall squarely within the genre of mentalism, Maven's contributions to the magic community span far wider. He is respected within the industry for being a prolific author and innovating many of the magical and mentalist effects that are used by other magicians. He has been a magic consultant for such performers as David Copperfield, Penn & Teller, Siegfried & Roy, and Doug Henning, and he is a frequent contributor to industry journals such as Genii, The Linking Ring, and M-U-M. He has also been the featured magician at the annual conventions of both the Society of American Magicians and the International Brotherhood of Magicians.\nHe hosted a 12-part series for HTV (Harlech Television) in Britain, \"Something Strange with Max Maven\", a talk-show exploring all aspects of the paranormal. The show set a ratings record, and led to a second series the following year. He also starred as the title role in FOX's 1992 Halloween special Count DeClues' Mystery Castle. It was shot at The Magic Castle.\nMaven occasionally plays a magician character (often as himself) on various television series, such as, \"Magic\", \"The Art of Magic\", \"Something Strange with Max Maven\", \"Fresh Prince of Bel Air\", and \"The MAXimum Dimension\".\nHis father, Jack Goldstein, was a professor of Astrophysics and dean of faculty at Brandeis University. The finance blogger Emma Needleman is his cousin.\nHaving performed often in Japan, he is \"quite functional\" in Japanese, although by his own admission his literacy in the language isn't as proficient.\nMaven also appears as a part of the traveling science exhibit \"Magic: The Science of Illusion\" in the \"Magic of the Mind Illusion,\" which has toured in science museums such as Los Angeles and Boston. His name has been changed legally to Max Maven but he still uses \"Phil Goldstein\" as a pen name for technical writings.\nIn 2007, he won The Magic Woods Award for Best Teaching Video for his mentalism DVD \"Nothing\". He has appeared on the cover of numerous magic-related journals and periodicals.\nRecently he has started his own show on Israel's Channel 2, licensed version of Penn & Teller: Fool Us called Mi Yapil Et Ha Master (\"Who Can Fool The Master?).\nMaven is well respected amongst magicians for his breadth of knowledge of magic history and the origins various tricks and methods. He has stated in interviews that he believes it is vital to preserve the history of the art and provide credit to the originators of ideas."
    },
    {
        "name": "Morgan The Escapist",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Oscar Munoz (magician)",
        "description": "Oscar Munoz is an American magician, 1999 winner of the \"Gold Cups\" award from the International Brotherhood of Magicians organization. He is also a charter member and past head of \"Ring 269\" in Texas."
    },
    {
        "name": "Stephen Mulhern",
        "description": "Stephen Daniel Mulhern (born 4 April 1977 in Stratford, London) is an English presenter, entertainer, and former magician, best known for presenting television programmes for ITV.\nMulhern has presented the ITV2 spin-off series Britain's Got More Talent since 2007 and has more recently presented ITV game shows including Catchphrase (2013–present) and Big Star's Little Star (2013–present). He also co-hosts the Sunday breakfast programme on Heart Radio, alongside Emma Willis."
    },
    {
        "name": "Tom Mullica",
        "description": "Thomas Blaine Mullica (August 19, 1948 – February 18, 2016), was an American comedy magician and impressionist who performed on television specials, and appeared on TV many times including Late Night with David Letterman, The World's Greatest Magic, Viva Variety and Penn & Teller's Sin City.\nOne of Mullica's most memorable appearances was on Late Night with David Letterman, on which he performed his popular signature effect of the manipulation and vanishing of several lit cigarettes in his mouth.\nIn 1984 Mullica was awarded $5,000 cash for winning the Siegfried & Roy Golden Lion Award at the Magic Desert Seminar in Las Vegas.\nHe also performed at the Just for Laughs Comedy Festival and toured the US and Canada with RED – A Performance Tribute, a Red Skelton Tribute show which Mullica wrote and starred in as Skelton and his characters. RED is the only Skelton tribute show authorized by the Skelton Estate.\nIn July 2013 Mullica helped dedicate the Red Skelton Museum & Education Center."
    },
    {
        "name": "Alex Patterson",
        "description": ""
    },
    {
        "name": "Danny Orleans",
        "description": "Danny Orleans (born October 21, 1954) is an American magician, one of the top trade-show performers, corporate entertainers, and magical educators in the country.\nAs a corporate and trade-show performer, he has presented hundreds of magic shows for business settings over the past 20 years. He travels over 75,000 miles annually, performing at trade shows that have included the TDWI World Conference, Networld+Interop and the Embedded Systems Conference. His list of clients includes Hewlett-Packard, American Express, Aon Corporation, ExxonMobil, and Western Union.\nOrleans' path as a magician educator began when he earned his degree in Education from Northwestern University. Orleans went on to teach both Algebra and preschool at Chicago area public and private schools. From 1980 to 2000 he toured North America performing magic in thousands of schools, theaters and children's museums (including the Riverside Theatre in Vero Beach, Florida).\nOrleans has written, appeared in, or contributed to numerous instructional texts on magic, including a series of ten books and magic sets with DVDs for New York publisher, Scholastic Corporation. In 2010, Chronicle Books published an interactive magic book he created called Magic Scratchers. It is the first magic book using scratch-off technology to create the illusion that it can read the mind of the reader. He has also written on magic subjects for magicians' trade publications, Genii (magazine) and Magic (magazine).\nIn 2013, Mr. Orleans released a set of DVDs for the magic community entitled, The Art of Presenting Magic to Children. The success of this release gave him instant notoriety as an expert on the performance of magic to young people. He and his wife Jan Rose are now lecturing worldwide to magicians, educating them on the use of audience management skills and child psychology in order to make their youth performances more successful."
    },
    {
        "name": "Darwin Ortiz",
        "description": "Darwin Ortiz (born 1948) is a magician, who is an authority on gambling and card manipulation.\nOrtiz was born and raised in New York City, where he had a keen interest in card tricks since childhood. In 1974, he dropped out of NYU Law School and pursued card magic full-time. During that time, he initially supported himself playing blackjack (using card counting techniques) and as an instructor at Harry Lorayne's memory school in New York City. Ortiz is a contemporary and close friend of the influential US coin magician, David Roth, and was initially mentored by the seminal British\/US close-up performer, Derek Dingle.\nOrtiz later became a consultant to a number of casinos in the United States, Europe, Africa, UK and Australasia, and was a regular featured presenter for a succession of years at the World Gaming Congress in Nevada.\nOrtiz is the author of books on gambling and magic. The most recent book on his original routines was Scams and Fantasies With Playing Cards. His book Strong Magic focuses on practical presentational techniques for close-up magicians. The book has been broadly embraced by the professional and amateur magic community but initially met with negative reviews from the two major US trade publications MAGIC and Genii. Demand for the book has been high, despite the initial inability of the original publisher to reprint the text. Ownership of the copyright has recently returned to the author (along with two other books Darwin Ortiz At The Card Table and Cardshark) and the books are once again being made available to the trade.\nOrtiz's latest book, Designing Miracles is an exposition on the design of powerful magical effects, and is subtitled Creating the Illusion of Impossibility. The book posits and analyzes various theories regarding the perception and cognition of lay audiences and provides practical examples and advice on the construction of effects, aimed at maximizing their impact and deceptiveness to a lay audience.\nOrtiz's major work for the lay public on gaming protection is Gambling Scams 1984. He also authored an influential annotation of S. W. Erdnase's The Expert at the Card Table titled The Annotated Erdnase in 1991 which was published to the magic trade.\nOrtiz currently resides in Washington, D.C."
    },
    {
        "name": "David Oliver (magician)",
        "description": "David Oliver is an American born magician.\nOliver is known for his neoclassic style of performing stage magic with Doves (Not since Oct 2008 - see below), the Floating Ball and Linking Rings, as well as his comedy and close-up magic. He also serves as adult director of the Society of Young Magicians #29, a youth non-profit. Oliver serves as a mentor to many youth performers and magicians, primarily in the New England & New York areas. He performs regularly at \"The Mystery Lounge\" in Cambridge, Massachusetts and \"Monday Night Magic\" in New York City. He is a regular contributor to the magicians' trade publication, Genii, where he reviews magic tricks and effects.\nIn October 2008, David Oliver underwent exploratory lung surgery, for a potentially fatal lung affliction called hypersensitivity pneumonitis or Bird Fancier's Lung, caused by working and living with the birds in his show. Subsequently, the doves were removed from his show, after being a feature in his act for more than 25 years. The August 2011 issue of Genii detailed his ordeal with the birds (\"Death Defying Dove Acts\"), complete with a list of symptoms and how to avoid the same situation.\nIn June 2013, after years of declining health due to Bird Fancier's Lung, Oliver had both of his lungs replaced during a grueling 16-hour double lung transplant surgery at Massachusetts General Hospital in Boston, MA. Months of recuperation and recovery followed.\nMAGIC Magazine featured David Oliver as its January 2014 cover story (\"DAVID OLIVER: Celebrating Life!\" ), following his difficult journey through the arduous double lung transplant and his subsequent recovery and his second chance at life. The article chronicles the details of his months in Massachusetts General Hospital, as well as the history of his life in magic as a performer, director, writer and mentor.\nOliver has returned to performing full-time, and is now a motivational speaker sharing his unique story at medical conferences, magician conventions, colleges and corporate events.\nHe still lives just outside Boston, Massachusetts."
    },
    {
        "name": "David Penn (magician)",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Eusapia Palladino",
        "description": "Eusapia Palladino (alternate spelling: Paladino; 21 January 1854 – 16 May 1918) was an Italian Spiritualist physical medium. She claimed to possess extraordinary powers such as levitating tables and communicating with the dead through her spirit guide John King, and other related supernatural phenomena. She convinced many of her powers, but was caught in deceptive trickery throughout her career.\nMagicians and skeptics who evaluated her claims concluded that none of her phenomena was genuine and she was a clever trickster.\nHer Warsaw séances at the turn of 1893–94 inspired several colorful scenes in the historical novel Pharaoh, which Bolesław Prus began writing in 1894.\n\n"
    },
    {
        "name": "Great Ovette",
        "description": "Great Ovette (January 20, 1885 – August 5, 1946) also known as Joseph Ovette was an Italian American author and professional magician.\nOvette was born as Giuseppe Olivo, in Naples, Italy. He also performed under the name Lung Chan Yuen and was well known for his hanging illusion act that was advertised as \"The Man They Couldn't Hang\". He wrote books on magic and contributed to numerous magic magazines.\nOvette performed the \"blindfold drive\", this consisted of him driving a car blindfolded through the streets of Ottawa.\nHe died in Buffalo, New York from a throat infection. He was buried in Ontario, Canada."
    },
    {
        "name": "Johnny Ace Palmer",
        "description": "Johnny Ace Palmer is an award-winning American close-up magician. He is famous within the worldwide magical community for his prodigious sleight-of-hand abilities."
    },
    {
        "name": "Okito",
        "description": ""
    },
    {
        "name": "Pat Page (magician)",
        "description": "Patrick \"Pat\" Page (17 March 1929 – 11 February 2010) was a stage magician born in Dundee, Scotland. He became a professional magician at the age of 26 and worked at Davenport's magic shop for fifteen years. In 1950, he married Margaret Manzie, who died in 2003. Pat was the youngest of six siblings. He left behind his daughter Janette, son Jeremy and Grandson Robert.\nHe appeared on The Paul Daniels Magic Show and was an uncredited consultant to the film Casino Royale. He worked as an advisor to Derren Brown. He appeared in, or advised films and television shows: the 2007 film Magicians, Agatha Cristie Poirot:The Disappearance of Mr. Davenheim (1990), Heroes of Magic (2000), Tales of the Unexpected: Season 5, Episode 5 Stranger in Town (23 May 1982), Derren Brown Presents the 3D Magic Spectacular (2009).\nOn his death Jack Delvin, president of The Magic Circle described him as the \"magician's magician\". Magician Wayne Dobson described him as a \"great friend, mentor and magical adviser\". Other magicians affirm Page's skills and legacy.\nPat Page is known for his work on numerous magic tricks, including the Topit Easy Money, The Miser's Dream and The Kitson Miracle.\nIn addition to inventing magic tricks, he published books and DVDS and advised professional magicians. Many of his routines are used by professional magicians including Doug Henning, Fred Kaps and Raphael Benatar. He wrote various books, including The Big Book of Magic and published articles in the magician's magazine Pabular."
    },
    {
        "name": "Pendragons",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name.\nFrom a short name: This is a redirect from a title that is a shortened form of a person's full name, a book title or other more complete article title.\nUse this rcat (not {{R from initialism}}) to tag redirects that are the initials of a person's name.\n\nFrom an unprintworthy page title: This is a redirect from a title that would not be helpful in a printed or CD\/DVD version of Wikipedia."
    },
    {
        "name": "Penn",
        "description": "Penn may refer to:"
    },
    {
        "name": "Richard Osterlind",
        "description": "Richard Osterlind (born March 6, 1948) is a mentalist who has been performing for major corporations for more than 35 years. He has appeared at the Sheraton Great Wall in Beijing, the Hotel De Paris in Monte Carlo, the Casa De Campo in the Dominican Republic and many other luxury resorts around the world. He is a speaker, author, teacher of magic and mentalism and creator of many magic effects."
    },
    {
        "name": "Shoot Ogawa",
        "description": "Shoot Ogawa (born 1975) is a magician from Tokyo, Japan who has been interested in magic from the age of 10. Ogawa has been featured on television in Japan and is a corporate entertainer.\nSome of his most renowned tricks include the Ninja Rings and the Muscle Pass which he introduced to American magicians and helped make famous. In Feb 2008, he introduced his \"Laws of Attraction\" illusion to the Blackpool Magic Convention to an exclusive audience of professional magicians.\nOgawa was named the 2008 Parlour Magician of the Year by Media:Hollywood Magic Castle's Academy of Magical Arts. Previously, he was awarded Closeup Magician of the Year in 2003 and 2006, which is even more remarkable considering 2003 was his first year in America, and Ogawa spoke very little English. Ogawa also won 1st place at the close-up competition in the MacMillan International Convention in 2002.\nHe has been featured on the cover of the Magic Magazine March 2003 issue. He has also appeared on \"After Dark At The Magic Castle.\""
    },
    {
        "name": "Vazhakkunnam",
        "description": "Vazhakunnam Neelakanthan Namboothiri or Prof. Vazhakkunnam(February 8, 1903 – February 9, 1983) is known as the Grand Father of Kerala's Magic. He gave a new meaning to magic in Kerala. He is praised as the patriarch of magic in the State. He played an important role in bringing Magic as an Art. For more than half a century, he had kept the onlookers spellbound in spite of his extreme simplicity and being devoid of any elaborate stage and costume. `Prof. Vazhakkunnam, born in an orthodox Namboodiri `illam' at Thiruvegappura, near Pattambi, is considered to be the `guru' of magic by contemporary magicians like Gopinath Muthukad."
    },
    {
        "name": "İlkay Özdemir",
        "description": "İlkay Özdemir (born 1981) is a Turkish female stage magician.\n\n"
    },
    {
        "name": "Brian Role",
        "description": "To the same page name with diacritics: This is a redirect from a page name that does not have diacritical marks (accents, umlauts, etc.) to essentially the same page name with diacritical marks or a \"List of...\" page anchored to a promising list item name with diacritics.\nThis redirect aids in searches and may be applied (without piping) when the subject page concerns language translation or foreign language equivalents. Other pages that use this redirect should be updated with a direct link to the redirect target (again, without piping)."
    },
    {
        "name": "Channing Pollock (magician)",
        "description": "Channing Pollock (August 16, 1926 – March 18, 2006) was an American magician and film actor."
    },
    {
        "name": "Charles Reynolds (magician)",
        "description": "Charles Raymond Reynolds (September 9, 1932 – November 4, 2010) was a behind-the-scenes magician involved with virtually every elements of magic production—inventing illusions, producing and direction magic acts, helping performers perfect their acts, and writing on the subject.\nReynolds was born in Toledo, Ohio, and as a child, he saw Harry Blackstone, Sr. perform. Reynolds was immediately drawn to magic, starting with a Gilbert Mysto Kit.\nHe majored in theater at the University of Michigan, and earned his master's degree there too. He undertook a number of jobs in media and journalism. He met Doug Henning while writing an article on magic, and Henning hired him as a consultant. He was chief magic consultant for Henning's popular network TV magic shows, which ran from 1975 for nearly a decade. He did other work with Henning, including Merlin.\nHe also worked frequently with Harry Blackstone, Jr., the son of his childhood hero. He designed numerous illusions for Blackstone, Jr., including assisting him in cutting his wife in half with a buzz saw for the Broadway production of Blackstone!, and creating a new levitation illusion for a live show in Las Vegas.\nHe invented two different ways to make an elephant vanish, and made a horse and rider disappear.\nHe produced and directed productions all over the world and in various media—live, film, and television, wrote and co-wrote extensively on magic, collected notable magic memorabilia, and lectured at the Smithsonian.\nHe died of liver cancer at the age of 78 at his (Greenwich Village, New York County, New York, United States) home. He was survived by his wife Regina."
    },
    {
        "name": "Chung Ling Soo",
        "description": "Chung Ling Soo was the stage name of the American magician William Ellsworth Robinson (April 2, 1861 – March 24, 1918), who is mostly remembered today for his death after a bullet catch trick went wrong."
    },
    {
        "name": "Dale Salwak",
        "description": "Dale Salwak is a professional magician from California who has performed internationally. He is a regular performer at The Magic Castle and is known as the \"The Gentleman of Magic\". He has been the long-time director and owner of the Chavez School of Magic and has been featured in cover stories on numerous magic-related publications. He has also taught English literature at Citrus College in Glendora, California since 1973 and has also written 24 books."
    },
    {
        "name": "David Roth",
        "description": "David Roth (born 1952, New York City) is an American magician widely regarded as one of the world's greatest living coin magicians. Roth was an important contributor to Richard Kaufman's Coinmagic an influential text on contemporary coin technique; his major work was chronicled in David Roth's Expert Coin Magic, a book co-written with Richard Kaufman. Roth is now associated with Fantasma magic, a magic manufacturing and retail company in New York City.\nThe sleight of hand artist Dai Vernon, wrote about Roth:\n\"First let me state that David Roth has an amazing ability when performing with coins. He is truly a genius. I have been fortunate to have enjoyed the confidence and friendship of the leading exponents of coin manipulation of the past. T. Nelson Downs, Allan Shaw, Manuel and Welch Miller all specialized in this branch of the magical art. To the very best of my judgment, David’s ideas and execution far surpass any one of them. I feel quite certain that if they could witness his performance they would not only be astounded but realize that they had seen the master.\""
    },
    {
        "name": "Fay Presto",
        "description": "Fay Presto (the stage name of Letitia Winter born Oliver Winter  17 May 1948) who is known as a magician and a member of The Inner Magic Circle. In 2001, Fay Presto played herself in ITV's Emmerdale. In 1998 she was voted ‘Party Entertainer of the Year’ by Tatler Magazine. Other television credits includes Heroes of Magic (Channel 4), Paul Daniel's Secrets (BBC1), The Late Late Show for RTÉ, Dinner Dates (ITV), The Car's the Star, Trick on 2 (BBC2) and Wogan (BBC1). Fay was also the sole subject of a BBC2 40 Minutes documentary, \"Illusions of Grandeur\", about her life. Channel 4 voted her \"Bottle Thru Table\" trick the 37th Greatest Magic Trick of All Time.\nFay was part of an early movement in the UK magic scene. Creating a brand new genre of Close-up magic, taking her special brand of magic to the restaurants of London.\nIn 2012 Presto won the title of The Magic Circle Close-up Magician of the Year 2012.\nSince 2014 Fay now is part of the UK touring show Champions of Magic, alongside fellow magicians Edward Hilsum, Alex Mclear and Young & Strange. She can still be seen live at her London residency Langan's Brasserie every Thursday night and has been there since the very start of her magic career.\nFay still remains a powerful voice in the gender equality world, donating large amounts of her time to support the rights of women and the LGBT community as well as extensive work for action for children."
    },
    {
        "name": "Ian Saville",
        "description": "Ian Saville (born 30 April 1953) is an English magician whose act incorporates ventriloquism and comedy. His performance is distinctive primarily for the fact that it is geared towards a comic form of socialist propaganda. He says of his act, \"whereas David Copperfield is content with little tricks like making the Statue of Liberty disappear, I aim at the much more ambitious goal of making International Capitalism and exploitation disappear\" although he has not yet succeeded.\nHe was born in the East End of London, England to Jewish parents. He began conjuring at the age of 11. He reached the semi-finals of the Butlins national talent contest. Becoming interested in theatre, he studied Drama at Exeter University. He toured with the political theatre group Broadside, as well as working in community theatre.\nIn 1979 he started developing his \"socialist magic\" act. He cites Bertolt Brecht as a major influence, and one of his shows features a ventriloquists' dummy of Brecht. He has collaborated with left-wing folk singer Leon Rosselson in two shows.\nTwo of his standard \"tricks\" are \"The Class Struggle Rope Trick\" and \"The vanish of the military-industrial complex\".\nIn 1990 he received a PhD from City University, London for his thesis on political theatre in Britain in the 1920s and 1930s. He currently teaches part-time on theatre courses at Middlesex University.\nIn August 2013 he visited the Edinburgh Festival Fringe with a free show about money - the Free Money Magic Show."
    },
    {
        "name": "James Randi",
        "description": "James Randi (born Randall James Hamilton Zwinge; August 7, 1928) is a Canadian-American retired stage magician and scientific skeptic who has extensively challenged paranormal and pseudoscientific claims. Randi is the co-founder of Committee for Skeptical Inquiry (CSI) and the founder of the James Randi Educational Foundation (JREF). He began his career as a magician under the stage name The Amazing Randi and later chose to devote most of his time to investigating paranormal, occult, and supernatural claims, which he collectively calls \"woo-woo\". Randi retired from practicing magic aged 60, and from the JREF aged 87.\nAlthough often referred to as a \"debunker\", Randi has said he dislikes the term's connotations and prefers to describe himself as an \"investigator\". He has written about the paranormal phenomena, skepticism, and the history of magic. He was a frequent guest on The Tonight Show Starring Johnny Carson and was occasionally featured on the television program Penn & Teller: Bullshit!\nPrior to Randi's retirement, JREF sponsored the One Million Dollar Paranormal Challenge, which offered a prize of US$1,000,000 to eligible applicants who could demonstrate evidence of any paranormal, supernatural or occult power or event under test conditions agreed to by both parties. The paranormal challenge was officially terminated by the JREF in 2015. The foundation continues to make grants to non-profit groups that encourage critical thinking and a fact-based world view.\n\n"
    },
    {
        "name": "Jay Sankey",
        "description": "Jay Sankey is a Canadian close-up magician and creator of magic effects. He has been an active stage performer since the mid-1980s. David Copperfield performed Sankey's card in balloon effect \nHe is also known as a stand-up comedian and authored a book about the art of stand-up, Zen and the Art of Stand-Up Comedy in 1999. However, he is best known for the many magical effects which he has published to help magicians develop their craft. His most well known works include his \"Revolutionary Coin Magic\" and \"Revolutionary Card Magic\" DVDs.\nSankey is featured in Spellz, a TVO Kids program that he co-hosts with Bridget Hall, co-produced by David Peck.\nIn 2007 Jay won 3rd place in Edd Withers' The Magic Woods Awards for Best Book: for the book Beyond Secrets. He has authored numerous books on comedy and magic (see below) and has produced\/appeared in numerous instructional videos intended for magicians and other stage performers.\nIn 2009, Sankey announced that Andi Gladwin and Joshua Jay were in the process of writing his complete works in a trilogy of books. In 2012 The Definitive Sankey volumes 1-3 were released in both a regular edition three book and a single DVD format and a deluxe version which has an extra DVD and is signed by Jay.\nJay lives in Toronto with his wife Lisa, and his two children Mason and Madelaine.\nSankey developed effects for Criss Angel for less than a year before leaving the program. Sankey now produces humorous videos of himself in the persona of \"Craigg Angelo.\""
    },
    {
        "name": "Jean Eugène Robert-Houdin",
        "description": "Jean-Eugène Robert-Houdin (December 7, 1805 – June 13, 1871) was a French magician. He is widely considered the father of the modern style of conjuring.\n\n"
    },
    {
        "name": "Jerry Sadowitz",
        "description": "Jerry Sadowitz (born 4 June 1961) is an American-born Scottish stand-up comic and card magician.\nNotorious for his frequently controversial brand of black comedy, Sadowitz describes Bernard Manning as “the good cop” to his bad, and believes that when you go to see a comedian you should suspend your beliefs. He has influenced a generation of comedians, but states that \"politically incorrect comedy is no genre: it’s me, and it’s been ripped off by loads and loads of comics\". In 2007 he was voted the 15th greatest stand-up comic on Channel 4's 100 Greatest Stand-Ups. In the 2010 list, he was voted the 33rd greatest stand-up comic.\nSadowitz is also widely acclaimed as one of the best close-up magicians in the world and an accomplished practitioner of sleight of hand, having written several books on magic and inventing several conjuring innovations.\nIn 2008, Sadowitz published an open letter to reviewers asking them not to quote his material stating that \"a very important element of comedy is surprise, and it can often make the difference between a show that works and one that does not\". He also actively protects his intellectual property, removing clips of himself from YouTube and torrent sites within hours of their appearance."
    },
    {
        "name": "Long Tack Sam",
        "description": "Long Tack Sam, was a world-renowned Chinese-born American magician, acrobat, and vaudeville performer."
    },
    {
        "name": "Melinda Saxe",
        "description": "Melinda Saxe (born March 6, 1965) is a magician from Las Vegas, Nevada, best known for her television performances and Las Vegas stage shows in which she was billed as \"The First Lady of Magic\". She is often associated with the \"Drill of Death\" illusion, which was a signature trick developed for her by André Kole. Although derided by some critics as a stereotypical blonde who achieved success because of her looks, Saxe is also respected by many in the magic business as a highly professional and likeable performer. She's currently on a break and not performing."
    },
    {
        "name": "Peter Reveen",
        "description": "Peter J. Reveen (8 October 1935 – 8 April 2013) was a stage hypnotist and illusionist who performed mainly in Canada, and particularly Atlantic Canada."
    },
    {
        "name": "Richard Potter (magician)",
        "description": "Richard Potter (1783–1835) was an American magician, hypnotist and ventriloquist. He was the first American-born magician to gain fame in his own country and was African-American.\nPotter was born in Hopkinton, Massachusetts;. He claimed his father was Sir Charles Henry Frankland, a tax collector for the Port of Boston and that his mother Dinah was a black servant in the household. Since Sir Charles died in England in 1768, others believe the father may have been Henry Cromwell who lived in the household or a minister by the name of George Simpson.\nRichard Potter became a well-known magician in the New England area from 1811 to his death in 1834. As a performer he obscured most of his early life and encouraged speculation. Evidently he went to Hopkinton schools. Various accounts differ on the reason but agree that he went to Europe and joined John Rannie, a Scottish ventriloquist and magician. Rannie came to the United States in 1800.\nPotter toured with Rannie as one of his assistants in the Eastern United States. In 1811 Rannie retired to Scotland and encouraged Potter to continue on his own. This is also the year that he became a Mason of African Lodge No. 459 and was part of founding the Prince Hall Masonry. Potter performed up and down the East Coast, going as far south as Alabama. One of Potter's notable run-ins with prejudice occurred in Mobile, Alabama. Despite this issue, Potter still made over $4,000 during that visit.\nIn 1814 purchased about 175 acres in the village of Andover, New Hampshire. He built a large house on his estate. This area continues to be named after him as \"Potter's Place\".\nPotter inspired Grace Metalious's character Samuel Peyton in the novel Peyton Place.\nPotter married Sally Harris in 1808. Potter claimed she was a Penobscot Native American. They had 3 children. Richard and Sally are buried in a small graveyard on the property he bought in Andover. Their graves were moved but his request was to be buried upright."
    },
    {
        "name": "Roadmage",
        "description": "Roadmage is a street magic act created by magician and entertainer Owen Lean.\nSince 2002, Roadmage has been a fixture on Dublin's Grafton Street, London's Covent Garden, Granville Island in Vancouver and at club and festival venues. When Lean graduated in November 2006, the act, with Lean performing in full academical attire on Grafton Street, made national news, including the front page of The Irish Times\n."
    },
    {
        "name": "Romany, the Diva of Magic",
        "description": "Romany, the Diva of Magic, is a professional magician. She was featured on the cover of The Linking Ring magazine in August 2007. She was mentored by professional magician and teacher Jeff McBride, who was quoted as calling Romany \"a British Bette Midler.\""
    },
    {
        "name": "Rovi (magician)",
        "description": "Ivor Parry (known as Rovi) (29 November 1919 - 8 June 1996) was a Welsh magician. He was a Gold Star Medalist of the Inner Magic Circle, was known amongst magicians as The Welsh Wizard and was called 'a British legend' by Opus Magazine. Specialising in card magic, his original creations were published in 'Rovi Reveals' as part of the Supreme Magic Teach-in Series by Lewis Ganson. The Rovi Trophy is presented annually for the best card trick at the International Brotherhood of Magicians' British Ring Convention. Parry was born in Caernarfon."
    },
    {
        "name": "Étienne-Gaspard Robert",
        "description": "Étienne-Gaspard Robert (15 June 1763 – 2 July 1837), often known by the stage name of \"Robertson\", was a prominent Belgian physicist, stage magician and influential developer of phantasmagoria. He was described by Charles Dickens as \"an honourable and well-educated showman\". Alongside his pioneering work on projection techniques for his shows Robert was also a physics lecturer and a keen balloonist at a time of great development in aviation."
    },
    {
        "name": "George Schindler",
        "description": "George Schindler is an American stage magician, magic consultant, comedian, actor, ventriloquist and writer based in New York. In addition to creating noteworthy illusions and publishing many books on magic, Schindler has performed at venues around the world and is currently \"lifetime dean\" of the Society of American Magicians, having previous tenure in the \"S.A.M. Hall of Fame\" as well as president and spokesperson. From the 1950s to the 1960s, he had also been a frequent contributor to Billboard Magazine's comedy, magic and vaudeville columns."
    },
    {
        "name": "Howie Schwarzman",
        "description": "Howard Schwarzman (November 20, 1927, New York City) is an American magician, card manipulator, sleight of hand expert, and trick inventor. Considered a \"living legend\" in the Eastern United States magician community,[1] he is best known as a columnist within the magician trade press, and an importer of very rare tricks from outside the United States.\n\n"
    },
    {
        "name": "John Scarne",
        "description": "John Scarne (\/ˈskɑːrni\/; March 4, 1903 – July 7, 1985) was an American magician and book author who was particularly adept at playing card manipulation. He became known as an expert on cards and other games, and authored a number of popular books on cards, gambling, and related topics."
    },
    {
        "name": "Murray SawChuck",
        "description": "Murray John Sawchuk (born November 25, 1973, stage name Murray SawChuck) is a stage illusionist, magician, comedian, actor, and host. Based in Las Vegas, SawChuck has dubbed himself \"The 'Dennis the Menace' of Magic,\" and his shows often consist of a blend of \"comical mishaps\" that result in illusions and magic tricks. He was featured in the fifth season of America's Got Talent, and is the resident magic historian on Pawn Stars. SawChuck has also appeared as a magic coach on five episodes of the VH1 series Celebracadabra, and has been a guest star on shows such as Reno 911!, Last Comic Standing, Celebrity Blind Date, War of the Worlds 2: The Next Wave, and Ring of Darkness. He regularly tours worldwide."
    },
    {
        "name": "Pauline Schmidt",
        "description": "Pauline Wilhelmine Rasmussen Schmidt (1865-1944), was a professional Danish magician and photographer. She was one of very few females in her profession during her career.\nPauline Schmidt was a successful magician and a well known and appreciated artist in Sweden and Finland during the 1880s. In 1888, she married the Finnish photographer Niels Rasmussen and became his colleague in Tampere. She opened her own studio in 1914. During the 19th-century, female magicians were extremely rare and she was somewhat of an exception in her profession. As a career as a professional magician was considered shameful by the norms of the day, however, her former profession was never mentioned after she had retired.\nPauline Schmidt is portrayed in the novel Pauline Wilhelmine – trollkonstnärinna (Pauline Wilhelmine – a female magician), by Elisabeth Sandelin (2013)."
    },
    {
        "name": "Scott",
        "description": "Scott may refer to:"
    },
    {
        "name": "Cyril Takayama",
        "description": "Cyril Takayama (born September 27, 1973) is an American magician of Japanese, French, and Moroccan descent. He is perhaps best known for his magic performances around Japan.\n\n"
    },
    {
        "name": "David Stone (magician)",
        "description": "David Stone is a French comedian, writer, producer and magician specialized in close-up magic and coin magic."
    },
    {
        "name": "Harlan Tarbell",
        "description": "Harlan Eugene Tarbell (February 23, 1890 – June 16, 1960) was an American stage magician and illustrator of the early 20th century. He was the author of the well-known Tarbell Course in Magic.\nHis only foray into cinema was an early 1930s film short entitled \"Buck Rogers in the 25th Century\". He directed the production and starred as Doctor Huer.\n\n"
    },
    {
        "name": "Howard Thurston",
        "description": "Howard Thurston (July 20, 1869 – April 13, 1936) was a stage magician from Columbus, Ohio, United States. His childhood was unhappy, and he ran away to join the circus, where his future partner Harry Kellar also performed. Thurston was deeply impressed after he attended magician Alexander Herrmann's magic show and was determined to equal his work. He eventually became the most famous magician of his time. Thurston's traveling magic show was the biggest one of all; it was so large that it needed eight train cars to transport his road show."
    },
    {
        "name": "J C Sum",
        "description": "J C Sum (Sum Jan-chung) is a Singaporean illusionist, illusion designer and creative entrepreneur. Nicknamed \"The Thinking Man's Magician\", J C is one of the most highly regarded illusionists and illusion designers from Asia. AsiaOne named him as \"one of the most celebrated illusionists in Asia\" and MagicSeen called him \"The Ace in Asia\". The Straits Times stated that he is \"Singapore's most famous magician\" and The Business Times Singapore, credited him for bringing \"magic to the mainstream market in Asia\".\nJ C has been credited for popularising magic in Singapore by the local media and magic organizations."
    },
    {
        "name": "Jamy Ian Swiss",
        "description": "Jamy Ian Swiss (born January 1, 1953) is an American close-up magician and noted magic historian who works primarily with playing cards."
    },
    {
        "name": "Juan Tamariz",
        "description": "Juan Tamariz-Martel Negrón known professionally as Juan Tamariz or just Tamariz (born October 18, 1942, Madrid, Spain) is a Spanish magician.\nHe is an experienced cardician, a magician specializing in magic with playing cards, and well respected by his peers as an authority in the field of misdirection. Tamariz performed at FISM in 2006 \nA celebrity of television and stage in Spain and South America, Tamariz authored five books translated into English: The Five Points in Magic, The Magic Way, Sonata, Mnemonica, and Verbal Magic. Along with Arturo de Ascanio, Tamariz spearheaded a school of thought in close-up magic that has produced FISM award-winning magicians and influenced the craft of magic."
    },
    {
        "name": "Marco Tempest",
        "description": "Marco Tempest (born December 3, 1964) is a Swiss magician based in New York City. He is known for his multimedia magic and use of interactive technology and computer graphics in his illusions and presentations. He stars in the eight-part television series The Virtual Magician which has been broadcast in over 50 countries."
    },
    {
        "name": "Margo (magician)",
        "description": "Margo is the screen and stage name of Margo Timon (née Tucker), a magic performer and actress who had a starring slot in the NBC network television special The World's Most Dangerous Magic II. She worked with the duo The Pendragons."
    },
    {
        "name": "Morgan Strebler",
        "description": "Morgan Strebler (born Matthew Glenn Milligan, April 10, 1976 in Sikeston, Missouri) is an American psychological illusionist, actor, director, writer and producer. Strebler started practicing magic at the age of seven after seeing a live Harry Blackstone Jr performance. As an adult, Strebler started his acting career and moved to Las Vegas where he started construction on his multimillion-dollar illusion show. Some of his earliest acting roles inculcated Sesame Street and at 17 he was on the Young and the Restless and Guiding Light."
    },
    {
        "name": "Neil Tobin",
        "description": "Neil Tobin (born July 7, 1966) is a performer of magical and psychic entertainment, and a writer on related subjects.\nSince his performance material often involves themes of spirit contact—in addition to demonstrations of telepathy, precognition, magic, and even divination—he often performs as \"Neil Tobin, Necromancer.\"\nTobin was born in Chicago, Illinois."
    },
    {
        "name": "Princess Tenko",
        "description": "Princess Tenko is the stage name of Mariko Itakura (板倉 満里子, Itakura Mariko) (born June 29, 1959 in Arai, Niigata), a pop singer turned magician specialising in grand illusions. Besides being an illusionist, she is also known as a singer, stage director, movie director, video photographer and painter."
    },
    {
        "name": "Richard Turner (magician)",
        "description": "Richard Turner (born June 16, 1954) is an American card manipulation expert. \n\n"
    },
    {
        "name": "Sylvester the Jester",
        "description": "Daniel Sylvester Battagline, also known as Sylvester The Jester (born 1961), is an American magician, best known for playing a cartoon character who comes to life. He has had hundreds of stage and television appearances, including NBC’s \"World's Wildest Magic,\" ABC’s \"Champions of Magic III\", Jerry Lewis's Muscular Dystrophy Telethon and The Discovery Channel’s \"More Science of Magic.\" He has performed in multiple Las Vegas shows including opening for The Amazing Johnathan, and appearing at Caesar’s Magical Empire. He also produces a series of magic products, and has been credited with creating the illustrations for various magic publications, such as the cover for The Amazing Johnathan's Every Trick in the Book, and the poster for John Carney's \"Mr. Mysto\" act. In 1996, he also created a prop for the television show, \"Sabrina, the Teenage Witch.\" He has been featured on the cover of several magic and culture-related magazines, such as the September 1998 issue of Magic."
    },
    {
        "name": "Talma (magician)",
        "description": "Talma was the stage name of Mary Ann Ford (1861 – July 13, 1944), a female magician who is best known for performing with her husband Servais Le Roy in the act \"Le Roy, Talma & Bosco\". Talma was born in England while her husband was Belgian. She became accomplished at performing sleight of hand and manipulation acts, especially coin manipulation, and she was often billed as \"The Queen of Coins\". As a performer, she adopted the name Mercedes Talma but was generally known just as Talma. Talma was taught magic by Le Roy and although being an assistant she was known for her own coins tricks including the \"Out of the ear\" trick and \"Talma's travelling coin.\" Eventually she was known as \"The Queen Of Coins.\"  She formed a long-running stage partnership with her husband and their colleague Leon Bosco. They named their act \"The Comedians de Mephisto Co\" but they were much better known as Le Roy, Talma & Bosco. Le Roy is credited with devising the Asrah levitation illusion, which he and Talma first performed in London in 1914.\n\n"
    },
    {
        "name": "Teller (magician)",
        "description": "Teller (born Raymond Joseph Teller; February 14, 1948) is an American magician, illusionist, actor, comedian, writer, director and half of the comedy magic duo Penn & Teller, along with Penn Jillette. Teller usually does not speak during performances. He is an atheist, debunker, skeptic, and a fellow of the Cato Institute (a free market libertarian think tank that also lists Jillette as a fellow), an organization which is featured prominently in the duo's Showtime television series Bullshit!. Teller legally changed his name from \"Raymond Joseph Teller\" to the mononym \"Teller.\""
    },
    {
        "name": "Tom Stone (magician)",
        "description": "Tom Stone is the stage name of Thomas Bengtsson, a Swedish magician, editor and author."
    },
    {
        "name": "Topas (magician)",
        "description": "Topas is a German magician and comedian noted for his musical style of performance. His stage show with wife Roxanne has toured throughout the world, and has been featured on programs such as the French Le plus grand cabaret du monde and The World's Greatest Magic."
    },
    {
        "name": "Val Valentino",
        "description": "Val Valentino (born Leonard Monatono; June 14, 1956) is an American illusionist who gained fame by starring in four magic specials exposing magic secrets on the Fox network, using the stage name the Masked Magician. He became well known in Brazil after his sketches were broadcast in Rede Globo's Sunday newsmagazine show Fantástico from 1999 to 2000, in which he was referred by the alias Mr. M."
    },
    {
        "name": "Zati Sungur",
        "description": "Hasan Zati Sungur (March 10, 1898 – July 6, 1984) was an internationally recognized Turkish stage magician."
    },
    {
        "name": "Alan Watson (magician)",
        "description": "Alan Scott Watson QSM (born 26 November 1950) is a professional magician living and performing in Auckland, New Zealand. He has been performing professionally for more than 30 years and has won some of magic's highest awards and accolades. He is the current president of the Brotherhood of Auckland Magicians."
    },
    {
        "name": "Andrew Van Buren",
        "description": "Andrew Van Buren is a British performer who specialises in magic, large-scale illusions, juggling and plate spinning."
    },
    {
        "name": "Dai Vernon",
        "description": "Dai Vernon (pronounced alternatively as DIE or as DAY as in David) (June 11, 1894 – August 21, 1992), aka The Professor, was a Canadian magician. His expert sleight of hand technique and extensive knowledge garnered him respect among fellow magicians. His influence was considerable in the magic world, and he was a mentor to numerous famous magicians. He lived out his last years at the Magic Castle."
    },
    {
        "name": "Dick Williams (magician)",
        "description": "Dick Williams is a former television and radio presenter and magician who holds the Guinness World Record for hosting the longest-running television magic show in the world. Under the name \"Mr Magic\" he presented the show Magicland on WMC-TV in Tennessee from 1966 until his retirement in 1989. Dick performed tricks and illusions, juggled clubs and scarves, and is often remembered for his signature magician's finger exercises."
    },
    {
        "name": "Dominic Wood",
        "description": "Dominic Simon \"Dom\" Wood (born 3 January 1978 in Exeter, Devon) is an English entertainer, magician and presenter of radio and television, best known as one half of the double act Dick and Dom, with the other being Richard McCourt.\nFrom 14 October 2007 to September 2008, he and work partner McCourt presented the Sunday morning show on BBC Radio 1 from 10:00am – 1:00pm, but later left the show due to TV commitments."
    },
    {
        "name": "Frances Willard (magician)",
        "description": "Frances Louise Willard (born December 12, 1940) is an American magician.\nThe daughter of magician Harry Willard (1896–1970), who performed as \"Willard the Wizard\",  she began her career at age six as an assistant to her father. After her divorce from Texas newspaper editor Glenn Tucker, with whom she had three children (including Margo), she married magician Glenn Falkenstein. Their signature trick was the \"spirit cabinet\" illusion, a variation of which Willard had performed as a solo act. They received the Dunninger Award, the Milbourne Christopher Award of Excellence, and were inducted into the Society of American Magicians' Hall of Fame. Falkenstein died on July 4, 2010 of Alzheimer's disease.\nWillard is the mother-in-law of magician Michael Ammar.\n\n"
    },
    {
        "name": "Fred Van Buren",
        "description": "Fred Van Buren toured the world as a performer with his magic and illusion shows, performing with his wife Connie Greta as the magic illusion act Van Buren and Greta. A British born magician, illusionist and showman who is also well known as a builder and magical inventor. Van Buren's magic inventions include the unique Vanishing Motorbike and Rider which is performed completely surrounded by the audience, the Fluorescent Light Tubes Penetration which is an advancement of Robert Harbin's Experiment 13 illusion, and the Substitution Trunk to Fountain Finale. Recreations and advancements have included the Crinoline Lady and Disembodied Princess illusions."
    },
    {
        "name": "Greg Wood (magician)",
        "description": "Illusionist Greg Wood is an award winning magician, speaker, and comedian who has performed throughout Canada and the northern United States. He has also performed in Sri Lanka. England, Hong Kong, India, Fiji, and Mexico. Greg has also lectured and shared his effects with other magicians in England, Canada, and India.\nGreg started in theatre in his teens and worked with:\nManitoba School for Theatre and Allied Arts\nManitoba Summer Theatre Workshops\nCircle of Dionysus Theatre Company\nTranscona Amateur Theatre Association\nHe left performing to attend post secondary education and to become a professional Land Surveyor. He ran a successful Land Surveying and Consulting Business for over 20 years. Woods returned to the performing arts in the early 1990s as he started to perform magic and illusions, and left his business to become a full-time entertainer.\nGreg has had some of his original tricks published for other magicians, has appeared on TV a number of times including CBC’s “On The Road”, Global’s “It’s a New Day”, and CityTV’s “Breakfast Television” and was also appeared on the cover of “Seeing Truth” an international magic magazine. He is also featured in the documentary \"Pick A Card\"\nOver the last twenty years he and his wife Oonaugh have entertained hundreds of thousands with their comedy and magic at festivals, schools, churches, and corporate events. Greg is a three-time winner of Winnipeg’s “Best of Variety Act” and has twice won Manitoba’s “Close Up Conjuror’s” award."
    },
    {
        "name": "Gregory Wilson (magician)",
        "description": "Gregory Wilson is an American magician and a two-time FISM award winner, also known as \"The Honest Conman\" is a magician specializing in close-up magic, sleight-of-hand, confidence trickery. He is the subject of a chapter in magician Paul Harris's book, Art of Astonishment, Vol. 1. He is a regular performer at the Magic Castle in Hollywood, as well as large corporate events all over the world. He is professionally represented by Secret Source Entertainment, Inc. Gregory is also one of the resident \"Wizards\" on Syfy's magic show Wizard Wars with Penn & Teller."
    },
    {
        "name": "Mark Wilson (magician)",
        "description": "James \"Mark\" Wilson (born 1929) is an American magician and author. He is widely credited as becoming the first major \"television magician\" and in the process establishing the viability of illusion shows as a television format."
    },
    {
        "name": "Matt Wayne (magician)",
        "description": "Matt Wayne (born Matthew Wayne Tomasko; March 17, 1986) is an American illusionist, producer and television personality. He is best known for his work and skill as a performer of close-up magic. Wayne was born Matthew Wayne Tomasko in York, Pennsylvania, and is of Slovak descent on his father's side, and Russian Jewish on his mother's side. His mother, Robbie Ann, was a Calvin Klein and Gucci model living in Baltimore, Maryland, and his father John R. Tomasko is a photographer. When he was five years old, he received a magic set from his grandfather. In 2005, Wayne moved to Fukuoka, Japan, and lived solely by performing magic tricks. In 2006, Wayne moved back to the United States and moved to Manhattan, New York."
    },
    {
        "name": "Michael Vincent (magician)",
        "description": "Michael Vincent (born Michael Vincent Louis on 14 February 1964) is a British magician. He won The Magic Circle's Close-up Magician of the Year award three times (1983, 1991 and 2003)."
    },
    {
        "name": "Orson Welles",
        "description": "George Orson Welles (\/ˈwɛlz\/; May 6, 1915 – October 10, 1985) was an American actor, director, writer, and producer who worked in theatre, radio, and film. He is remembered for his innovative work in all three: in theatre, most notably Caesar (1937), a Broadway adaptation of William Shakespeare's Julius Caesar; in radio, the legendary 1938 broadcast \"The War of the Worlds\"; and in film, Citizen Kane (1941), consistently ranked as one of the all-time greatest films.\nWelles directed a number of high-profile stage productions for the Federal Theatre Project in his early twenties, including an adaptation of Macbeth with an entirely African American cast, and the political musical The Cradle Will Rock. In 1937 he and John Houseman founded the Mercury Theatre, an independent repertory theatre company that presented a series of productions on Broadway through 1941. Welles found national and international fame as the director and narrator of a 1938 radio adaptation of H. G. Wells' novel The War of the Worlds performed for his radio anthology series The Mercury Theatre on the Air. It reportedly caused widespread panic when listeners thought that an invasion by extraterrestrial beings was actually occurring. Although some contemporary sources claim these reports of panic were mostly false and overstated, they rocketed Welles to notoriety.\nHis first film was Citizen Kane (1941), which he co-wrote, produced, directed, and starred in as Charles Foster Kane. Welles was an outsider to the studio system and directed only 13 full-length films in his career. He struggled for creative control on his projects early on with the major film studios and later in life with a variety of independent financiers, and his films were either heavily edited or remained unreleased. His distinctive directorial style featured layered and nonlinear narrative forms, uses of lighting such as chiaroscuro, unusual camera angles, sound techniques borrowed from radio, deep focus shots, and long takes. He has been praised as \"the ultimate auteur\".\nWelles followed up Citizen Kane with critically acclaimed films including The Magnificent Ambersons in 1942 and Touch of Evil in 1958. Although these three are his most acclaimed films, critics have argued other works of his, such as The Lady from Shanghai (1947) and Chimes at Midnight (1966), are underappreciated.\nIn 2002, Welles was voted the greatest film director of all time in two British Film Institute polls among directors and critics, and a survey of critical consensus, best-of lists, and historical retrospectives calls him the second most acclaimed director of all time (behind Alfred Hitchcock). Known for his baritone voice, Welles was an actor in radio and film, a Shakespearean stage actor, and a magician noted for presenting troop variety shows in the war years."
    },
    {
        "name": "R. Paul Wilson",
        "description": "Ronald Paul Wilson (born in Akrotiri, Cyprus and raised in Singapore and Scotland) is a close-up magician and television presenter. He lives and works between London, Los Angeles, and his home in Scotland.\nHe was a writer and presenter on the BBC's The Real Hustle from 2006-2012."
    },
    {
        "name": "Roy Walton",
        "description": "Roy Walton (born April 1932 in London) is an English card magic expert. First interested in magic at the age of eight, Walton is a world-recognised card magician creating hundreds of card effects, including his most famous effect, Card warp. He has mentored numerous Scottish magicians including Jerry Sadowitz, R. Paul Wilson and Peter Duffie.\nMany of Walton's pamphlets and other works have been collected in three books on card magic currently published by Lewis Davenport Ltd. of London, and he continues to contribute to several English language magazines on card magic (e.g. Magic magazine and Genii magazine).\nHe currently lives and works in Glasgow, Scotland."
    },
    {
        "name": "Sue-Anne Webster",
        "description": "Sue-Anne Webster is an Australian magician, actor and writer who has been recognised internationally for her contributions to the art of magic."
    },
    {
        "name": "Tommy Wind",
        "description": "Tommy Wind is a magician from Staten Island in New York City. He has performed in many of his own original shows, combining illusion with rock and roll music, in New York City, Atlantic City, New Jersey, and Las Vegas, Nevada.\nTommy began his career when he was only 7 after his grandfather introduced him to magic by showing him the disappearing hanky trick. He has also appeared in TV shows including Criss Angel's \"Mindfreak\" and NBC's \"I Do!\". He is now the youngest magician to perform in Las Vegas up to date.\nTommy received an award on October 10, 2009 from the International Brotherhood of Magicians for Best Teen Magician of 2009. After receiving the award, he performed his famous floating antique table trick, also bringing up a member from the audience. \"When I had found out that I had won the award, one of my dreams had come true,\" says Tommy."
    },
    {
        "name": "Tommy Wonder (magician)",
        "description": "Tommy Wonder (November 29, 1953 – June 26, 2006) was the stage name of Jacobus Maria Bemelman, a Dutch magician who performed both close-up and stage magic. Wonder performed in Las Vegas, Monte Carlo and on Fox television.\nWonder developed an interest in conjuring at an early age. He studied acting, dancing and singing for three years at the Academie voor Podiumvorming (Performance Academy) in The Hague and subsequently toured for two years with De Haagsche Comedie.\nHe took second prize at the World Championships of Magic in 1979 and again in 1988. In 1998 he also received the Performer Fellowship Award from the Academy of Magical Arts in Hollywood. In 1999, he was awarded Best Sleight of Hand Performer from the World Magic Awards. Because Wonder designed and developed all of his own repertoire, he was held in high esteem amongst his colleagues in magic. Wonder's 1996 two-volume The Books of Wonder are highly acclaimed.\nTommy Wonder died after a brief battle with lung cancer.\nOn 5 August 2006 Tommy Wonder posthumously received the Theory & Philosophy Award at the FISM World Championships of Magic in Stockholm."
    },
    {
        "name": "Val Walker",
        "description": "Valentine Augustus Walker (15 February 1890 – 17 March 1969) (also known as Val A Walker and Val Enson) was an English magician, escape artist and illusion designer. He was born in Moseley, Birmingham to Joseph Walker, a landscape gardener, and his wife Emma. Val Walker worked as an electrical apparatus maker, later serving in the Royal Navy and was billed as the \"Wizard of the Navy\". Walker is credited as the designer of the Radium Girl illusion. His most famous escape was \"The Tank in the Thames\" where he was bolted in to a steel tank lowered in to the river Thames from the Sea-Scout Training Ship, Northampton on 20 August 1920. He escaped in 20 seconds. He was married in 1913 to Ethel Dora Harris, the daughter of Thomas Daniel Harris and his wife Emma Ellson. He retired from the stage in 1924, returning briefly in 1939, under the name of 'Val Enson', with an illusion called \"The Aquamarine Girl\"\n\n"
    },
    {
        "name": "Wittus Witt",
        "description": "Wittus Witt (born 1949) is a German magician, author and publisher."
    },
    {
        "name": "Anton Zamloch",
        "description": "Anton Zamloch, also known as “Professor Zamloch” and “Zamloch the Great,” was an American magician who toured with his magic act from 1869 through 1912. Zamloch performed at mining camp “opera houses” in the wild west, New York theaters and locations in Mexico, Hawaii, Canada and across the United States. His act grew to a large size, and he traveled with three assistants and “over a ton of baggage.”  Some newspaper accounts described him as “the greatest magician of the age.”"
    },
    {
        "name": "Florian Zimmer",
        "description": "Florian Zimmer is a noted German-born magician."
    },
    {
        "name": "Herb Zarrow",
        "description": "Herb Zarrow (November 4, 1925 – May 11, 2008) was an American magician influential in the profession for his inventions of unique sleight of hand and card tricks. His skills were held in the highest regard in professional magicians' circles.\n\nBorn in Paterson, New Jersey, Herb Zarrow became interested in magic through magic sets and magic books. Invented the Zarrow Shuffle (c. 1940), and for many magicians, that's all they know about this creative magician. He also invented: Herb Zarrow's Switch Change, Herb Zarrow's Trapeze, Herb Zarrow Retention Pass, Zarrow Block Addition, Starfish Copper\/Silver, Matched Revolvers, Universal Count Grip.\n\nZarrow's available biographical information is limited at best; a literature search does not reveal a lengthy biography of the man. However, he does appear in a DVD series about his card magic, in the magic literature, including David Ben's book Zarrow: A Lifetime of Magic.\nZarrow appeared on the cover of April, 2001 issue of The Linking Ring after being honored at the 2001 annual Fechter's Finger flicking Frolic convention of close up magicians for a lifetime of contributions and achievements. The Linking Ring article contains some biographical information. An auction of Zarrow's collection, including his extensive library and associated ephemera, was conducted by Potter & Potter Auctions on October 23, 2010."
    },
    {
        "name": "Paul Zenon",
        "description": "Paul Zenon (born Paul Collins on 29 June 1964) is an English stage and TV magician, comedian, presenter, corporate entertainer, commentator, writer and actor. He has appeared in numerous television shows and is an outspoken skeptic with strong views on claims of psychic abilities and the paranormal. He is the author of three published books on magic, proposition bets and practical jokes, respectively, and an expert on the history of Magic and magicians, Variety and unusual entertainments. His specialist subjects include illusionist, escape artiste and Spiritualist debunker Harry Houdini, faux Chinese magician Chung Ling Soo, and Jasper Maskelyne, the 'War Magician'. Paul is a Member of the Inner Magic Circle with Gold Star status and was the recipient of their Carlton Award for Comedy 2015."
    },
    {
        "name": "Rob Zabrecky",
        "description": "Robert \"Rob\" Zabrecky (born June 2, 1968 in Burbank, California) is an American songwriter, actor and magician. His career began as a musician while being the front man for the band Possum Dixon. He later found success as a magician and actor."
    },
    {
        "name": "Steve Wyrick",
        "description": "Steve Wyrick (born May 12, 1970) is an American magician from Garland, Texas who is currently headlining in Branson, Missouri at the 2,000-seat The White House Theatre where his new $10 million production opened in June 2015. Wyrick is best known for performing as a headliner in Las Vegas, Nevada for more than 15 years, having starred at Planet Hollywood Resort\/Casino, Aladdin Casino, Sahara Casino, and at the Las Vegas Hilton. He was featured in The World's Greatest Magic series on NBC in the 1990s. Awards include the prestigious Merlin Award as Magician of the Year for the International Magicians Society, the world's largest magic organization. Wyrick also headlined for multi-month perfrmances in Atlantic City at Harrah's Casino and at the Golden Nugget Resort\nWyrick has appeared on a variety of television shows, including appearances on Late Night with David Letterman, The Ellen DeGeneres Show, The History Channel, and VH1's Celebracadabra. Wyrick also appeared on TLC's American Chopper with the Teutel Family of Orange County Choppers, when they presented Wyrick with a custom-made chopper dubbed \"SW1000\" in honor of Wyrick's 1,000th performance at Planet Hollywood Resort & Casino in Las Vegas."
    },
    {
        "name": "The Zancigs",
        "description": ""
    }
]