[
    {
        "name": "Alfred Aho",
        "description": "Alfred Vaino Aho (born August 9, 1941) is a Canadian computer scientist best known for his work on programming languages, compilers, and related algorithms, and his textbooks on the art and science of computer programming."
    },
    {
        "name": "Andrei Alexandrescu",
        "description": "Andrei Alexandrescu (born 1969) is a Romanian-American C++ and D language programmer and author. He is particularly known for his pioneering work on policy-based design implemented via template metaprogramming. These ideas are articulated in his book Modern C++ Design and were first implemented in his programming library, Loki. He also implemented the \"move constructors\" concept in his MOJO library. He contributed to the C\/C++ Users Journal under the byline \"Generic<Programming>\". Alexandrescu worked as a research scientist at Facebook, before departing the company in August 2015 in order to focus on developing the D programming language.\nHe became an American citizen in August 2014.\nHe is a developer of the D programming language.\n\n"
    },
    {
        "name": "Bill Atkinson",
        "description": "Bill Atkinson (born 1951) is an American computer engineer and photographer. Atkinson worked at Apple Computer from 1978 to 1990.\nAtkinson was the principal designer and developer of the GUI of the Apple Lisa and, later, one of the first thirty members of the original Apple Macintosh development team, and was the creator of the ground-breaking MacPaint application, which fulfilled the vision of using the computer as a creative tool. He also designed and implemented QuickDraw, the fundamental toolbox that the Lisa and Macintosh used for graphics. QuickDraw's performance was essential for the success of the Macintosh's graphical user interface. He also was one of the main designers of the Lisa and Macintosh user interfaces. Atkinson also conceived, designed and implemented HyperCard, the first popular hypermedia system. HyperCard put the power of computer programming and database design into the hands of non-programmers. In 1994, Atkinson received the EFF Pioneer Award for his contributions."
    },
    {
        "name": "Brian Behlendorf",
        "description": "Brian Behlendorf (born March 30, 1973) is a technologist, executive, computer programmer, and an important figure in the open-source software movement. He was a primary developer of the Apache Web server, the most popular web server software on the Internet, and a founding member of the Apache Group, which later became the Apache Software Foundation. Behlendorf served as President of the Foundation for three years. Behlendorf has served on the board of the Mozilla Foundation since 2003 , Benetech since 2009 and the Electronic Frontier Foundation since 2013.\nBehlendorf, raised in Southern California, became interested in the early development of the Internet while he was a student at the University of California, Berkeley in the early 1990s. One of his first projects was an electronic mailing list and online music resource, SFRaves, which a friend persuaded him to start in 1992. Behlendorf was an early participant and the chief technology guru for the Burning Man festival, and also founded a large online resource devoted to electronic music and related subcultures.\nIn 1993, Behlendorf, Jonathan Nelson, Matthew Nelson and Cliff Skolnick co-founded Organic, Inc., the first business dedicated to building commercial web sites. While developing the first online, for-profit, media project — the HotWired web site for Wired Magazine — in 1994, they realized that the most commonly used web server software at the time (developed at the National Center for Supercomputing Applications at the University of Illinois at Urbana-Champaign) could not handle the user registration system that the company required. So, Behlendorf patched the open-source code to support HotWired's requirements.\nIt turned out that Behlendorf wasn't the only one busy patching the NCSA code at the time, so he and Cliff Skolnick put together an electronic mailing list to coordinate the work of the other programmers. By the end of February 1995, eight core contributors to the project started Apache as a fork of the NCSA codebase. Working loosely together, they eventually rewrote the entire original program as the Apache HTTP Server. In 1999, the project incorporated as the Apache Software Foundation.\nBehlendorf was the CTO of the World Economic Forum. He is also a former director and CTO of CollabNet, a company he co-founded with O'Reilly & Associates (now O'Reilly Media) in 1999 to develop tools for enabling collaborative, distributed software development. CollabNet used to be the primary corporate sponsor of the open source version control system Subversion, before it became a project of the Apache Software Foundation. He continues to be involved with electronic music community events such as Chillits, and speaks often at open source conferences worldwide.\nBehlendorf is currently Managing Director of Mithril, a global technology investment firm based in San Francisco.\nIn 2003, he was named to the MIT Technology Review TR100 as one of the top 100 innovators in the world under the age of 35.\nIn 2016 he was appointed as the Executive Director of the open source Hyperledger project at the Linux Foundation to advance blockchain technology."
    },
    {
        "name": "Daniel J. Bernstein",
        "description": "Daniel Julius Bernstein (sometimes known simply as djb; born October 29, 1971) is a German-American mathematician, cryptologist, programmer, and professor of mathematics and computer science at the Eindhoven University of Technology and research professor at the University of Illinois at Chicago. He is the author of the computer software programs qmail, publicfile, and djbdns which he released as license-free software, later as public domain software."
    },
    {
        "name": "Donald Becker",
        "description": "Donald Becker is a developer, who wrote Ethernet drivers for the Linux operating system.\nBecker, in collaboration with Thomas Sterling, created the Beowulf clustering software while at NASA, to connect many inexpensive PCs to solve complex math problems typically reserved for classic supercomputers. For this work, Becker received the Gordon Bell Prize in 1997.\nBecker became the Chief Technology Officer (CTO) of Scyld Computer Corporation, a wholly owned subsidiary of Penguin Computing, a developer and supplier of Beowulf Clusters."
    },
    {
        "name": "Doug Bell",
        "description": "Douglas Andrew Bell (born February 24, 1961) is a computer game developer, best known for his role as the lead designer and programmer for the classic Dungeon Master series of computer games, which met with critical success, from San Diego studio FTL Games."
    },
    {
        "name": "Eric Allman",
        "description": "Eric Paul Allman (born September 2, 1955) is an American computer programmer who developed sendmail and its precursor delivermail in the late 1970s and early 1980s at UC Berkeley. In 1998, Allman and Greg Olson co-founded the company Sendmail, Inc.\n\n"
    },
    {
        "name": "Fabrice Bellard",
        "description": "Fabrice Bellard (French pronunciation: ​[faˈbʁis bɛˈlaʁ]) is a computer programmer who is best known as the creator of the FFmpeg and QEMU software projects. He has also developed a number of other programs, including the Tiny C Compiler."
    },
    {
        "name": "Jeremy Ashkenas",
        "description": "Jeremy Ashkenas is a computer programmer known for the creation and co-creation of the CoffeeScript and LiveScript programming languages respectively, the Backbone.js JavaScript framework and the Underscore.js JavaScript library. Ashkenas has been a speaker at numerous conferences and events. He worked in the graphics department at The New York Times until September 2015 and returned there in September 2016."
    },
    {
        "name": "John Backus",
        "description": "John Warner Backus (December 3, 1924 – March 17, 2007) was an American computer scientist. He directed the team that invented the first widely used high-level programming language (FORTRAN) and was the inventor of the Backus–Naur form (BNF), a widely used notation to define formal language syntax. He also did research in function-level programming and helped to popularize it.\nThe IEEE awarded Backus the W. W. McDowell Award in 1967 for the development of FORTRAN. He received the National Medal of Science in 1975 and the 1977 ACM Turing Award “for profound, influential, and lasting contributions to the design of practical high-level programming systems, notably through his work on FORTRAN, and for publication of formal procedures for the specification of programming languages”.\n\n"
    },
    {
        "name": "Kent Beck",
        "description": "Kent Beck (born 1961) is an American software engineer and the creator of extreme programming, a software development methodology which eschews rigid formal specification for a collaborative and iterative design process. Beck was one of the 17 original signatories of the Agile Manifesto, the founding document for agile software development. Extreme and Agile methods are closely associated with Test Driven Development, of which Beck is perhaps the leading proponent.\nBeck pioneered software design patterns as well as the commercial application of Smalltalk. He wrote the SUnit unit testing framework for Smalltalk, which spawned the xUnit series of frameworks, notably JUnit for Java, which Beck wrote with Erich Gamma. Beck popularized CRC cards with Ward Cunningham, the inventor of the wiki.\nHe lives near Medford, Oregon and works at Facebook.\n\n"
    },
    {
        "name": "Lars Bak (computer programmer)",
        "description": "Lars Bak is a Danish computer programmer. He is known as a JavaScript expert and for his work on virtual machines. He is currently employed by Google, having contributed to the Chrome browser by developing the V8 JavaScript engine. After years abroad, Lars Bak now lives near Aarhus in Denmark.\n\n"
    },
    {
        "name": "Leonard Adleman",
        "description": "Leonard Adleman (born December 31, 1945) is an American computer scientist. He is one of the creators of the RSA encryption algorithm, for which he received the 2002 Turing Award, often called the Nobel prize of Computer science. He is also known for the creation of the field of DNA computing.\n\n"
    },
    {
        "name": "Marc Andreessen",
        "description": "Marc Lowell Andreessen (\/ænˈdriːsən\/ an-DREE-sən; born July 9, 1971) is an American entrepreneur, investor, and software engineer. He is the co-author of Mosaic, the first widely used Web browser; co-founder of Netscape; and co-founder and general partner of Silicon Valley venture capital firm Andreessen Horowitz. He founded and later sold the software company Opsware to Hewlett-Packard. Andreessen is also a co-founder of Ning, a company that provides a platform for social networking websites. He sits on the board of directors of Facebook, eBay, and Hewlett Packard Enterprise, among others. A frequent keynote speaker and guest at Silicon Valley conferences, Andreessen was one of only six inductees in the World Wide Web Hall of Fame announced at the First International Conference on the World-Wide Web in 1994."
    },
    {
        "name": "Paul Allen",
        "description": "Paul Gardner Allen (born January 21, 1953) is an American business magnate, investor and philanthropist. He is best known as the co-founder of Microsoft, alongside Bill Gates. As of August 2016, he was estimated to be the 40th richest person in the world, with an estimated wealth of $18.6 billion.\nAllen is the founder and Chief Executive Officer of Vulcan Inc., which manages his various business and philanthropic efforts. Allen also has a multibillion-dollar investment portfolio including technology and media companies, real estate holdings, and stakes in other companies. He owns two professional sports teams: the Seattle Seahawks of the National Football League and the Portland Trail Blazers of the National Basketball Association. He is also part-owner of the Seattle Sounders FC, which in 2009, joined Major League Soccer.\nHe is also the founder of Allen Institute for Brain Science, Institute for Artificial Intelligence, Institute for Cell Science and Vulcan Aerospace."
    },
    {
        "name": "Richard Bartle",
        "description": "Richard Allan Bartle FBCS FRSA (born 10 January 1960) is a British writer, professor and game researcher, best known for being the co-creator of MUD1 (an early MUD) and the author of the seminal Designing Virtual Worlds. He is one of the pioneers of the massively multiplayer online game industry."
    },
    {
        "name": "Sabeer Bhatia",
        "description": "Sabeer Bhatia (born 30 December 1968) is an Indian entrepreneur who founded the webmail company Hotmail.com."
    },
    {
        "name": "Scott Adams (game designer)",
        "description": "Scott Adams (born July 10, 1952) is the co-founder, with ex-wife Alexis, of Adventure International, an early publisher of games for home computers.\nBorn in Miami, Florida and currently living in Platteville, Wisconsin, Adams was the first person known to create an adventure-style game for personal computers, in 1978 on a 16KB Radio Shack TRS-80 Model I, written in the BASIC programming language. Colossal Cave was written two years earlier by Will Crowther, but on a minicomputer (the PDP-10). These early text adventure games use a minimal parser, recognizing 2-word commands of the form VERB NOUN. The parser only scanned the first three letters of each command, so inputting SCREAM BEAR, SCRATCH BEAR or SCREW BEAR would be treated identically. Scott had access to an advanced 16-bit computer at home, built by his brother Richard Adams, that gave him a jump on game programming in his leisure time.\nAdams's work was very influential on the adventure-gaming industry. In 1990 Computer Gaming World reported a statement by a \"respected designer\" that it was impossible to design new and more difficult adventure puzzles, because Adams had already created them all in his early games. The games from his company, Adventure International, were subsequently released on most of the major home PC platforms of the day, including TRS-80, Apple II series, Atari 8-bit series and Commodore PET. Versions of the games were also made for later platforms such as Vic-20 and some also had versions produced with rudimentary graphics.\nSince the late 1980s Scott Adams has worked as a senior programmer for AVISTA in Platteville.\nIn 2013, Scott Adams released the Bible-based The Inheritance, his first game in over ten years. As in most of his other games, the player is the protagonist of a novel-like story, and helps events unfold in a text adventure setting. However, this new game also includes sound."
    },
    {
        "name": "Tim Berners-Lee",
        "description": "Sir Timothy John Berners-Lee OM KBE FRS FREng FRSA FBCS (born 8 June 1955), also known as TimBL, is an English computer scientist, best known as the inventor of the World Wide Web. He made a proposal for an information management system in March 1989, and he implemented the first successful communication between a Hypertext Transfer Protocol (HTTP) client and server via the Internet sometime around mid-November of that same year.\nBerners-Lee is the director of the World Wide Web Consortium (W3C), which oversees the continued development of the Web. He is also the founder of the World Wide Web Foundation, and is a senior researcher and holder of the founders chair at the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL). He is a director of the Web Science Research Initiative (WSRI), and a member of the advisory board of the MIT Center for Collective Intelligence. In 2011, he was named as a member the board of trustees of the Ford Foundation.\nIn 2004, Berners-Lee was knighted by Queen Elizabeth II for his pioneering work. In April 2009, he was elected a foreign associate of the United States National Academy of Sciences. Named in Time magazine's list of the 100 Most Important People of the 20th century, Berners-Lee has received a number of other accolades for his invention. He was honoured as the \"Inventor of the World Wide Web\" during the 2012 Summer Olympics opening ceremony, in which he appeared in person, working with a vintage NeXT Computer at the London Olympic Stadium. He tweeted \"This is for everyone\", which instantly was spelled out in LCD lights attached to the chairs of the 80,000 people in the audience."
    },
    {
        "name": "Andrew Braybrook",
        "description": "Andrew Braybrook is a software engineer, a former game programmer. He created video games such as Paradroid, Gribbly's Day Out, Fire and Ice, Uridium and Morpheus. He also programmed the Commodore Amiga and Atari ST conversion of the arcade game Rainbow Islands.  Braybrook started out writing accounting programs for GEC Marconi using COBOL in 1979. In his spare time he wrote games in BASIC for the ZX80, ZX81 and Dragon 32. His first foray into professional games came while he was playing bass guitar in a rock band with Steve Turner. Steve was writing games for the ZX Spectrum in his spare time and decided to make his break into full-time games production by starting the company which went on to become Graftgold. A few months after its inception, Turner asked Braybrook to join him in September 1983. Braybrook was commissioned by the magazine Zzap!64 to write a diary detailing the making of the video game Paradroid.\nIn 1986 Braybrook was voted Best Programmer of the Year at the Golden Joystick Awards.\nBraybrook now works as a senior software developer for a large insurance firm."
    },
    {
        "name": "Andries Brouwer",
        "description": "Andries Evert Brouwer (born 1951) is a Dutch mathematician and computer programmer, Professor Emeritus at Eindhoven University of Technology (TU\/e)."
    },
    {
        "name": "Bert Bos",
        "description": "Gijsbert (Bert) Bos (born 1963) is a computer scientist known for the development of Argo, a web browser he developed as test application for his style sheet proposal."
    },
    {
        "name": "Dan Bricklin",
        "description": "Daniel Singer \"Dan\" Bricklin (born 16 July 1951), often referred to as “The Father of the Spreadsheet”, is the American co-creator, with Bob Frankston, of the VisiCalc spreadsheet program. He also founded Software Garden, Inc., of which he is currently president, and Trellix Corporation, which is currently owned by Web.com. He currently serves as the Chief Technology Officer of Alpha Software.\nHis book, Bricklin on Technology, was published by Wiley in May 2009."
    },
    {
        "name": "Danielle Bunten Berry",
        "description": "Danielle Bunten Berry (February 19, 1949 – July 3, 1998), born Daniel Paul Bunten, and also known as Dan Bunten, was an American game designer and programmer, known for the 1983 game M.U.L.E. (one of the first influential multiplayer games), and 1984's The Seven Cities of Gold.\nIn 1998 she was awarded the Lifetime Achievement Award by the Computer Game Developers Association. And in 2007, the Academy of Interactive Arts & Sciences chose Bunten to be inducted into their Hall of Fame.\n\n"
    },
    {
        "name": "David Bradley (engineer)",
        "description": "David J. Bradley (born 4 January 1949) was one of the twelve engineers who worked on the original IBM PC, developing the computer's ROM BIOS code. Bradley is credited for implementing the \"Control-Alt-Delete\" key combination that was used to reboot the computer."
    },
    {
        "name": "Dries Buytaert",
        "description": "Dries Buytaert (born 19 November 1978 in Wilrijk, Antwerp, Belgium) is an open-source software programmer notable as founder and lead developer of the Drupal CMS."
    },
    {
        "name": "Eric Bina",
        "description": "Eric J. Bina (born October 1964) is the co-creator of Mosaic and the co-founder of Netscape. In 1993, Bina along with Marc Andreessen authored the first version of Mosaic while working as a programmer at National Center for Supercomputing Applications (NCSA) at the University of Illinois at Urbana-Champaign.\nBina attended the University of Illinois at Urbana-Champaign, graduating from there with a Bachelor of Science degree in Computer Science in 1986 and a Master's degree in 1988. He joined NCSA in 1991 as a programmer. There, Bina and Andreessen started working on Mosaic in December 1992 and had a working version by March 1993. Mosaic was posted to the Internet and is famed as the first killer application that popularized the Internet. He is one of the five inaugural inductees to the World Wide Web Hall of Fame announced at the first international conference on the World Wide Web in 1994.\nEric is reported to have been a very skilled programmer during the time that he worked on Mosaic, and possessed a legendary work ethic that is characterized by several 48-hour stints of continuous software development. While there, his unofficial job title (which appeared on his business cards) was \"Unsung Hero.\"\nIn 1995, Bina and Andreessen were awarded the ACM Software System Award.\nIn 2010, Bina and Andreessen were inducted into the University of Illinois Engineering Hall of Fame.\nEric Bina now lives in Champaign-Urbana, Illinois with his wife."
    },
    {
        "name": "Grady Booch",
        "description": "Grady Booch (born February 27, 1955) is an American software engineer, best known for developing the Unified Modeling Language (UML) with Ivar Jacobson and James Rumbaugh. He is recognized internationally for his innovative work in software architecture, software engineering, and collaborative development environments.\n\n"
    },
    {
        "name": "Jack E. Bresenham",
        "description": ""
    },
    {
        "name": "John D. Carmack",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Joshua Bloch",
        "description": "Joshua J. Bloch (born August 28, 1961) is a software engineer and a technology author, formerly employed at Sun Microsystems and Google. He led the design and implementation of numerous Java platform features, including the Java Collections Framework, the java.math package, and the assert mechanism. He is the author of the programming guide Effective Java (2001), which won the 2001 Jolt Award, and is a co-author of two other Java books, Java Puzzlers (2005) and Java Concurrency In Practice (2006).\nBloch holds a B.S. in computer science from Columbia University and a Ph.D. in computer science from Carnegie Mellon University. His 1990 thesis was titled A Practical Approach to Replication of Abstract Data Objects and was nominated for the ACM Distinguished Doctoral Dissertation Award.\nBloch has worked as a Senior Systems Designer at Transarc, and later as a Distinguished Engineer at Sun Microsystems. In June 2004 he left Sun and became Chief Java Architect at Google. On August 3, 2012, Bloch announced that he would be leaving Google.\nIn December 2004, Java Developer's Journal included Bloch in its list of the \"Top 40 Software People in the World\".\nBloch has proposed the extension of the Java programming language with two features: Concise Instance Creation Expressions (CICE) (coproposed with Bob Lee and Doug Lea) and Automatic Resource Management (ARM) blocks. The combination of CICE and ARM formed one of the three early proposals for adding support for closures to Java. ARM blocks were added to the language in JDK7.\nBloch is currently a faculty member of the Institute for Software Research at Carnegie Mellon University, where he holds the title \"Professor of the Practice\". In addition to his research, Bloch teaches coursework in Software Engineering, course 15-214."
    },
    {
        "name": "Lawrence M. Breed",
        "description": "Lawrence Moser Breed is a computer scientist, artist and inventor, best known for his involvement in the APL programming language."
    },
    {
        "name": "Marc Blank",
        "description": "Marc Blank is an American game developer and software engineer. He is best known as part of the team that created one of the first commercially successful text adventure computer games, Zork."
    },
    {
        "name": "Richard Brodie (programmer)",
        "description": "Richard Reeves Brodie (born November 10, 1959) is an American computer programmer and author. He was the original creator of Microsoft Word. After leaving Microsoft, Brodie became a motivational speaker and authored two bestselling books."
    },
    {
        "name": "Sergey Brin",
        "description": "Sergey Mikhaylovich Brin (Russian: Серге́й Миха́йлович Брин; born August 21, 1973) is a Soviet-born American computer scientist, internet entrepreneur, and philanthropist. Together with Larry Page, he co-founded Google. Brin is the President of Google's parent company Alphabet Inc. In October 2016 (the most recent period for which figures are available), Brin was the 12th richest person in the world, with an estimated net worth of US$39.2 billion.\nBrin immigrated to the United States with his family from the Soviet Union at the age of 6. He earned his bachelor's degree at the University of Maryland, following in his father's and grandfather's footsteps by studying mathematics, as well as computer science. After graduation, he moved to Stanford University to acquire a PhD in computer science. There he met Page, with whom he later became friends. They crammed their dormitory room with inexpensive computers and applied Brin's data mining system to build a web search engine. The program became popular at Stanford, and they suspended their PhD studies to start up Google in a rented garage.\nThe Economist referred to Brin as an \"Enlightenment Man\", and as someone who believes that \"knowledge is always good, and certainly always better than ignorance\", a philosophy that is summed up by Google's mission statement, \"Organize the world's information and make it universally accessible and useful,\" and unofficial, sometimes controversial motto, \"Don't be evil\"."
    },
    {
        "name": "Stephen Richard Bourne",
        "description": ""
    },
    {
        "name": "Steve Capps",
        "description": "Steve Capps is an American computer programmer, who was one of the designers of the original Apple Macintosh computer.\nCapps started working at the Xerox Corporation while still a computer science student at the Rochester Institute of Technology. In 1981, Capps started working for Apple on the Lisa project and he continued his work on the Macintosh, principally writing the Finder (along with Bruce Horn) and Macintosh system utilities—such as ResEdit.\nDuring a break in 1986, he wrote three music programs including Jam Session, SoundEdit, and Super Studio Session; SoundEdit was eventually sold to Macromedia. From 1987 to 1996, he was the chief architect and Apple Fellow for the Apple Newton, where he led the specification and development of the user interface of Newton, shepherded the team of software developers, and wrote many portions of the built-in application software. From 1996 until 2001, he was a user interface architect at Microsoft. His early work at Microsoft resulted in the Internet Explorer Search, History, and Favorites panes. He was also a co-founder of the MSN Explorer project.\nAs of 2010, he was working at Silicon Valley start-up Kwedit, now called PayNearMe, focusing on online payment systems. At that time he was married to lawyer Marie D'Amico and had one child, Emma T Capps, who was born in 1997."
    },
    {
        "name": "Vinton Cerf",
        "description": ""
    },
    {
        "name": "Walter Bright",
        "description": "Walter Bright is an American computer programmer and the creator of the D programming language. He was also the main developer of the first C++ compiler to translate source code directly to object code without using C as an intermediate and Zortech C++ (later to become Symantec C++, now Digital Mars C++). Before designing the C++ compiler, he developed the Datalight C compiler, also sold as Zorland C and later Zortech C. He is also known for Empire, one of the first strategy computer games, written in 1971–1977 on a PDP-10. Recently he was hired by Facebook to write warp (a fast C\/C++ preprocessor) written in D.\n\n"
    },
    {
        "name": "Alain Colmerauer",
        "description": "Alain Colmerauer (born 24 January 1941 in Carcassonne) is a French computer scientist and the creator of the logic programming language Prolog."
    },
    {
        "name": "Alan Cooper",
        "description": "Alan Cooper (born June 3, 1952) is an American software designer and programmer. Widely recognized as the “Father of Visual Basic,\" Cooper is also known for his books About Face: The Essentials of Interaction Design and The Inmates Are Running the Asylum: Why High-Tech Products Drive Us Crazy and How to Restore the Sanity. As founder of Cooper, a leading interaction design consultancy, he created the Goal-Directed design methodology and pioneered the use of personas as practical interaction design tools to create high-tech products."
    },
    {
        "name": "Alan Cox",
        "description": "Alan Cox (born 22 July 1968) is a British computer programmer who has been a key figure in the development of the Linux operating system that runs on the overwhelming majority of web servers that operate on the modern internet. He maintained the 2.2 branch of the Linux kernel and continues to be heavily involved in the development of the Linux kernel, an association that dates back to 1991. He lives in Swansea, Wales, where he lived with his wife Telsa Gwynne, who died in 2015."
    },
    {
        "name": "Brad Cox",
        "description": "Brad Cox is a computer scientist and Ph.D. of mathematical biology known mostly for creating the Objective-C programming language with his business partner Tom Love and for his work in software engineering (specifically software reuse) and software componentry.\nHe received his Bachelor of Science Degree in Organic Chemistry and Mathematics from Furman University, and his Ph.D. from the Department of Mathematical Biology at the University of Chicago. Among his first known software projects, he wrote a PDP-8 program for simulating clusters of neurons. He worked at the National Institutes of Health and Woods Hole Oceanographic Institute before moving into the software profession.\nAlthough Cox invented his own programming language, Objective-C, which he used in his early career, he has stated in an interview for the Masterminds of programming book that he isn't interested in programming languages but rather in software components, and he regards languages as mere tools for building and combining parts of software.\nCox is also an entrepreneur, having founded the Stepstone company together with Tom Love for releasing the first Objective-C implementation. Later, NeXT acquired Objective-C from Stepstone. Objective-C continued to be the primary programming language for writing software for Apple’s OS X and iOS."
    },
    {
        "name": "Bram Cohen",
        "description": "Bram Cohen (born October 12, 1975) is an American computer programmer, best known as the author of the peer-to-peer (P2P) BitTorrent protocol, as well as the first file sharing program to use the protocol, also known as BitTorrent. He is also the co-founder of CodeCon and organizer of the San Francisco Bay Area P2P-hackers meeting, and was the co-author of Codeville.\n\n"
    },
    {
        "name": "Dave Cutler",
        "description": "David Neil \"Dave\" Cutler, Sr. (born March 13, 1942) is an American software engineer, designer and developer of several operating systems including Windows NT at Microsoft and RSX-11M, VMS and VAXELN at Digital Equipment Corporation."
    },
    {
        "name": "Edgar F. Codd",
        "description": "Edgar Frank \"Ted\" Codd (19 August 1923 – 18 April 2003) was an English computer scientist who, while working for IBM, invented the relational model for database management, the theoretical basis for relational databases. He made other valuable contributions to computer science, but the relational model, a very influential general theory of data management, remains his most mentioned achievement."
    },
    {
        "name": "Edsger Dijkstra",
        "description": ""
    },
    {
        "name": "Jack Dorsey",
        "description": "Jack Dorsey (born November 19, 1976) is an American computer programmer and internet entrepreneur widely known as a co-founder and CEO of Twitter, and as the founder and CEO of Square, a mobile payments company. In 2008, he was named to the MIT Technology Review TR35 as one of the top 35 innovators in the world under the age of 35. For 2012, The Wall Street Journal gave him the \"Innovator of the Year Award\" for technology."
    },
    {
        "name": "James Duncan Davidson",
        "description": "James Duncan Davidson (born July 29, 1970 in Lubbock, Texas) is an American photographer and a software developer. While a software engineer at Sun Microsystems (1997–2001), Davidson created Tomcat, a Java‐based webserver application and the Ant Java‐based build tool. Davidson is the author or co-author of several books on both using and writing software, including Learning Cocoa with Objective-C, Cocoa in a Nutshell, Running Mac OS X Panther, and Mac OS X Panther Hacks, all published by O’Reilly Media. He also contributed to Agile Web Development with Rails, published by The Pragmatic Programmers.\nHe was raised in Oklahoma and Texas, and as he writes in his Medium article, he is currently a software engineer at Microsoft working on Wunderlist, and a photographer. He is a resident of Berlin.\nIn 2005 Davidson turned his programming interests and attention in the direction of Ruby on Rails. In tandem with well‐known Rails guru Mike Clark, he designed and built some of the most complex and robust early Rails applications.\nStarting in 2005, Duncan added photography to his other professional focuses. He has served as the primary event photographer at several high-profile technology conferences. Since 2009 he has been the main stage photographer for TED conferences, photographing every TED and TEDGlobal event. In 2010, Duncan was the photographer for the Mission Blue Voyage in the Galapagos Islands and led the TEDxOilSpill Expedition in the Gulf of Mexico. Davidson is also known for his artistic travel photos, often with an eye for architectural details, a clear reference to his university studies in architecture.\nHe is co-founder and co-owner (along with Greg Koenig) of Luma Labs, a small company based in Portland, OR focused on making high quality camera accessories."
    },
    {
        "name": "Jeff Dean (computer scientist)",
        "description": "Jeffrey Adgate \"Jeff\" Dean (born 1968) is an American computer scientist and software engineer. He is currently a Google Senior Fellow in the Systems and Infrastructure Group."
    },
    {
        "name": "L. Peter Deutsch",
        "description": ""
    },
    {
        "name": "Mark Crispin",
        "description": "Mark Reed Crispin (July 19, 1956 in Camden, New Jersey – December 28, 2012 in Poulsbo, Washington) is best known as the father of the IMAP protocol, having invented it in 1985 during his time at the Stanford Knowledge Systems Laboratory. He is the author or co-author of numerous RFCs; and is the principal author of UW IMAP, one of the reference implementations of the IMAP4rev1 protocol described in RFC 3501. He also designed the mix mail storage format.\nCrispin earned a B.S. in Technology and Society from Stevens Institute of Technology in 1977.\n\n"
    },
    {
        "name": "Martin Dougiamas",
        "description": "Martin Dougiamas (born 20 August 1969) lives in Perth, Australia and is an educator and computer scientist. He has worked on social constructionist models of teaching and learning online, and led the development of the open source Moodle learning platform.\nDougiamas is the founder and CEO of Moodle Pty Ltd, the company that drives development of Moodle and is financed partly through certified service providers in the Moodle Partner network. Significant related services include MoodleCloud for hosted Moodle courses and the Moodle Mobile App, which extends Moodle functionality to mobile devices. The Moodle project is backed up by a large online community and in January 2016 the crowdfunding Moodle Users Association was launched.\n\n"
    },
    {
        "name": "Matt Dillon (computer scientist)",
        "description": ""
    },
    {
        "name": "Mike Cowlishaw",
        "description": "Mike F. Cowlishaw is a Visiting Professor at the Department of Computer Science at the University of Warwick, and a Fellow of the Royal Academy of Engineering. He is a retired IBM Fellow, and was a Fellow of the Institute of Engineering and Technology, and the British Computer Society. He was educated at Monkton Combe School and The University of Birmingham.\n\n"
    },
    {
        "name": "Ole-Johan Dahl",
        "description": "Ole-Johan Dahl (12 October 1931 – 29 June 2002) was a Norwegian computer scientist and is considered to be one of the fathers of Simula and object-oriented programming along with Kristen Nygaard."
    },
    {
        "name": "Ward Christensen",
        "description": "Ward Christensen (born 1945 in West Bend, Wisconsin, United States) is the co-founder of the CBBS bulletin board, the first bulletin board system (BBS) ever brought online. Christensen, along with partner Randy Suess, started development during a blizzard in Chicago, Illinois, and officially established CBBS four weeks later, on February 16, 1978.\nChristensen was noted for building software tools for his needs. He wrote a cassette-based operating system before floppies and hard disks were common. When he lost track of the source code for some programs he wrote ReSource, an iterative disassembler for the Intel 8080, to help him regenerate the source code. When he needed to send files to Randy Suess he wrote XMODEM.\nJerry Pournelle wrote in 1983 of a collection of CP\/M public-domain software that \"probably 50 percent of the really good programs were written by Ward Christensen, a public benefactor.\" Christensen received two 1992 Dvorak Awards for Excellence in Telecommunications, one with Randy Suess for developing the first BBS, and a lifetime achievement award \"for outstanding contributions to PC telecommunications.\" In 1993 he received the Pioneer Award from the Electronic Frontier Foundation.\nChristensen worked at IBM from 1968 until his retirement in 2012. His last position with IBM was field technical sales specialist."
    },
    {
        "name": "Ward Cunningham",
        "description": "Howard G. \"Ward\" Cunningham (born May 26, 1949) is an American computer programmer who developed the first wiki. A pioneer in both design patterns and extreme programming, he started programming the software WikiWikiWeb in 1994 and installed it on the website of his software consultancy, Cunningham & Cunningham (commonly known by its domain name, c2.com), on March 25, 1995, as an add-on to the Portland Pattern Repository.\nHe currently lives in Beaverton, Oregon, and is a programmer at New Relic. Previously he was the Co-Creation Czar for CitizenGlobal. He is Nike's first Code for a Better World Fellow.\nHe has authored a book about wikis, titled The Wiki Way, and also invented Framework for Integrated Tests. He was a keynote speaker at the first three instances of the WikiSym conference series on wiki research and practice.\n\n"
    },
    {
        "name": "William Crowther (computer programmer)",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Adam Dunkels",
        "description": "Adam Dunkels, Ph.D., is a Swedish entrepreneur, programmer and founder of Thingsquare. His work is mainly focused on networking technology and distributed communication for small embedded devices and wireless sensor networks on the Internet. Adam is best known to the embedded community as the author of the uIP (micro-IP) and lwIP TCP\/IP protocol stacks. He is also the creator of protothreads and author of the Contiki operating system. The MIT Technology Review placed him on the TR35 list of world's top 35 innovators under 35, in 2009.\nHis book Interconnecting Smart Objects with IP - the Next Internet, co-authored with JP Vasseur and with a foreword by Vint Cerf, was published in 2010.\nHe is a founder of the IPSO Alliance, who promotes IP networking for smart objects such as embedded systems and wireless sensors, and author of the alliance's white paper.\nAdam Dunkels received the 2008 EuroSys Roger Needham PhD Award for his PhD thesis \"Programming Memory-Constrained Networked Embedded Systems.\"."
    },
    {
        "name": "Adele Goldberg (computer scientist)",
        "description": "Adele Goldberg (born July 7, 1945) is a computer scientist who participated in developing the programming language Smalltalk-80 and various concepts related to object-oriented programming while a researcher at the Xerox Palo Alto Research Center (PARC), in the 1970s.\nGoldberg was born in Cleveland, Ohio, and grew up in Chicago, Illinois. She received her bachelor's degree in mathematics at the University of Michigan in Ann Arbor, and a master's degree in information science from the University of Chicago. She received her PhD in information science from the University of Chicago in 1973. She completed her dissertation, \"Computer-Assisted Instruction: The Application of Theorem-proving to Adaptive Response Analysis,\" while working as a research associate at Stanford University. She also served as a visiting researcher at Stanford University.\nGoldberg began working at PARC in 1973 as a laboratory and research assistant, and eventually became manager of the System Concepts Laboratory where she, Alan Kay, and others developed Smalltalk-80, which both developed the object-oriented approach of Simula 67 and introduced a programming environment of overlapping windows on graphic display screens. Not only was Smalltalk's innovative format simpler to use, it was also customizable and objects could be transferred among applications with minimal effort. Goldberg and Kay also were involved in the development of design templates, forerunners of the design patterns commonly used in software design.\nAlong with Kay, she wrote the influential article \"Personal Dynamic Media\", which predicted a world where ordinary individuals would use notebook computers to exchange, modify, and redistribute personal media. This paper outlined the vision for the Dynabook.\nShe served as president of the Association for Computing Machinery (ACM) from 1984 to 1986, and, together with Alan Kay and Dan Ingalls, received the ACM Software Systems Award in 1987 and was also included in Forbes's \"Twenty Who Matter\". She also received PC Magazine's Lifetime Achievement Award in 1996. In 1994 she was inducted as a Fellow of the Association for Computing Machinery.\nMany of the concepts developed by Goldberg and her team at PARC became the basis for graphically based user interfaces, replacing the earlier command line based systems. According to Goldberg, Steve Jobs demanded a demonstration of the Smalltalk System, which she refused to give him. Her superiors eventually ordered her to, at which point she complied, satisfied that the decision to \"give away the kitchen sink\" to Jobs and his team was then their responsibility. Apple eventually used many of the ideas in the Alto and their implementations as the basis for their Apple Macintosh desktop environment.\nIn 1988, Goldberg left PARC to co-found ParcPlace Systems, a company that created development tools for Smalltalk-based applications. She served as ParcPlace Systems's chairwoman and CEO until its 1995 merger with Digitalk.\nShe cofounded, and is currently working at Neometron, Inc. an Internet support provider in 1999, of Palo Alto, California. She works at Bullitics. At the same time, she continues to pursue her interest in education, formulating computer science courses at community colleges in the United States and at schools abroad. In the same vein, she is a board member and adviser at Cognito Learning Media, a provider of multimedia software for science education.\nThe Computer History Museum houses a collection of Goldberg's working documents, reports, publications and videotapes related to her work on the development of Smalltalk."
    },
    {
        "name": "Andrew Fluegelman",
        "description": "Andrew Cardozo Fluegelman (November 27, 1943 – c. July 6, 1985) was a publisher, photographer, programmer and attorney best known as a pioneer of what is now known as the shareware business model for software marketing. He was also the founding editor of both PC World and Macworld and the leader of the 1970s New Games movement, which advocated the development of noncompetitive games."
    },
    {
        "name": "Bill Gates",
        "description": "William Henry \"Bill\" Gates III (born October 28, 1955) is an American business magnate, entrepreneur, investor, author, and philanthropist. In 1975, he and Paul Allen co-founded Microsoft, which became the world's largest PC software company. During his career at Microsoft, Gates held the positions of chairman, CEO and chief software architect, and was the largest individual shareholder until May 2014. Gates has authored and co-authored several books.\nSince 1987, Gates has been included in the Forbes list of the world's wealthiest people and was the wealthiest from 1995 to 2007, again in 2009, and has been since 2014. Between 2009 and 2014, his wealth doubled from US$40 billion to more than US$82 billion. Between 2013 and 2014, his wealth increased by US$15 billion. Gates is currently the richest person in the world, with an estimated net worth of US$84 billion as of December 2016.\nGates is one of the best-known entrepreneurs of the personal computer revolution. He has been criticized for his business tactics, which have been considered anti-competitive, an opinion that has in some cases been upheld by numerous court rulings. Later in his career, Gates pursued a number of philanthropic endeavors, donating large amounts of money to various charitable organizations and scientific research programs through the Bill & Melinda Gates Foundation, established in 2000.\nGates stepped down as chief executive officer of Microsoft in January 2000. He remained as chairman and created the position of chief software architect for himself. In June 2006, Gates announced that he would be transitioning from full-time work at Microsoft to part-time work, and full-time work at the Bill & Melinda Gates Foundation. He gradually transferred his duties to Ray Ozzie and Craig Mundie. He stepped down as chairman of Microsoft in February 2014, taking on a new post as technology adviser to support the then newly appointed CEO Satya Nadella."
    },
    {
        "name": "Brad Fitzpatrick",
        "description": "Bradley Joseph \"Brad\" Fitzpatrick (born February 5, 1980 in Iowa), is an American programmer. He is best known as the creator of LiveJournal and is the author of a variety of free software projects such as memcached, PubSubHubbub, OpenID and Camlistore.\nBorn in Iowa, Fitzpatrick grew up in Beaverton, Oregon and majored in computer science at the University of Washington in Seattle.\nLiveJournal eventually became a full-time job and then a company, which he called Danga Interactive. In January 2005, Fitzpatrick sold Danga to Six Apart, for an undisclosed sum of cash and stock. He was named chief architect of Six Apart. He left Six Apart in August 2007 and joined the LiveJournal Advisory Board in 2008. He now works for Google as Staff Engineer and is part of the Go programming language team. In June 2014, the UW CSE in Seattle awarded Brad for Early Career Achievement."
    },
    {
        "name": "Brendan Eich",
        "description": "Brendan Eich (\/ˈaɪk\/; born 1961) is an American technologist and creator of the JavaScript programming language. He co-founded the Mozilla project, the Mozilla Foundation and the Mozilla Corporation, and served as the Mozilla Corporation's chief technical officer and briefly its chief executive officer. He is the CEO of Brave Software."
    },
    {
        "name": "Brian Fox (computer programmer)",
        "description": "Brian J. Fox (born 1959) is an American computer programmer, entrepreneur, consultant, author, and free software advocate. He was the original author of the GNU Bash shell, which he announced as a beta in June 1989. He continued as the primary maintainer of bash until at least early 1993. Mr. Fox also built the first interactive online banking software in the U.S. for Wells Fargo in 1995, and he created an open source election system in 2008."
    },
    {
        "name": "Dan Farmer",
        "description": "Dan Farmer (born April 5, 1962) is an American computer security researcher and programmer who was a pioneer in the development of vulnerability scanners for Unix operating systems and computer networks."
    },
    {
        "name": "David Filo",
        "description": "David Filo (born April 20, 1966) is an American businessman and the co-founder of Yahoo! with Jerry Yang. His Filo Server Program, written in the C programming language, was the server-side software used to dynamically serve variable web pages, called Filo Server Pages, on visits to early versions of the Yahoo! web site."
    },
    {
        "name": "Elon Gasper",
        "description": "Elon James Gasper is the former Senior VP at VizX Labs and co-founder of 1980s era software company Bright Star Technology. Described by Ken Williams as \"a genius ex-college professor specializing in linguistics,\" Elon holds several patents relating to Lip Sync and other technology, and has been active in independent inventors' organizations and their public affairs advocacy."
    },
    {
        "name": "Jim Fruchterman",
        "description": "Jim Fruchterman is an engineer and social entrepreneur. He is the founder and CEO of Benetech, a Silicon Valley nonprofit technology company that develops software applications to address unmet needs of users in the social sector. He is the recipient of numerous awards, including the MacArthur Fellowship and the Skoll Award for Social Entrepreneurship."
    },
    {
        "name": "Jim Gettys",
        "description": "Jim Gettys (born 15 October 1953) is an American computer programmer at Google. From 2009 through 2014, he worked at Alcatel-Lucent Bell Labs. Until January 2009, he was the Vice President of Software at the One Laptop per Child project, working on the software for the OLPC XO-1. He is one of the original developers of the X Window System at MIT and worked on it again with X.Org, where he served on the board of directors. He previously served on the GNOME foundation board of directors. He worked at the World Wide Web Consortium (W3C) and was the editor of the HTTP\/1.1 specification in the Internet Engineering Task Force through draft standard. Gettys helped establish the handhelds.org community, from which the development of Linux on handheld devices can be traced.\nGettys worked at DEC's Cambridge Research Laboratory. He won the 1997 Internet Plumber of the Year award on behalf of the group who worked on HTTP\/1.1. Gettys is one of the keepers of the Flame (USENIX's 1999 Lifetime Achievement Award) on behalf of The X Window System Community at Large.\nOne of his main goals at OLPC was to review and overhaul much of standard Linux software, in order to make it run faster and consume less memory and power. In this context, he has pointed out a common fallacy among programmers today: that storing computed values in memory is preferable to recomputing those values later. This, he claims, is often false on current hardware, given fast CPUs and the long time it takes to recover from a potential cache miss.\nSince 2010 Gettys has been a core member of the group investigating Bufferbloat and the effect it has on the performance of the Internet.\nHe holds a BSc degree from MIT in Earth and Planetary Sciences (course 12 — EAPS)."
    },
    {
        "name": "John Gilmore (activist)",
        "description": "John Gilmore (born 1955) is one of the founders of the Electronic Frontier Foundation, the Cypherpunks mailing list, and Cygnus Solutions. He created the alt.* hierarchy in Usenet and is a major contributor to the GNU project.\nAn outspoken civil libertarian, Gilmore has sued the Federal Aviation Administration, Department of Justice, and others. He was the plaintiff in the prominent case Gilmore v. Gonzales, challenging secret travel-restriction laws. He is also an advocate for drug policy reform.\nHe co-authored the Bootstrap Protocol in 1985, which evolved into DHCP - the primary way local networks assign devices an IP address.\n\n"
    },
    {
        "name": "Larry Ellison",
        "description": "Lawrence Joseph \"Larry\" Ellison (born August 17, 1944) is an American businessman, entrepreneur, and philanthropist who is co-founder of Oracle Corporation and was CEO from its founding until September 2014. He currently serves as executive chairman and chief technology officer of Oracle. In 2014, he was listed by Forbes magazine as the third-wealthiest person in America and as the fifth-wealthiest person in the world, with a fortune of US$56.2 billion.\nEllison was born in New York City but grew up in Chicago. He studied at the University of Illinois at Urbana–Champaign and the University of Chicago without graduating before moving to California in 1966. While working at Ampex in the early 1970s, he became influenced by Edgar F. Codd's research on relational database design, which led in 1977 to the formation of what became Oracle. Oracle became a successful database vendor to mid- and low-range systems, competing with Sybase and Microsoft SQL Server, which led to Ellison being listed by Forbes as one of the richest men in the world.\nEllison has donated up to 1% of his wealth to charity and has signed The Giving Pledge. In addition to his work at Oracle, Ellison has had success in yachting, through Oracle Team USA. He is a licensed aircraft pilot who owns two military jets."
    },
    {
        "name": "Les Earnest",
        "description": "Lester Donald Earnest (born December 17, 1930) is a United States computer scientist. He began his career as a computer programmer in 1954 during a stint as a U.S. Navy Aviation Electronics Officer & Digital Computer Project Officer at Naval Air Development Center, Johnsville, Pennsylvania. In 1956 Les joined the Massachusetts Institute of Technology to help design the Semi-Automatic Ground Environment (SAGE) air defense system.\nStarting in 1959 the focus of his career shifted to innovations within the field of word processing. During this time he was responsible for developing the \"first pen-based computer system that reliably recognized cursive writing\" and the first spell checker.From 1959-1966, he worked at the MITRE Corporation.\nIn the late 1960s Les continued to diversify the types of technologies he involved himself with. He made significant contributions in the fields of robotics through the creation of systems that coupled computer vision with prosthetic and vehicular applications.\nIn 1965, Les became Executive officer at Stanford Artificial Intelligence Laboratory, and he soon became deeply involved with the Advanced Research Projects Agency Network (ARPAnet) startup committee. This association would lead him to the one innovation he has received the most acclaim for: The invention of the Finger protocol (RFC 742) in the early 1970s.\nAccomplishments in computing aside, Les is also a long-time bicycle enthusiast. He has served as director and\/or officer in several prominent cycling associations including the U.S. Cycling Federation, the U.S. Bicycling Hall of Fame, and the Federation of Independent Associations for Cycling."
    },
    {
        "name": "Marc Ewing",
        "description": "Marc Ewing (born May 9, 1969) is the creator and originator of the Red Hat brand of software, most notably the Red Hat range of Linux operating system distributions. He was involved in the 86open project in the mid-1990s.\nEwing graduated from Carnegie Mellon University in 1992. While at CMU, he was known to wear a red hat as he walked between classes. Because of his computer expertise, people would ask for help from the \"man in the red hat\". Ewing and co-founder Bob Young named their initial software after the hat, and the name Red Hat stuck.\nAt the height of the dot com bubble in 1999, Ewing was briefly worth over 900 million dollars.\n\n"
    },
    {
        "name": "Martin Fowler",
        "description": "Martin Fowler (born 1963) is a British software developer, author and international public speaker on software development, specializing in object-oriented analysis and design, UML, patterns, and agile software development methodologies, including extreme programming.\nHis 1999 book Refactoring popularized the practice of code refactoring. In 2004 he introduced Presentation Model (PM), an architectural pattern."
    },
    {
        "name": "Steve Fawkner",
        "description": "Steve Fawkner is an Australian video game designer, programmer, and composer. He created the Warlords game series in 1989 and more recently the Puzzle Quest series.\n\n"
    },
    {
        "name": "Steve Gibson (computer programmer)",
        "description": "Steven Gibson (born 26 March 1955) is an American software engineer, security researcher, and IT security proponent. In the early 1980s, Gibson was best known for his work on light pen technology for use with Apple and Atari systems. In 1985, Gibson founded Gibson Research Corporation, best known for its SpinRite software."
    },
    {
        "name": "Stuart Feldman",
        "description": "Stuart Feldman is the creator of the computer software program make for UNIX systems. He was also an author of the first Fortran 77 compiler, and he was part of the original group at Bell Labs that created the Unix operating system.\nFeldman was the Vice President of Computer Science at IBM Research. He is currently Vice President, Engineering, East Coast, at Google. Feldman has served on the board of the Computing Research Association (CRA) and of the Association to Advance Collegiate Schools of Business (AACSB International). He was chair of ACM SIGPLAN and founding chair of ACM SIGecom. He was elected the President of the ACM in 2006. Feldman is also a member of the Editorial Advisory Board of ACM Queue, a magazine he helped found with Steve Bourne. He has also served on the editorial boards of IEEE Internet Computing and IEEE Transactions on Software Engineering. He received an A.B. in astrophysical sciences from Princeton University and a Ph.D in applied mathematics from the Massachusetts Institute of Technology. Feldman became a Fellow of the IEEE in 1991 and a Fellow of the ACM in 1995. In 2003, he was awarded ACM's Software System Award for his creation of make."
    },
    {
        "name": "Anders Hejlsberg",
        "description": "Anders Hejlsberg (\/hɑːlsbɛrɡ\/, born 2 December 1960) is a prominent Danish software engineer who co-designed several popular and commercially successful programming languages and development tools. He was the original author of Turbo Pascal and the chief architect of Delphi. He currently works for Microsoft as the lead architect of C# and core developer on TypeScript.\n\n"
    },
    {
        "name": "Andi Gutmans",
        "description": "Andi Gutmans (Hebrew: אנדי גוטמנס‎‎) is an Israeli programmer and entrepreneur. He helped co-create PHP and co-founded Zend Technologies and is a General Manager of NoSQL at Amazon Web Services. A graduate of the Technion, the Israel Institute of Technology in Haifa, Gutmans and fellow student Zeev Suraski created PHP 3 in 1997. In 1999 they wrote the Zend Engine, the core of PHP 4, and founded Zend Technologies, which has since overseen PHP advances, including the PHP 5  and most recent PHP 7 releases. The name Zend is a portmanteau of their forenames, Zeev and Andi.\nGutmans served as CEO of Zend Technologies until October 2015 when Zend was acquired by Rogue Wave Software. Before being appointed CEO in February 2009, he led Zend's R&D including development of all Zend products and Zend's contributions to the open-source Zend Framework and PHP Development Tools projects. He has participated at Zend in its corporate financing and has also led alliances with vendors like Adobe, IBM, Microsoft, and Oracle.\nGutmans served on the board of the Eclipse Foundation  (October 2005 - October 2008), is an emeritus member of the Apache Software Foundation, and was nominated for the FSF Award for the Advancement of Free Software in 1999.\nIn 2004 he wrote a book called \"PHP 5 Power Programming\"  together with Stig Bakken and Derick Rethans.\nGutmans was recognized by ComputerWorld magazine in July 2007  in their article “40 Under 40: 40 Innovative IT People to Watch, Under the Age of 40.” \nIn March 2016, Gutmans left Rogue Wave to join Amazon Web Services. Explaining his motivations, Gutmans cited \"Cloud infrastructure adoption is at a tipping point\" and \"the data 'center of gravity' is moving to the cloud\", where Amazon \"appears to effectively balance innovation and invention: a focus on customer value with a bias to action\". In his role at Amazon Web Services, Gutmans manages in-memory databases, including Amazon ElastiCache for memcached and redis."
    },
    {
        "name": "Andrew Gower",
        "description": "Andrew Christopher Gower (born 2 December 1978) is a British computer programmer and businessman. He is the co-founder of Cambridge-based Jagex Games Studio, the company he founded with Paul Gower and Ian Gower and Constant Tedder. He wrote the MMORPG RuneScape with the assistance of his two brothers, Ian and Paul Gower. In December 2010 he left the Jagex board of directors. He no longer has holdings in the company. As of November 2011, he is not listed under the credits for RuneScape. Since leaving Jagex, Gower has founded a new gaming development and consulting company, Fen Research, of which he holds 90% of the shares. Currently, he is developing a futuristic sci-fi strategy game named Solstrike. Gower has designed a statically typed programming language to aid in the project's development."
    },
    {
        "name": "Andy Hertzfeld",
        "description": "Andy Hertzfeld (born April 6, 1953) is an American computer scientist and inventor who was a member of the original Apple Macintosh development team during the 1980s. After buying an Apple II in January 1978, he went to work for Apple Computer from August 1979 until March 1984, where he was a designer for the Macintosh system software. Since leaving Apple, he has co-founded three companies: Radius in 1986, General Magic in 1990 and Eazel in 1999. In 2002, he helped Mitch Kapor promote open source software with the Open Source Applications Foundation. Hertzfeld joined Google in 2005, and in 2011 was the key designer of the Circles user interface in Google+."
    },
    {
        "name": "Bill Gosper",
        "description": "Ralph William Gosper, Jr. (born April 26, 1943), known as Bill Gosper, is an American mathematician and programmer. Along with Richard Greenblatt, he may be considered to have founded the hacker community, and he holds a place of pride in the Lisp community."
    },
    {
        "name": "Daniel Ha",
        "description": "Daniel Ha is co-founder and CEO of blog comment platform Disqus.\nHa started Disqus with co-founder Jason Yan, a classmate he had known since the 7th grade, in 2007 while attending University of California, Davis to study computer engineering. After registering disqus.com as a catchy domain to be used for any number of projects that they had in mind, the project evolved from just a domain registration into a blog comment platform. Once off the ground they applied and got accepted to Y Combinator, a startup incubator, and with that footing were able to secure more meetings with investors, eventually raising $10 million in funding in May 2011. Having gone through many investor meetings, Ha found initial success after striking a chord with Fred Wilson of Union Square Ventures, a user of the product, who would be the cornerstone of first round VC.\nHe was selected as one of the \"Best Young Tech Entrepreneurs 2011\" by Businessweek.\n\n"
    },
    {
        "name": "David Albert Huffman",
        "description": ""
    },
    {
        "name": "David Heinemeier Hansson",
        "description": "David Heinemeier Hansson (born 15 October 1979; known to the Ruby and car racing communities as DHH) is a Danish programmer and the creator of the popular Ruby on Rails web development framework and the Instiki wiki. He is also a partner at the web-based software development firm Basecamp (formerly 37signals).\nHansson co-wrote Agile Web Development with Rails with Dave Thomas in 2005 as part of The Facets of Ruby Series. He also co-wrote Getting Real, Rework, and Remote with Jason Fried."
    },
    {
        "name": "James Gosling",
        "description": "James Arthur Gosling, OC (born May 19, 1955) is a Canadian computer scientist, best known as the father of the Java programming language.\n\n"
    },
    {
        "name": "Jim Hall (programmer)",
        "description": "Jim Hall (James Hall) is a computer programmer and advocate of free software, best known for his work on FreeDOS. Hall began writing the free replacement for the MS-DOS operating system in 1994 when he was still a physics student  at the University of Wisconsin-River Falls. He remains active with FreeDOS, and is currently the coordinator for the project.\nHall has said he created FreeDOS in response to Microsoft announcing end of support for MS-DOS in 1994, a year before Windows 95 was released. As a user and fan of MS-DOS, Hall did not want the functionality of DOS to go away. Prompted by a March 31, 1994 post on comp.os.msdos.misc asking if \"anyone, for example GNU et al. ever considered writing a Public Domain DOS\", Hall decided to garner support for a free version of DOS, written under a free or public domain model. In a June 29, 1994 post, Hall announced an effort to create a free DOS, called PD-DOS, writing:\n\nA few months ago, I posted articles relating to starting a public\ndomain version of DOS. The general support for this at the time was strong, and many people agreed with the statement, \"start writing!\" So, I have...\nAnnouncing the first effort to produce a PD-DOS. I have written up a \"manifest\" describing the goals of such a project and an outline of the work, as well as a \"task list\" that shows exactly what needs to be written. I'll post those here, and let discussion follow.\nIf you are thinking about developing, or have ideas or suggestions for PD-DOS, I would appreciate direct email to me. If you just want to discuss the merits or morals of writing a PD-DOS, I'll leave that to the net. I'll check in from time to time to see how the discussion is going, and maybe contribute a little to what promises to be a very polarized debate!  :->\nI am excited about PD-DOS, and I am hoping I can get a group started!\n\nWithin a few weeks, other programmers including Pat Villani and Tim Norman joined the project. A kernel, the COMMAND.COM command line interpreter (shell) and core utilities were created by pooling code they had written or found available. Hall wrote over a dozen of the first DOS utilities for the project, mostly file and batch utilities. In a July 26, 1994 post, Hall announced the PD-DOS project had been renamed to \"Free-DOS\", having updated the project's goals to intend to distribute source code under the GNU General Public License. The project would later be renamed \"FreeDOS\", without the hyphen, after the publication of FreeDOS Kernel, by Pat Villani. Hall was the project's release coordinator from Beta1 until about Beta7, and also released the first alpha distribution of Free-DOS, as announced in a post on comp.os.msdos.misc. He is again the project coordinator since April 2011 after Pat Villani's departure.\nHall is also the original developer of GNU Robots, but he is no longer active on this project and has since handed maintainership over to Tim Northover. It is now being developed by Bradley Smith."
    },
    {
        "name": "John Graham-Cumming",
        "description": "John Graham-Cumming is a British programmer and writer best known for having originated a successful petition to the British Government asking for an apology for its persecution of Alan Turing.\nGraham-Cumming is the original writer of POPFile, an open-source, cross-platform e-mail filtering program. He is the author of The Geek Atlas, a travel book, and GNU Make Unleashed, a how-to technical manual for the GNU make program.\nIn October 2010, he started an organization whose aim is to build Charles Babbage's Analytical Engine  known as Plan 28 and has also campaigned for open-source software in science. In 2014 he launched his microblog MovieCode site, the intention of which is to connect film screenshots to specific extracts of source code."
    },
    {
        "name": "Neil J. Gunther",
        "description": "Neil Gunther, (born 15 August 1950) is a computer information systems researcher best known internationally for developing the open-source performance modeling software Pretty Damn Quick and developing the Guerrilla approach to computer capacity planning and performance analysis. He has also been cited for his contributions to the theory of large transients in computer systems and packet networks, and his universal law of computational scalability.\nGunther is a Senior Member of both the Association for Computing Machinery (ACM) and the Institute of Electrical and Electronics Engineers (IEEE), as well as a member of the American Mathematical Society (AMS), American Physical Society (APS), Computer Measurement Group (CMG) and ACM SIGMETRICS.\nHe is currently focused on developing quantum information system technologies.\n\n"
    },
    {
        "name": "Paul Gower",
        "description": ""
    },
    {
        "name": "Paul Graham (computer programmer)",
        "description": "Paul Graham (born 13 November 1964) is an English computer scientist, venture capitalist, and essayist. He is known for his work on Lisp, for co-founding Viaweb (later renamed \"Yahoo! Store\"), and for co-founding the Y Combinator seed capital firm. He is the author of some programming books, such as: On Lisp (1993), ANSI Common Lisp (1995), and Hackers & Painters (2004)."
    },
    {
        "name": "Ralph Griswold",
        "description": "Ralph E. Griswold (May 19, 1934, Modesto, CA – October 4, 2006, Tucson, AZ) was a computer scientist known for his research into high-level programming languages and symbolic computation. His language credits include the string processing language SNOBOL, SL5, and Icon.\nHe attended Stanford University, receiving a bachelor's degree in physics, then an M.S. and Ph.D. in electrical engineering. Griswold went to Bell Labs in 1962, where he studied ideas for non-numerical computation. SNOBOL was the outcome; it was a radically different language in its time and still is. He became the head of the Labs' Programming Research and Development department in 1967.\nIn 1971, he was hired by the University of Arizona to be its first professor of computer science, subsequently organized the department, and was its head until 1981. While at Arizona, Griswold developed Icon. The earlier Ratfor implementation of Icon was discarded and the language rewritten from scratch in C and UNIX.\nIn 1990 Griswold was appointed Regents' Professor, and he retired in 1995. \"As one of the founders of the Bell Labs software culture which spawned UNIX, C, and many other essential contributions to modern software, Ralph Griswold brought to his academic research not only brilliance, but also experience and a value system that demanded that research ideas be tested by fire and proven useful and usable by real users, not just good-looking diagrams in academic papers.\"\nAfter his retirement, his interests turned to the mathematical aspects of weaving.\nGriswold died on October 4, 2006, from cancer.\nGriswold's son, Bill Griswold, is also a computer scientist."
    },
    {
        "name": "Rebecca Heineman",
        "description": "Rebecca Ann Heineman (born William Salvador Heineman) is an American video game programmer. A long-time veteran of the computer game industry (originally credited mostly as Bill Heineman), Heineman was a founding member of Interplay Productions, Logicware, and Contraband Entertainment. She has also been affiliated at various times with Barking Lizards Technologies, Electronic Arts, Bloomberg, Microsoft, MacPlay and Ubisoft, among other game companies. Heineman works as the CEO of Olde Skuul in Seattle, Washington."
    },
    {
        "name": "Richard Greenblatt (programmer)",
        "description": "Richard D. Greenblatt (born December 25, 1944) is an American computer programmer. Along with Bill Gosper, he may be considered to have founded the hacker community, and holds a place of distinction in the Lisp and the MIT AI Lab communities."
    },
    {
        "name": "Ryan C. Gordon",
        "description": "Ryan C. Gordon (also known as icculus) is a computer programmer and former Loki Software employee who is now responsible for icculus.org, which hosts many Loki Software projects as well as several new projects created by himself and others. Gordon's site hosts projects with the code from such commercial games as Duke Nukem 3D, Shadow Warrior, Quake III Arena and many other free and open source projects for multiple platforms.\nGordon has also created ports of proprietary software products to the Linux and Mac OS X platforms. These include being hired to port most of the Unreal Tournament series, some of the Serious Sam series, the official Postal series, some Tripwire Interactive and Coffee Stain Studios titles, and Prey. He has also been involved in porting several non-gaming products such as Second Life and Google Earth. Some, such as Candy Cruncher and Postal 2, have been published by Linux Game Publishing. He has also been described alongside Edward Rudd as being \"instrumental\" in ensuring the multi-platform nature of the Humble Indie Bundle initiatives.\n\n"
    },
    {
        "name": "Scott Guthrie",
        "description": "Scott Guthrie (born 1975) is an Executive Vice President of the Cloud and Enterprise group in Microsoft. He is best known for his work on ASP.NET, which he and colleague Mark Anders developed while at Microsoft.\nHe runs the Microsoft Azure (formerly known as Windows Azure) team as well as the development teams that build Windows Server, Microsoft SQL Server, Active Directory, System Center, Visual Studio and .NET.\nGuthrie graduated with a degree in computer science from Duke University. Following this, he chose to focus on his major and joined Microsoft in 1997. He frequently presents wearing a signature red shirt  and speaks at many of the major Microsoft conferences.\nIn October 2016, Guthrie unveiled the capabilities of Microsoft’s Azure-based Dynamics 365 service in a demo at a Summit conference in Tampa, Florida."
    },
    {
        "name": "Ted Henter",
        "description": "Ted Henter is an American computer programmer and businessman known for having invented the JAWS screen reader for the blind. He studied engineering, but learned computer programming and started his own business after becoming blind in a car accident in 1978, which put an end to a promising career as an international motorcycle racer.\nIn 1987, he teamed up with businessman Bill Joyce, who together founded Henter-Joyce in St. Petersburg, Florida. Henter was president and led the operation and provided technology direction while Joyce acted as a silent partner. Henter-Joyce produced JAWS, a screen reader for personal computers using MS-DOS, and later Microsoft Windows.\nAfter becoming blinded, Henter rediscovered waterskiing, and started competing in waterskiing events. He won six times out of seven competitions in the United States and twice in international competition. He retired in 1991 after winning the overall Gold medal in the United States and World Championship for Disabled Skiers.\nHenter-Joyce merged with Arkenstone and Blazie Engineering in 2000 to form Freedom Scientific. Henter currently remains on the board of directors of Freedom Scientific, and in 2002 he founded Henter Math, to produce software that helps the \"pencil-impaired\" with mathematics."
    },
    {
        "name": "Bill Joy",
        "description": "William Nelson \"Bill\" Joy (born November 8, 1954) is an American computer scientist. Joy co-founded Sun Microsystems in 1982 along with Vinod Khosla, Scott McNealy and Andreas von Bechtolsheim, and served as chief scientist at the company until 2003. He played an integral role in the early development of BSD UNIX while a graduate student at Berkeley, and he is the original author of the vi text editor. He also wrote the 2000 essay \"Why the Future Doesn't Need Us\", in which he expressed deep concerns over the development of modern technologies.\n\n"
    },
    {
        "name": "Bo Jangeborg",
        "description": "Bo Jangeborg is a Swedish computer programmer. He made several programs for the ZX Spectrum, the best known being the game Fairlight, its sequel Fairlight II and the graphic tool The Artist. He is also known for writing Flash!, the art package provided with every SAM Coupé.\nToday he runs the small software company Softwave."
    },
    {
        "name": "C. A. R. Hoare",
        "description": ""
    },
    {
        "name": "D. Richard Hipp",
        "description": "Dwayne Richard Hipp (born April 9, 1961) is the architect and primary author of SQLite as well as the Fossil SCM. He and his wife, Ginger G. Wyrick, currently live and work in Charlotte, North Carolina. He also authored the Lemon Parser Generator and CVSTrac. CVSTrac became the inspiration for Trac. He was also a member of the Tcl core team."
    },
    {
        "name": "Dan Ingalls",
        "description": ""
    },
    {
        "name": "Dave Hyatt",
        "description": "Dave Hyatt (June 28, 1972) is an American Software Engineer employed by Apple Inc. (since July 15, 2002), where he is part of the development team responsible for the Safari web browser and WebKit framework. Hyatt was part of the original team that shipped the beta releases and 1.0 release of Safari. He is the Safari and WebKit Architect.\nBefore Apple, Hyatt worked at Netscape Communications from 1997 to 2002 where he contributed to the Mozilla web browser. While at Netscape, he also created Camino (then known as Chimera) and co-created Firefox (originally called Phoenix) with Blake Ross. He is credited with the implementations of tabbed browsing for Chimera and Firefox (the initial implementation for Netscape\/Mozilla browsers, on which Hyatt based his work was created by HJ van Rantwijk, as part of his MultiZilla project at multizilla.mozdev.org).\nHyatt also created and wrote the first specifications for the XBL and XUL markup languages.\nHyatt studied as an undergraduate at Rice University and graduate at University of Illinois at Urbana-Champaign.\nHyatt developed, but no longer maintains, the software for Shadowland Six in his spare time; a forum and discussion server for the Shadowrun community. He also co-wrote published material for Shadowrun as a freelance writer, including the books Renraku Arcology: Shutdown and Brainscan.\nHe is also an active member of the W3C's CSS Working Group. He was an editor of the HTML5 draft specification up through March 2010, at which time he resigned to concentrate on other endeavors."
    },
    {
        "name": "Geir Ivarsøy",
        "description": "Geir Ivarsøy (June 27, 1957 – March 9, 2006) was the lead programmer at Opera Software. He and Jon von Tetzchner were part of a research group at the Norwegian state phone company (now known as Telenor) where they developed browsing software called MultiTorg Opera. The project was abandoned by Telenor, but in 1995 Geir and Jon obtained the rights to the software, formed a company of their own, and continued working on it.\nNow known simply as Opera, the browser has become very popular despite the competition. Opera Software has grown to more than 500 employees since it first moved to its present offices in Oslo.\nAt a board meeting in January 2004, Geir Ivarsøy announced his wish to resign as a board member in Opera Software, though he remained active in the company even after that. In June 2005 he was elected as a member of the Nomination Committee of the company.\nIvarsøy died in March 2006 after a long battle with cancer. Opera distributions starting with Version 9 state \"In memory of Geir Ivarsøy\" on their opera:about page."
    },
    {
        "name": "Grace Hopper",
        "description": "Grace Brewster Murray Hopper (née Murray; December 9, 1906 – January 1, 1992) was an American computer scientist and United States Navy Rear Admiral. In 1944, she was one of the first programmers of the Harvard Mark I computer  and invented the first compiler for a computer programming language. She popularized the idea of machine-independent programming languages, which led to the development of COBOL, one of the first high-level programming languages. She also popularized use of the term bug (already established in other technical contexts) in reference to computer software or hardware design failures.\nOwing to her accomplishments and her naval rank, she was sometimes referred to as \"Amazing Grace\". The U.S. Navy Arleigh Burke-class guided-missile destroyer USS Hopper was named for her, as was the Cray XE6 \"Hopper\" supercomputer at NERSC.\nOn November 22, 2016, she was posthumously awarded the Presidential Medal of Freedom by President Barack Obama."
    },
    {
        "name": "Kenneth E. Iverson",
        "description": "Kenneth Eugene Iverson (17 December 1920 – 19 October 2004) was a Canadian computer scientist noted for the development of the APL programming language. He was honored with the Turing Award in 1979 \"for his pioneering effort in programming languages and mathematical notation resulting in what the computing field now knows as APL; for his contributions to the implementation of interactive systems, to educational uses of APL, and to programming language theory and practice\"."
    },
    {
        "name": "Lynne Jolitz",
        "description": "Lynne Greer Jolitz (born June 30, 1961) is a figure in free software and founded many startups in Silicon Valley with her husband William.\nLynne Jolitz is probably most famous for her work in pioneering open source operating systems with 386BSD with her husband. She has founded startup companies that involve workstations to companies in Internet multimedia.\nLynne is also a noted author and authority on operating systems and networking issues. Lynne is an internet news media commentator discussing events in the computer industry and wrote frequently for BYTE.\nShe also holds patents in internet technologies and semiconductor memory innovations, and writes technical papers and articles.\nShe is currently an adviser to CoolClip network, an internet startup that uses the server-based video production engine that Lynne originally designed and tested at the University of California, Berkeley.\nLynne has appeared on the Oracle E-Business Network and was presented with their Geek of the Week award for her years of work in high-speed networking and operating systems design. Lynne also has appeared on Dvorak’s RealComputing discussing the impact of Internet broadband.\nShe received an alumni award from the Physics Department at Berkeley for her work in alumni outreach with the department. She also is active in women’s entrepreneur and technology networking groups and mentoring girls in science and technology.\nShe and her husband reside in Los Gatos, California with their children Rebecca, Benjamin and Sarah."
    },
    {
        "name": "Miguel de Icaza",
        "description": "Miguel de Icaza (born c. 1972) is a Mexican programmer, best known for starting the GNOME, Mono, and Xamarin projects.\n\n"
    },
    {
        "name": "Mitch Kapor",
        "description": "Mitchell David \"Mitch\" Kapor (\/ˈkeɪ.pʊər\/ KAY-poor), born November 1, 1950, is an entrepreneur best known for promoting the first spreadsheet VisiCalc, and later founding Lotus, where he was instrumental in developing the Lotus 1-2-3 spreadsheet. He left Lotus in 1986. In 1990 with John Perry Barlow and John Gilmore, he co-founded the Electronic Frontier Foundation, and served as its chairman until 1994. Kapor has been an investor in the personal computing industry, and supporter of social causes, like the Hidden Genius Project, The College Bound Brotherhood, and Advancement Project. As Partner at Kapor Capital and the Kapor Center for Social Impact, Mitch, along with his wife Freada Kapor Klein, invests in social impact tech startups that seek to narrow gaps in opportunity and access for underrepresented communities and attempt to eliminate barriers to full participation across the tech ecosystem.\n\n"
    },
    {
        "name": "Paul Jardetzky",
        "description": ""
    },
    {
        "name": "Poul-Henning Kamp",
        "description": "Poul-Henning Kamp (born 1966) is a Danish computer software developer known for work on various projects. He currently resides in Slagelse, Denmark."
    },
    {
        "name": "Rich Hickey",
        "description": "From a merge: This is a redirect from a page that was merged into another page. This redirect was kept in order to preserve this page's edit history after its content was merged into the target page's content. Please do not remove the tag that generates this text (unless the need to recreate content on this page has been demonstrated) nor delete this page.\nFor redirects with substantive page histories that did not result from page merges use {{R with history}} instead."
    },
    {
        "name": "Robert K. Jung",
        "description": "From a duplicated article: This is a redirect from a page on the same or very similar subject matter that was kept as a redirect in order to preserve this page's edit history after the content was merged.\nPlease do not delete this redirect nor remove this tag unless the need to recreate this article is demonstrated."
    },
    {
        "name": "Roberto Ierusalimschy",
        "description": "Roberto Ierusalimschy (Portuguese pronunciation: [ʁoˈbɛʁtu jeɾuzaˈlĩski]; born May 21, 1960) is a Brazilian computer scientist of Jewish descent, known for creating Lua programming language. He holds a Ph.D in Computer Science from the Pontifical Catholic University of Rio de Janeiro where he has an appointment as an associate professor of informatics. He did a post-doc at University of Waterloo in 1992 and was visiting professor at Stanford University in 2012. He is the leading architect and the author of Programming in Lua (ISBN 85-903798-1-7), Programming in Lua, Second Edition (ISBN 85-903798-2-5), Programming in Lua, Third Edition (ISBN 85-903798-5-X) and Programming in Lua, Fourth Edition (ISBN 978-8590379867). He is also responsible for creating a Lua library for implementing parsing expression grammars."
    },
    {
        "name": "Stephen C. Johnson",
        "description": "For the 19th-century New York politician see Stephen C. Johnson (state senator).\nStephen Curtis Johnson is a computer scientist. He spent nearly 20 years at Bell Labs and AT&T where he wrote yacc, lint, spell and the Portable C Compiler.\nJohnson earned his PhD in mathematics but has spent his entire career in computer science. He has worked on topics as diverse as computer music, psychometrics, and VLSI design but he is best known for his work on Unix tools and the first AT&T UNIX port. He also ran the UNIX System V language development department for several years in the mid-1980s. In 1986 he went to Silicon Valley where he was part of a half dozen or so startup companies including Transmeta. In 2002 he joined MathWorks to contribute to the MATLAB programming language.\nJohnson served on the USENIX board for ten years, four of those as president, and is now the USENIX representative to the Computing Research Association.\n\n"
    },
    {
        "name": "Toru Iwatani",
        "description": "Toru Iwatani (岩谷 徹, Iwatani Tōru, born January 25, 1955) is a former Japanese video game designer. He is best known as the creator of the arcade games Pac-Man (1980) and Pole Position (1982)."
    },
    {
        "name": "William Jolitz",
        "description": "William Frederick Jolitz (born February 22, 1957), commonly known as Bill Jolitz, is an American software programmer best known for developing the 386BSD operating system from 1989 to 1994 along with his wife Lynne Jolitz.\nJolitz received his BA in Computer Science from UC Berkeley.\nHe and his wife reside in Los Gatos, California with their children Rebecca, Benjamin and Sarah."
    },
    {
        "name": "Alan Kay",
        "description": "Alan Curtis Kay (born May 17, 1940) is an American computer scientist. He has been elected a Fellow of the American Academy of Arts and Sciences, the National Academy of Engineering, and the Royal Society of Arts. He is best known for his pioneering work on object-oriented programming and windowing graphical user interface design.\nHe is the president of the Viewpoints Research Institute, and an Adjunct Professor of Computer Science at the University of California, Los Angeles. He is also on the advisory board of TTI\/Vanguard. Until mid-2005, he was a Senior Fellow at HP Labs, a Visiting Professor at Kyoto University, and an Adjunct Professor at the Massachusetts Institute of Technology (MIT). After 10 years at Xerox PARC, Kay became Atari's chief scientist for three years.\nKay is also a former professional jazz guitarist, composer, and theatrical designer, and an amateur classical pipe organist."
    },
    {
        "name": "Andre LaMothe",
        "description": "To the same page name with diacritics: This is a redirect from a page name that does not have diacritical marks (accents, umlauts, etc.) to essentially the same page name with diacritical marks or a \"List of...\" page anchored to a promising list item name with diacritics.\nThis redirect aids in searches and may be applied (without piping) when the subject page concerns language translation or foreign language equivalents. Other pages that use this redirect should be updated with a direct link to the redirect target (again, without piping)."
    },
    {
        "name": "Andrew Koenig (programmer)",
        "description": "Andrew Richard Koenig (IPA: [ˈkøːnɪç]; born June 1952) is a former AT&T and Bell Labs researcher and programmer. He is the author of C Traps and Pitfalls, co-author (with Barbara Moo) of Accelerated C++ and Ruminations on C++, and his name is associated with argument-dependent name lookup, also known as \"Koenig lookup\". He served as the Project Editor of the ISO\/ANSI standards committee for C++, has authored over 150 papers on C++, and is listed as inventor on four patents. He is also a member of both American Mensa and Triple Nine Society."
    },
    {
        "name": "Brian Kernighan",
        "description": "Brian Wilson Kernighan (\/ˈkɜːrnᵻhæn\/; born January 1, 1942) is a Canadian computer scientist who worked at Bell Labs alongside Unix creators Ken Thompson and Dennis Ritchie and contributed to the development of Unix. He is also coauthor of the AWK and AMPL programming languages. The \"K\" of K&R C and the \"K\" in AWK both stand for \"Kernighan\". Since 2000 Brian Kernighan has been a Professor at the Computer Science Department of Princeton University, where he is also the Undergraduate Department Representative.\nKernighan's name became widely known through co-authorship of the first book on the C programming language with Dennis Ritchie. Kernighan affirmed that he had no part in the design of the C language (\"it's entirely Dennis Ritchie's work\"). He authored many Unix programs, including ditroff.\nIn collaboration with Shen Lin he devised well-known heuristics for two NP-complete optimization problems: graph partitioning and the travelling salesman problem. (In a display of authorial equity, the former is usually called the Kernighan–Lin algorithm, while the latter is styled Lin–Kernighan.)\nKernighan was the software editor for Prentice Hall International. His \"Software Tools\" series spread the essence of \"C\/Unix thinking\" with makeovers for BASIC, FORTRAN, and Pascal, and most notably his \"Ratfor\" (rational FORTRAN) was put in the public domain.\nHe has said that if stranded on an island with only one programming language it would have to be C.\nKernighan coined the term Unix and helped popularize Thompson's Unix philosophy. Kernighan is also known as a coiner of the expression \"What You See Is All You Get\" (WYSIAYG), which is a sarcastic variant of the original \"What You See Is What You Get\" (WYSIWYG). Kernighan's term is used to indicate that WYSIWYG systems might throw away information in a document that could be useful in other contexts.\nKernighan's original 1978 implementation of Hello, World! was sold at The Algorithm Auction, the world’s first auction of computer algorithms."
    },
    {
        "name": "Butler Lampson",
        "description": "Butler W. Lampson (born December 23, 1943) is an American computer scientist contributing to the development and implementation of distributed, personal computing. He is a Technical Fellow at Microsoft and an adjunct professor at MIT.\n\n"
    },
    {
        "name": "Chris Lattner",
        "description": "Chris Lattner (born 1978) is an American software developer, best known as the main author of LLVM and related projects, such as the compiler Clang and the programming language Swift. As of 2016, he works at Apple Inc., as Director of the Developer Tools department, leading the Xcode, Instruments, and compiler teams."
    },
    {
        "name": "Donald E. Knuth",
        "description": ""
    },
    {
        "name": "Gary Kildall",
        "description": "Gary Arlen Kildall (May 19, 1942 – July 11, 1994) was an American computer scientist and microcomputer entrepreneur who created the CP\/M operating system and founded Digital Research, Inc. (DRI). Kildall was one of the first people to see microprocessors as fully capable computers rather than equipment controllers and to organize a company around this concept. He also co-hosted the PBS TV show The Computer Chronicles. Although his career in computing spanned more than two decades, he is mainly remembered in connection with IBM's unsuccessful attempt in 1980 to license CP\/M for the IBM PC.\n\n"
    },
    {
        "name": "Jim Knopf",
        "description": "Jim Knopf, nicknamed Jim Button (\"Knopf\" meaning \"button\" in German) (October 20, 1942 – October 1, 2013), is considered by many to be one of the \"fathers\" of shareware (so named by fellow software veteran Peter Norton). As an IBM employee, he wrote a program to help with a local church congregation. When demand for his program consumed too much of his time, he quit IBM and created Buttonware. He released his first program, PC-File (a flat file database), in late 1982 as \"user supported software\". He has been quoted as saying this expression not only reflected the optional payment model, but also that comments from users drove the development of later releases.\nHe collaborated with PC-Talk (communications software) developer Andrew Fluegelman to adopt similar names (PC-File was originally \"Easy-File\"), and prices, for their initial shareware offerings; they also agreed to mention each other's products in their program's documentation. Fluegelman referred to this distribution method as \"freeware\".\nA few months later (early 1983), Bob Wallace followed suit, coining the term \"shareware\" for his similarly marketed product, PC-Write, a word processor.\nAs of 2007, of the three founders of shareware, Knopf was the only one still alive, despite having a near-death experience in 1992, when his heart stopped beating briefly while experiencing a heart attack. Shortly thereafter, he sold all his business assets and retired to the Pacific Northwest. He died on October 1, 2013, after suffering for several years from heart disease and Crohn's disease."
    },
    {
        "name": "John George Kemeny",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name.\nFrom a longer title: This is a redirect from a title that is a complete, more complete or longer version of the name of a person, organization, legislative act, etc. It leads to the title in accordance with the naming conventions for common names and can help writing and searches. However, do not replace these redirected links with a piped link unless the page is updated for another reason."
    },
    {
        "name": "Leslie Lamport",
        "description": "Leslie B. Lamport (born February 7, 1941) is an American computer scientist. Lamport is best known for his seminal work in distributed systems and as the initial developer of the document preparation system LaTeX. Leslie Lamport was the winner of the 2013 Turing Award for imposing clear, well-defined coherence on the seemingly chaotic behavior of distributed computing systems, in which several autonomous computers communicate with each other by passing messages. He devised important algorithms and developed formal modeling and verification protocols that improve the quality of real distributed systems. These contributions have resulted in improved correctness, performance, and reliability of computer systems.\n\n"
    },
    {
        "name": "Mel Kaye",
        "description": ""
    },
    {
        "name": "Phil Katz",
        "description": "Phillip Walter Katz (November 3, 1962 – April 14, 2000) was a computer programmer best known as the co-creator of the Zip file format for data compression, and the author of PKZIP, a program for creating zip files that ran under DOS. A copyright lawsuit between System Enhancement Associates and Katz's company, PKWARE, Inc., was widely publicized in the BBS community in the late 1980s. Phil Katz's software business was very successful, but he struggled with social isolation and chronic alcoholism in the last years of his life."
    },
    {
        "name": "Rasmus Lerdorf",
        "description": "Rasmus Lerdorf (born 22 November 1968) is a Greenlandic-Danish programmer. He created the PHP scripting language, authoring the first two versions of the language and participated in the development of later versions led by a group of developers including Jim Winstead (who later created blo.gs), Stig Bakken, Shane Caraveo, Andi Gutmans, and Zeev Suraski. He continues to contribute to the project."
    },
    {
        "name": "Richard H. Lathwell",
        "description": "Richard Henry Lathwell was the 1973 recipient (with Larry Breed and Roger Moore) of the Grace Murray Hopper Award from the Association for Computing Machinery.\n\"For their work in the design and implementation of APL\/360, setting new standards in simplicity, efficiency, reliability and response time for interactive systems.\""
    },
    {
        "name": "Sam Lantinga",
        "description": "Sam Oscar Lantinga is a computer programmer. He used to be the lead software engineer at Blizzard Entertainment, where he was known to the community as Slouken. He is best known as the creator of the Simple DirectMedia Layer, a very popular open source multimedia programming library, and also developed the compatibility database for Executor, a proprietary Mac OS emulator.\nHe was the lead programmer and a co-founder of the now-defunct Loki Software, which ported several game titles to Linux. A Linux client of World of Warcraft was developed, and negotiations with Linux Game Publishing were under way until Blizzard cancelled the project. It is unknown if Lantinga was involved with this port.\nHe also founded Galaxy Gameworks in 2008 to help commercially support the Simple DirectMedia Layer. He left Blizzard Entertainment to \"relax, spend time with family, and explore some ideas to expand the Galaxy Gameworks business.\" Soon after he launched a new website for Gameworks including an extensive list of developer testimonials. Lantinga went on to work for 38 Studios, which shut down in May 2012. Lantinga is currently employed at Valve Corporation."
    },
    {
        "name": "Samuel J Leffler",
        "description": "Samuel J Leffler is a computer scientist, known for his extensive work on BSD, from the 1980s to FreeBSD in the present day. Among other projects, he created FlexFAX, libtiff, and the FreeBSD Wireless Device Drivers.\nThe Design and Implementation series of books, which he co-authored, are regarded as very high quality works in computer science. They have been strongly influential in the development of the BSD descendants and have contributed to their cohesive and well-thought-out nature.\nWhile working for the Computer Systems Research Group (CSRG) at University of California, Berkeley, Mr. Leffler helped with 4.1 and 4.2 BSD release. He has contributed to almost every aspect of BSD systems, including the networking subsystem. After leaving Computer Systems Research Group, Mr. Leffler also worked at Lucasfilm, Pixar, Silicon Graphics, and VMware. Later he became an independent consultant on system design.\n\n"
    },
    {
        "name": "Stan Kelly-Bootle",
        "description": "Stanley Bootle, known as Stan Kelly-Bootle (15 September 1929  – 16 April 2014), was a British author, academic, singer-songwriter and computer scientist. He took his stage name Stan Kelly (he was not known as Stan Kelly-Bootle in folk music circles) from the Irish folk song \"Kelly, the boy from Killane\". His best-known song is the \"Liverpool Lullaby\" or \"The Mucky Kid\" which was recorded in 1965 on the Three City Four LP and sung by Marian McKenzie. It was also sung by the Ian Campbell Folk Group on the Contemporary Campbells LP. It was later a song which Judy Collins recorded in 1966 for her album In My Life. Cilla Black recorded it three years later as the B-side to her pop hit \"Conversations\". Kelly-Bootle achieved the first postgraduate degree in computer science in 1954, from the University of Cambridge.\n\n"
    },
    {
        "name": "Tom Knight (scientist)",
        "description": "Tom Knight is an American synthetic biologist and computer engineer, who was formerly a senior research scientist at the MIT Computer Science and Artificial Intelligence Laboratory, a part of the MIT School of Engineering. He now works at the synthetic biology company Ginkgo Bioworks, which he cofounded in 2008."
    },
    {
        "name": "Tom Lane (Open Source Software Developer)",
        "description": ""
    },
    {
        "name": "Ada Lovelace",
        "description": "Augusta Ada King-Noel, Countess of Lovelace (née Byron; 10 December 1815 – 27 November 1852) was an English mathematician and writer, chiefly known for her work on Charles Babbage's early mechanical general-purpose computer, the Analytical Engine. Her notes on the engine include what is recognised as the first algorithm intended to be carried out by a machine. As a result, she is often regarded as the first computer programmer.\nAda Lovelace was the only legitimate child of the poet George, Lord Byron, and his wife Anne Isabella Milbanke (\"Annabella\"), Lady Wentworth. All Byron's other children were born out of wedlock to other women. Byron separated from his wife a month after Ada was born and left England forever four months later, eventually dying of disease in the Greek War of Independence when Ada was eight years old. Her mother remained bitter towards Lord Byron and promoted Ada's interest in mathematics and logic in an effort to prevent her from developing what she saw as the insanity seen in her father, but Ada remained interested in him despite this (and was, upon her eventual death, buried next to him at her request). Often ill, she spent most of her childhood sick. Ada married William King in 1835. King was made Earl of Lovelace in 1838, and she became Countess of Lovelace.\nHer educational and social exploits brought her into contact with scientists such as Andrew Crosse, Sir David Brewster, Charles Wheatstone, Michael Faraday and the author Charles Dickens, which she used to further her education. Ada described her approach as \"poetical science\" and herself as an \"Analyst (& Metaphysician)\".\nWhen she was a teenager, her mathematical talents led her to a long working relationship and friendship with fellow British mathematician Charles Babbage, also known as 'the father of computers', and in particular, Babbage's work on the Analytical Engine. Lovelace first met him in June 1833, through their mutual friend, and her private tutor, Mary Somerville. Between 1842 and 1843, Ada translated an article by Italian military engineer Luigi Menabrea on the engine, which she supplemented with an elaborate set of notes, simply called Notes. These notes contain what many consider to be the first computer program—that is, an algorithm designed to be carried out by a machine. Lovelace's notes are important in the early history of computers. She also developed a vision of the capability of computers to go beyond mere calculating or number-crunching, while many others, including Babbage himself, focused only on those capabilities. Her mindset of \"poetical science\" led her to ask questions about the Analytical Engine (as shown in her notes) examining how individuals and society relate to technology as a collaborative tool.\nShe died of uterine cancer in 1852 at the age of 36."
    },
    {
        "name": "Al Lowe",
        "description": "Al Lowe (born July 24, 1946) is an American video game designer, programmer, and musician who developed several adventure games, mostly for Sierra On-Line. He is best known for creating the Leisure Suit Larry series. He has also worked as a casting director, voice director, writer, director, producer, background photographer, actor and executive producer."
    },
    {
        "name": "Bertrand Meyer",
        "description": "Bertrand Meyer (\/ˈmaɪər\/; French: [mɛjɛʁ]; born 21 November 1950) is a French academic, author, and consultant in the field of computer languages. He created the Eiffel programming language and the idea of design by contract.\n\n"
    },
    {
        "name": "Bob Miner",
        "description": "Robert Nimrod \"Bob\" Miner (December 23, 1941 – November 11, 1994) was an American businessman. He was the co-founder of Oracle Corporation and the producer of Oracle's relational database management system.\nFrom 1977 until 1992, Bob Miner led product design and development for the Oracle relational database management system. In Dec., 1992, he left that role and spun off a small, advanced technology group within Oracle. He was an Oracle board member until Oct., 1993."
    },
    {
        "name": "Craig McClanahan",
        "description": "Craig R. McClanahan is a programmer and original author of the Apache Struts framework for building web applications. He was part of the expert group that defined the servlet 2.2, 2.3 and JSP 1.1, 1.2 specifications. He is also the architect of Tomcat's servlet container Catalina.\n\n"
    },
    {
        "name": "Daniel D. McCracken",
        "description": "Daniel D. McCracken (July 23, 1930 – July 30, 2011) was a computer scientist in the United States. He was a Professor of Computer Sciences at the City College of New York, and the author of over two dozen textbooks on computer programming. His A Guide to Fortran Programming (Wiley, 1961) and its successors were the standard textbooks on that language for over two decades. His books have been translated into fourteen languages."
    },
    {
        "name": "Douglas McIlroy",
        "description": "Malcolm Douglas McIlroy (born 1932) is a mathematician, engineer, and programmer. As of 2007 he is an Adjunct Professor of Computer Science at Dartmouth College. McIlroy is best known for having originally developed Unix pipelines, software componentry and several Unix tools, such as spell, diff, sort, join, graph, speak, and tr.\nHis seminal work on software componentization makes him a pioneer of component-based software engineering and software product line engineering."
    },
    {
        "name": "Gordon Letwin",
        "description": "James Gordon Letwin (born July 2, 1952) is an American software developer and one of the eleven early Microsoft who posed for an iconic staff portrait taken in Albuquerque in 1978.\nPrior to joining Microsoft, he worked for Heathkit, on HDOS and Benton Harbor Basic.\nWhile at Microsoft, Letwin worked on a number of projects. His first project at Microsoft was writing a BASIC compiler. He is most noted for being the lead architect of the OS\/2 operating system on the Microsoft side, with Ed Iacobucci being the lead architect from IBM's side. Letwin contributed much of the design and code for several core components, including the HPFS file system.\nLetwin left Microsoft in 1993 to \"kick back\" with his wife. While at Microsoft he had become a millionaire, with a 2000 TIME article estimating his worth at around $20 million. Since leaving Microsoft, Letwin has donated substantial amounts of money to environmental causes via the Wilburforce Foundation, a charitable foundation created by him and his wife, Rose."
    },
    {
        "name": "Håkon Wium Lie",
        "description": "Håkon Wium Lie (born 1965 in Halden, Norway) is a Norwegian web pioneer, a standards activist, a politician for The Pirate Party of Norway, and, as of 2016, the Chief Technology Officer of Opera Software.\nHe is best known for proposing the concept of Cascading Style Sheets (CSS) while working with Tim Berners-Lee and Robert Cailliau at CERN in 1994."
    },
    {
        "name": "John Mashey",
        "description": "John R. Mashey (born 1946) is a US computer scientist, director and entrepreneur."
    },
    {
        "name": "John McCarthy (computer scientist)",
        "description": "John McCarthy (September 4, 1927 – October 24, 2011) was an American computer scientist and cognitive scientist. McCarthy was one of the founders of the discipline of artificial intelligence. He coined the term \"artificial intelligence\" (AI), developed the Lisp programming language family, significantly influenced the design of the ALGOL programming language, popularized timesharing, and was very influential in the early development of AI.\nMcCarthy received many accolades and honors, such as the Turing Award for his contributions to the topic of AI, the United States National Medal of Science, and the Kyoto Prize."
    },
    {
        "name": "Khaled Mardam-Bey",
        "description": ""
    },
    {
        "name": "Marshall Kirk McKusick",
        "description": "Marshall Kirk McKusick (born January 19, 1954) is a computer scientist, known for his extensive work on BSD, from the 1980s to FreeBSD in the present day. He was president of the USENIX Association from 1990 to 1992 and again from 2002 to 2004, and still serves on the board. He is on the editorial board of ACM Queue Magazine. He is known to friends and colleagues as \"Kirk\".\nMcKusick received his B.S. in electrical engineering from Cornell University, and 2 M.S. degrees (in 1979 and 1980 respectively) and a Ph.D. in computer science from the University of California, Berkeley in 1984.\nMcKusick lives in California with Eric Allman, who was his domestic partner since graduate school and whom he married in October, 2013. McKusick is an avid wine collector and the temperature and vital statistics of his house and wine cellar are available on the web from his homepage.\n\n"
    },
    {
        "name": "Michael Lesk",
        "description": ""
    },
    {
        "name": "Robert Cecil Martin",
        "description": "Robert Cecil Martin (colloquially known as Uncle Bob) is an American software engineer and author. He is a co-author of the Agile Manifesto. He now runs a consulting firm called Uncle Bob Consulting LLC and Clean Coders which hosts videos based on his experiences and books."
    },
    {
        "name": "Robert Love",
        "description": "Robert M. Love (born c. 1981) is an American author, speaker, Google engineer, and open source software developer.\nLove is best known for his contributions to the Linux kernel, with notable work including the preemptive kernel, process scheduler, kernel event layer, virtual memory subsystem, and inotify. At Google, he was a member of the Android team and helped launch the first version of the platform. Love is also active in the GNOME community, working on NetworkManager, GNOME Volume Manager, Project Utopia and Beagle."
    },
    {
        "name": "Scott Meyers",
        "description": "Scott Douglas Meyers (born April 9, 1959) is an American author and software consultant, specializing in the C++ computer programming language. He is known for his Effective C++ book series. During his career, he was a frequent speaker at conferences and trade shows. He holds a Ph.D. in computer science from Brown University and an M.S. in computer science from Stanford University.\nHe conceived and, with Herb Sutter, Andrei Alexandrescu, Dan Saks, and Steve Dewhurst, co-organized and presented the boutique (limited-attendance) conference, The C++ Seminar, which took place three times in 2001-2002. He also conceived and, with Sutter and Alexandrescu, co-organized and presented another boutique conference, C++ and Beyond annually in 2010-2014.\nIn March 2009, Meyers was awarded the Dr. Dobb's Journal Excellence in Programming Award.\nMeyers has expressed opposition to asking programmers to solve design or programming problems during job interviews:\n\n\"I hate anything that asks me to design on the spot. That's asking to demonstrate a skill rarely required on the job in a high-stress environment, where it is difficult for a candidate to accurately prove their abilities. I think it's fundamentally an unfair thing to request of a candidate.\"\n\nIn December 2015, Meyers announced his retirement from the world of C++."
    },
    {
        "name": "Shawn McKenzie",
        "description": "Richard Shawn McKenzie (born February 20, 1971 in Paducah, Kentucky) is an Open Source Software programmer living in Katy, Texas in the Houston, Texas metropolitan area.\nMcKenzie is the founder and developer of the popular open source software, AutoTheme HTML Theme System, and writes other commercial and open source software, mainly in PHP. He spent his early life in various cities of Illinois and teenage years in Salisbury, Maryland before enlisting in the United States Army in 1990."
    },
    {
        "name": "Sid Meier",
        "description": "Sidney K. \"Sid\" Meier (born February 24, 1954) is a Canadian programmer, designer, and producer of several popular strategy video games and simulation video games, most notably the Civilization series. Meier co-founded MicroProse in 1982 with Bill Stealey and is the Director of Creative Development of Firaxis Games, which he co-founded with Jeff Briggs and Brian Reynolds in 1996. He has won several prestigious accolades for his contributions to the video game industry.\n\n"
    },
    {
        "name": "Yukihiro Matsumoto",
        "description": "Yukihiro Matsumoto (まつもとゆきひろ, Matsumoto Yukihiro, a.k.a. Matz, born 14 April 1965) is a Japanese computer scientist and software programmer best known as the chief designer of the Ruby programming language and its reference implementation, Matz's Ruby Interpreter (MRI). His demeanor has brought about a motto in the Ruby community: \"Matz is nice and so we are nice,\" commonly abbreviated as MINASWAN.\nAs of 2011, Matsumoto is the Chief Architect of Ruby at Heroku, an online cloud platform-as-a-service in San Francisco. He is a fellow of Rakuten Institute of Technology, a research and development organisation in Rakuten Inc. He was appointed to the role of technical advisor for VASILY, Inc. starting in June 2014.\n\n"
    },
    {
        "name": "Boyd Munro",
        "description": ""
    },
    {
        "name": "Bram Moolenaar",
        "description": "Bram Moolenaar (born 1961, Lisse) is a Dutch computer programmer and an active member of the Open-source software community. He is the author of Vim, a text editor that is very popular among programmers and power users.\nThe Vim editor started as \"Vi IMitation\" on the Amiga in 1988, but was later relabeled \"Vi IMproved\" and ported to many other platforms. As vi was a popular editor amongst programmers and system administrators, initially there was doubt whether Bram's 'improved' version could achieve the quality and fan following of the original. But since its first release for Unix systems in 1992, Vim has effectively eclipsed the original Vi, having won several awards and has been referred to as one of the most popular text editors.\nBram promotes charity and encourages people to support orphans in Uganda. He pioneered a methodology called charityware through his Vim editor. The software itself is available for free, but it encourages the user to donate to the programmer's favorite charity. A number of other applications have been licensed this way since the inception of this concept.\nOther software tools that Moolenaar has developed include a software build tool written in Python, called A-A-P, which is similar to make, and a programming language called Zimbu which puts an emphasis on readability of programs. Bram is also an assurer for the non-profit certificate authority CAcert, which means that he is eligible to verify the identities of people using the CAcert web of trust model. Amongst all of Moolenaar's contributions to the field of computer science, the Vim editor remains his most prominent and widely used application.\nMoolenaar has been a member of a Dutch Unix user group, NLUUG, which presented him with an award during its 25th anniversary, for his creation of Vim and his contributions to open source software in general.\nAs of October 2012, Moolenaar works at Google, working in the Zürich office since July 2006. He is also the maintainer and release manager of the Vim editor."
    },
    {
        "name": "Charles H. Moore",
        "description": "Charles H. Moore (also known as Chuck Moore) (born 1938) is the inventor of the Forth programming language.\n\n"
    },
    {
        "name": "Cleve Moler",
        "description": "Cleve Barry Moler is an American mathematician and computer programmer specializing in numerical analysis. In the mid to late 1970s, he was one of the authors of LINPACK and EISPACK, Fortran libraries for numerical computing. He invented MATLAB, a numerical computing package, to give his students at the University of New Mexico easy access to these libraries without writing Fortran. In 1984, he co-founded MathWorks with Jack Little to commercialize this program.\nHe received his bachelor's degree from California Institute of Technology in 1961, and a Ph.D. from Stanford University, all in mathematics.\nHe was a professor of mathematics and computer science for almost 20 years at the University of Michigan, Stanford University, and the University of New Mexico. Before joining MathWorks full-time in 1989, he also worked for Intel Hypercube, where he coined the term \"embarrassingly parallel\", and Ardent Computer Corporation. He is also co-author of four textbooks on numerical methods and is a member of the Association for Computing Machinery. He was president of the Society for Industrial and Applied Mathematics 2007-2008.\nHe was elected to the National Academy of Engineering on February 14, 1997. He received an honorary degree from Linköping University, Sweden. He received an honorary degree of Doctor of Mathematics from the University of Waterloo on June 16, 2001. On April 30, 2004, he was appointed Honorary Doctor (doctor technices, honoris causa) at the Technical University of Denmark. In April 2012, the IEEE Computer Society named Cleve the recipient of the 2012 Computer Pioneer Award. In February 2014, IEEE named Cleve the recipient of the 2014 IEEE John von Neumann Medal.\n\n"
    },
    {
        "name": "David A. Moon",
        "description": "David A. Moon is a programmer and computer scientist, known for his work on the Lisp programming language and as one of the creators of the Emacs text editor. Guy L. Steele Jr. and Richard P. Gabriel (1993) name him as a leader of the Common Lisp movement and describe him as \"a seductively powerful thinker, quiet and often insulting, whose arguments are almost impossible to refute\".\nMaclisp, a variant of Lisp developed at the Massachusetts Institute of Technology (MIT) by Richard Greenblatt in the late 1960s, originally ran on the PDP-6 and PDP-10 computers made by Digital Equipment Corporation. In the early 1970s, Moon headed a project at MIT that reimplemented Maclisp on a different kind of computer, the Honeywell 6180 running the Multics operating system. The compiler that he developed, NCOMPLR, became the \"standard against which all other Lisp compilers were measured\". As part of this project, he also wrote what became the standard manual for Maclisp more generally, titled the MacLISP Reference Manual but often called the Moonual.\nMoon was one of the original members of Greenblatt's project to develop the MIT Lisp Machine, beginning in 1974. In 1976, with Steele, he wrote the first (TECO-based) version of the Emacs text editor, and in 1978 with Daniel Weinreb he coauthored the manual for the Lisp Machine, known as the chine nual. With Howard Cannon, he developed Flavors, a system for doing object-oriented programming with multiple inheritance on the Lisp Machine. As part of the Lisp Machine project, he also invented ephemeral garbage collection, an advance that led to the widespread use of continuously-operating garbage collection systems in Lisp more generally.\nWhen Symbolics was founded in 1985 to commercialize the Lisp Machine, he became one of its founders. He continued to develop new hardware and software at Symbolics, and was listed as a Symbolics Fellow in 1989, but left the company in 1990 to join a project to develop a new operating system. He also made important contributions to the standardization of Common Lisp.\nLater, he worked for Apple Computer, where he became one of \"the primary contributors to the language design\" for the Dylan programming language."
    },
    {
        "name": "Ed Oates",
        "description": "Edward A. \"Ed\" Oates (born 1946) is an American businessman. He co-founded Software Development Labs in August 1977 with Larry Ellison, and Bob Miner. Software Development Labs later became Oracle Corporation."
    },
    {
        "name": "Fredrik Neij",
        "description": "Hans Fredrik Lennart Neij (born 27 April 1978) alias TiAMO is the co-founder of The Pirate Bay, and the Swedish Internet service provider and web hosting company PRQ. Neij was one of the defendants in The Pirate Bay Trial which began on 16 February 2009. He and other operators of The Pirate Bay were charged with assisting users in copyright infringing practices. His time during the aforementioned trial has been captured in the documentary film TPB AFK by Simon Klose.\n\n"
    },
    {
        "name": "Graham Nelson",
        "description": "Graham A. Nelson (born 1968) is a British mathematician and poet and the creator of the Inform design system for creating interactive fiction (IF) games. He has also authored several IF games, including the acclaimed Curses (1993) and Jigsaw (1995), using the experience of writing Curses in particular to expand the range of verbs that Inform is capable of understanding. He has been described by The New York Times as \"ornately literate.\"\nNelson is the author of the Inform Designer's Manual, which includes one of the first published works of interactive fiction theory, an essay titled \"The Craft of Adventure\". He has also written several important essays on interactive fiction in the field. He is one of a very small number of individuals (such as Andrew Plotkin) who are celebrated both for their creative and their technical contributions to the homebrew IF scene.\nNelson studied at Selwyn College, Cambridge and Magdalen College, Oxford, before becoming a fellow in pure mathematics at St Anne's College, Oxford. He co-edited Oxford Poetry and in 1997 received an Eric Gregory Award from the Society of Authors for his poetry. As of 2004 he was managing editor of Legenda, the imprint of the Modern Humanities Research Association (MHRA)."
    },
    {
        "name": "Jarkko Oikarinen",
        "description": "Jarkko Oikarinen (born 16 August 1967, in Kuusamo, Finland) is the inventor of the first Internet chat network, called Internet Relay Chat (IRC), where he is known as WiZ.\n\n"
    },
    {
        "name": "Jeff Minter",
        "description": "Jeff 'Yak' Minter (born in 22 April 1962 in Reading) is an independent English video game designer and programmer. He is the founder of software house Llamasoft and has created dozens of games during his career. Minter's games are often arcade style shoot 'em ups. They often contain titular or in-game references demonstrating his fondness of ruminants (llamas, sheep, camels, etc.). Many of his programs also feature something of a psychedelic element, as in some of the earliest \"light synthesizer\" programs including his Trip-a-Tron.\nMinter's works include Neon (2004), a music visualisation program built into the Xbox 360 console, and the video games Gridrunner, Tempest 2000, Space Giraffe (Xbox Live Arcade, 2007 and PC, 2008), and GoatUp (iOS 2011).\n\n"
    },
    {
        "name": "Kristen Nygaard",
        "description": "Kristen Nygaard (27 August 1926 – 10 August 2002) was a Norwegian computer scientist, programming language pioneer and politician. He was born in Oslo and died of a heart attack in 2002."
    },
    {
        "name": "Lou Montulli",
        "description": "Louis J. Montulli II (best known as Lou Montulli) is a programmer who is well known for his work in producing web browsers. In 1991 and 1992, he co-authored a text web browser called Lynx, with Michael Grobe and Charles Rezac, while he was at the University of Kansas. This web browser was one of the first available and is still in use today."
    },
    {
        "name": "Martin Odersky",
        "description": "Martin Odersky (born 5 September 1958) is a German computer scientist and professor of programming methods at École Polytechnique Fédérale de Lausanne (EPFL) in Switzerland. He specializes in code analysis and programming languages. He designed the Scala programming language and Generic Java (and Pizza before) both with others, and built the current generation of javac, the Java compiler. In 2007, he was inducted as a Fellow of the Association for Computing Machinery.\nIn 1989, he received his Ph.D. from ETH Zurich under the supervision of Niklaus Wirth, who is best known as the designer of several programming languages, including Pascal. He did postdoctoral work at IBM and Yale University.\nOn 12 May 2011, Odersky and collaborators launched Typesafe Inc. (renamed Lightbend Inc., February 2016 (2016-02)), a company to provide commercial support, training, and services for Scala, and he currently serves as the chairman and chief architect.\nHe teaches two courses on the massive open online course (MOOC) provider, Coursera, namely Functional Programming Principles in Scala and Functional Program Design in Scala."
    },
    {
        "name": "Matt Mullenweg",
        "description": "Matthew Charles \"Matt\" Mullenweg (born January 11, 1984) is an American online social media entrepreneur and web developer living in San Francisco. He is best known for developing the free and open source web software WordPress, now managed by The WordPress Foundation.\nAfter dropping out of college and working at CNET Networks from 2004 to 2005, Mullenweg quit that job and founded Automattic, the business behind WordPress.com (which provides free WordPress blogs and other services), Akismet, Gravatar, VaultPress, IntenseDebate, Polldaddy, and more."
    },
    {
        "name": "Mike Muuss",
        "description": "Michael John Muuss (October 16, 1958 – November 20, 2000) was the author of the freeware network tool ping.\nA graduate of Johns Hopkins University, Muuss was a senior scientist specializing in geometric solid modeling, ray-tracing, MIMD architectures and digital computer networks at the United States Army Research Laboratory at Aberdeen Proving Ground, Maryland when he died. He wrote a number of software packages (including BRL-CAD) and network tools (including ttcp and the concept of the default route or \"default gateway\") and contributed to many others (including BIND).\nHowever, the thousand-line ping, which he wrote in December 1983 while working at the Ballistic Research Laboratory, is the program for which he is most remembered. Due to its usefulness, ping has been implemented on a large number of operating systems, initially BSD and Unix, but later others including Windows and Mac OS X.\nIn 1993, the USENIX Association gave a Lifetime Achievement Award (Flame) to the Computer Systems Research Group at University of California, Berkeley, honoring 180 individuals, including Muuss, who contributed to the CSRG's 4.4BSD-Lite release.\nMuuss is mentioned in two books, The Cuckoo's Egg (ISBN 0-7434-1146-3) and Cyberpunk: Outlaws and Hackers on the Computer Frontier (ISBN 0-684-81862-0), for his role in tracking down crackers. He also is mentioned in Peter Salus's A Quarter Century of UNIX.\nMuuss died in an automobile collision on Interstate 95 on November 20, 2000. The Michael J. Muuss Research Award, set up by friends and family of Muuss, memorializes him at Johns Hopkins University.\n\n"
    },
    {
        "name": "Oliver Twins",
        "description": "The Oliver Twins are two British brothers, Philip and Andrew Oliver known for their work as video game developers. They began to professionally develop computer games while they were still at school, contributing their first type-in game to a magazine in 1983. They worked with publishers Codemasters for a number of years following their first collaboration Super Robin Hood, most notably creating the Dizzy series of games and many of Codemasters popular Simulator Series. At one point during the 1980s it was reported that 7% of all UK games sales were attributable to the Oliver Twins. In 1990 they founded Interactive Studios which later became Blitz Games Studios. In October 2013 they founded Radiant Worlds, based in Leamington Spa, UK, with long time friend and colleague Richard Smithies.\n\n"
    },
    {
        "name": "Patrick Naughton",
        "description": "Patrick Naughton (born in 1965) is an American software developer, known as one of the creators of the Java programming language and later a high-profile sex offender."
    },
    {
        "name": "Peter Naur",
        "description": "Peter Naur (25 October 1928 – 3 January 2016) was a Danish computer science pioneer and Turing award winner. His last name is the \"N\" in the BNF notation (Backus–Naur form), used in the description of the syntax for most programming languages. He contributed to the creation of the ALGOL 60 programming language.\nHe began his career as an astronomer for which he received his PhD degree in 1957, but his encounter with computers led to a change of profession. From 1959 to 1969, he was employed at Regnecentralen, the Danish computing company, while at the same time giving lectures at the Niels Bohr Institute and the Technical University of Denmark. From 1969 to 1998 Naur was a professor of computer science at University of Copenhagen.\nHis main areas of inquiry were design, structure and performance of computer programs and algorithms. Areas such as software engineering and software architecture have also been pioneered by Naur. In his book Computing: A Human Activity (1992), which is a collection of his contributions to computer science, he rejected the formalist school of programming that views programming as a branch of mathematics. He did not like being associated with the Backus–Naur form (attributed to him by Donald Knuth) and said that he would prefer it to be called the Backus normal form.\nNaur was married to computer scientist Christiane Floyd.\nNaur disliked the very term \"computer science\" and suggested it be called \"datalogy\" or \"data science\". The former term has been adopted in Denmark and in Sweden as datalogi, while the latter term is now used for data analysis (including statistics and databases).\nIn later years he was quite outspoken of the pursuit of science as a whole: Naur can possibly be identified with the empiricist school, that tells that one shall not seek deeper connections between things that manifest themselves in the world, but keep to the observable facts. He has attacked both certain strands of philosophy and psychology from this viewpoint. He was also developing a theory of human thinking which he called \"Synapse-State Theory of Mental Life\".\nNaur won the 2005 ACM A.M. Turing Award for his work on defining the ALGOL 60 programming language. In particular, his role as editor of the influential Report on the Algorithmic Language ALGOL 60 with its pioneering use of BNF was recognized. Naur is the only Dane to have won the Turing Award.\nNaur died on 3 January 2016 after a short illness."
    },
    {
        "name": "Peter Norton",
        "description": "Peter Norton (born November 14, 1943) is an American programmer, software publisher, author, and philanthropist. He is best known for the computer programs and books that bear his name and portrait. Norton sold his PC software business to Symantec Corporation in 1990."
    },
    {
        "name": "Roger Moore (computer scientist)",
        "description": "Roger D. Moore (born November 16, 1939) was the 1973 recipient (with Larry Breed and Richard Lathwell) of the Grace Murray Hopper Award from the Association for Computing Machinery. His award from the ACM was as follows: For their work in the design and implementation of APL\\360, setting new standards in simplicity, efficiency, reliability and response time for interactive systems.\nMoore was a founder of I.P. Sharp Associates and held a senior position in the company for many years. Before this he contributed to the SUBALGOL compiler at Stanford University and wrote the Algol 60 compiler for the Ferranti-Packard 6000 and the ICT 1900. In addition to his work on APL, he was also instrumental in the development of IPSANET, a private packet switching data network."
    },
    {
        "name": "Alexey Pajitnov",
        "description": "Alexey Leonidovich Pajitnov (Russian: Алексе́й Леони́дович Па́житнов, [ɐlʲɪˈksʲej lʲɪɐˈnʲidəvʲɪtɕ ˈpaʐɨtnəf]; Alekséi Leonídovich Pázhitnov; born 14 March 1956) is a Russian video game designer and computer engineer who developed the popular game Tetris while working for the Dorodnitsyn Computing Centre of the Soviet Academy of Sciences, a Soviet government-founded R&D center.\nHe only started to get royalties from his creation in 1996 when he and Henk Rogers formed The Tetris Company.\n\n"
    },
    {
        "name": "Charles Petzold",
        "description": "Charles Petzold (born February 2, 1953, New Brunswick, New Jersey) is an American programmer and technical author on Microsoft Windows applications. He is also a Microsoft Most Valuable Professional and was named one of Microsoft's seven Windows Pioneers."
    },
    {
        "name": "Craig Reynolds (computer graphics)",
        "description": "Craig W. Reynolds (born March 15, 1953), is an artificial life and computer graphics expert, who created the Boids artificial life simulation in 1986. Reynolds worked on the film Tron (1982) as a scene programmer, and on Batman Returns (1992) as part of the video image crew. Reynolds won the 1998 Academy Scientific and Technical Award in recognition of \"his pioneering contributions to the development of three-dimensional computer animation for motion picture production.\" He is the author of the OpenSteer library."
    },
    {
        "name": "Dennis Ritchie",
        "description": "Dennis MacAlistair Ritchie (September 9, 1941 – c. October 12, 2011) was an American computer scientist. He created the C programming language and, with long-time colleague Ken Thompson, the Unix operating system. Ritchie and Thompson received the Turing Award from the ACM in 1983, the Hamming Medal from the IEEE in 1990 and the National Medal of Technology from President Bill Clinton in 1999. Ritchie was the head of Lucent Technologies System Software Research Department when he retired in 2007. He was the \"R\" in K&R C, and commonly known by his username dmr."
    },
    {
        "name": "Eric S. Raymond",
        "description": "Eric Steven Raymond (born December 4, 1957), often referred to as ESR, is an American software developer, author of the widely cited 1997 essay and 1999 book The Cathedral and the Bazaar and other works, and open-source software advocate. He wrote a guidebook for the Roguelike game NetHack. In the 1990s, he edited and updated the Jargon File, currently in print as The New Hacker's Dictionary.\n\n"
    },
    {
        "name": "Hans Reiser",
        "description": "Hans Thomas Reiser (born December 19, 1963) is an American computer programmer, entrepreneur, and convicted murderer. He is the creator of the ReiserFS computer file system, which is contained within the Linux kernel, as well as its attempted successor, Reiser4. In 2004, he founded Namesys, a corporation meant to coordinate the development of both file systems. In April 2008, Reiser was convicted of the first-degree murder of his wife, Nina Reiser, who disappeared in September 2006. He subsequently pleaded guilty to a reduced charge of second-degree murder, as part of a settlement agreement that included disclosing the location of his wife's body, revealed to be in a shallow grave near the couple's home."
    },
    {
        "name": "Jef Raskin",
        "description": "Jef Raskin (March 9, 1943 – February 26, 2005) was an American human–computer interface expert best known for conceiving and starting the Macintosh project for Apple in the late 1970s.\n\n"
    },
    {
        "name": "Jeffrey Peterson",
        "description": "Jeffrey Peterson (born October 11, 1972 in Santa Barbara, California) is an American technology entrepreneur and California born millionaire who is considered the pioneer of Hispanic internet in the United States. He is best known as the founder of Quepasa, one of the most popular Latin American online communities. In 2012, Quepasa changed its corporate name to MeetMe and continued trading on the Nasdaq Stock Market under ticker symbol MEET. As of late 2016, MeetMe had a market value of about U.S. $250 million."
    },
    {
        "name": "John Ousterhout",
        "description": "John Kenneth Ousterhout (\/ˈoʊstərhaʊt\/, born October 15, 1954) is the chairman of Electric Cloud, Inc. and a professor of computer science at Stanford University. He founded Electric Cloud with John Graham-Cumming. Ousterhout was a professor of computer science at University of California, Berkeley where he created the Tcl scripting language and the Tk platform-independent widget toolkit, and proposed the idea of coscheduling. Ousterhout also led the research group that designed the experimental Sprite operating system and the first log-structured file system. Ousterhout is the author of the Magic VLSI Computer-aided design program.\nHe received his Bachelor's degree in Physics from Yale University in 1975, and his Ph.D. in computer science from Carnegie Mellon University in 1980.\nOusterhout received the Grace Murray Hopper Award in 1987 for his work on CAD systems for very-large-scale integrated circuits. For the same work, he was inducted in 1994 as a Fellow of the Association for Computing Machinery. Ousterhout is a member of the National Academy of Engineering.\nIn 1994, Ousterhout left Berkeley to join Sun Microsystems Laboratories, which hired a team to join him in Tcl development. After several years at Sun, he left and co-founded Scriptics, Inc. (later renamed Ajuba Solutions) in January 1998 to provide professional Tcl development tools. Most of the Tcl team followed him from Sun. Ajuba was purchased by Interwoven in October 2000. He joined the faculty of Stanford University in 2008."
    },
    {
        "name": "John Resig",
        "description": "John Resig is an American software engineer and entrepreneur, best known as the creator and lead developer of the jQuery JavaScript library.\n\n"
    },
    {
        "name": "Keith Packard",
        "description": "Keith Packard (born April 16, 1963) is a software developer, best known for his work on the X Window System.\nPackard is responsible for many X extensions and technical papers on X. He has been heavily involved in the development of X since the late 1980s as a member of the MIT X Consortium, XFree86 and the X.Org Foundation.\nIn 2011, O'Reilly awarded an open source award to Packard, as \"the person behind most of the improvements made on the open source desktop in the last ten years at least.\""
    },
    {
        "name": "Kent Pitman",
        "description": "Kent M. Pitman is the President of HyperMeta, Inc. and has been involved for many years in the design, implementation and use of Lisp and Scheme systems. He is sometimes known by his initials KMP.\nKent Pitman is the author of the Common Lisp Condition System  as well as of numerous papers on Lisp programming and computer programming in general.\nWhile in high school, he saw output from one of the \"guess the animal\" pseudo-artificial intelligence games then popular. He considered implementing a version of the program in BASIC, but once at MIT, he instead implemented it in several dialects of Lisp, including Maclisp.\nHe was a technical contributor to X3J13, the ANSI subcommittee that standardized Common Lisp and contributed to the design of the programming language. He prepared the document that became ANSI Common Lisp, the Common Lisp HyperSpec (a hypertext conversion of the standard), and the document that became ISO ISLISP. He can often be found on the Usenet newsgroup comp.lang.lisp,  where he is involved in discussions about Lisp and computer programming, but also an insider's perspective on Lisp's evolution and Common Lisp's standardization. In some posts there, he has expressed his opinion on open-source software, including open source implementations of Lisp and Scheme, as something that should be judged individually on its essential merits, rather than automatically considered good merely by the fact of being free or open.\n\n"
    },
    {
        "name": "Larry Page",
        "description": "Lawrence \"Larry\" Page (born March 26, 1973) is an American computer scientist and an Internet entrepreneur who co-founded Google Inc. with Sergey Brin in 1998.\nPage is the chief executive officer (CEO) of Google's parent company, Alphabet Inc. After stepping aside as Google CEO in August 2001 in favour of Eric Schmidt, he re-assumed the role in April 2011. He announced his intention to step aside a second time in July 2015 to become CEO of Alphabet, under which Google's assets would be reorganized. Under Page, Alphabet is seeking to deliver major advancements in a variety of industries.\nIn November 2016, he is the 12th richest person in the world, with an estimated net worth of US$36.9 billion.\nPage is the inventor of PageRank, Google's best-known search ranking algorithm. Page received the Marconi Prize in 2004."
    },
    {
        "name": "Markus Persson",
        "description": "Markus Alexej Persson (born 1 June 1979), also known as Notch or xNotch, is a Swedish video game programmer and designer who founded the video game company Mojang alongside Carl Manneh and Jakob Porser in late 2010.\nPersson's principal venture for founding Mojang was Minecraft, a first-person sandbox video game that has gained popularity and support since its tech demo in 2009. Since the release of Minecraft, Persson has gained significant notability within the video game industry, having won multiple awards and establishing relations with the industry's figureheads. Persson retained his position as the lead designer of Minecraft until the game's official launch in 2011, after which he transferred creative authority to Jens Bergensten. In November 2014, he left Mojang after its acquisition by Microsoft."
    },
    {
        "name": "Onel de Guzman",
        "description": ""
    },
    {
        "name": "Petr Mitrichev",
        "description": "Petr Mitrichev (born 19 March 1985) is a Russian competitive programmer who has won multiple major international competitions. His accomplishments include gold (2000, 2002) and silver (2001) medals in the IOI, gold medals (2003, 2005) in the ACM ICPC World Finals as part of the team of Moscow State University and winning Google Code Jam (2006), the TopCoder Open (2006, 2013, 2015), the TopCoder Collegiate Challenge (2006, 2007), Facebook Hacker Cup (2011, 2013) as well as numerous national and online contests. He has achieved the highest rating ever among the Algorithm competitors of TopCoder.com and consistently ranks in the top two of the world. He is the highest rated Algorithm coder on Topcoder ratings List of users in order of rating as of April 6, 2015. He currently works at Google, where he works on the search engine and helps to prepare Code Jam.\n\n"
    },
    {
        "name": "Rob Pike",
        "description": "Robert \"Rob\" Pike (born 1956) is a Canadian programmer and author. He is best known for his work at Bell Labs, where he was a member of the Unix team and was involved in the creation of the Plan 9 from Bell Labs and Inferno operating systems, as well as the Limbo programming language.\nHe also co-developed the Blit graphical terminal for Unix; before that he wrote the first window system for Unix in 1981. Pike is the sole inventor named in AT&T's US patent 4,555,775 or \"backing store patent\" that is part of the X graphic system protocol and one of the first software patents.\nOver the years Pike has written many text editors; sam and acme are the most well known and are still in active use and development.\nPike, with Brian Kernighan, is the co-author of The Practice of Programming and The Unix Programming Environment. With Ken Thompson he is the co-creator of UTF-8. Pike also developed lesser systems such as the vismon program for displaying images of faces of email authors.\nPike also appeared once on Late Night with David Letterman, as a technical assistant to the comedy duo Penn & Teller.\nPike is married to Renée French, and currently works for Google, where he is involved in the creation of the programming languages Go and Sawzall."
    },
    {
        "name": "Seymour Papert",
        "description": "Seymour Aubrey Papert (February 29, 1928 – July 31, 2016) was a South African-born American mathematician, computer scientist, and educator, who spent most of his career teaching and researching at MIT. He was one of the pioneers of artificial intelligence, and of the constructionist movement in education. He was co-inventor, with Wally Feurzeig, of the Logo programming language."
    },
    {
        "name": "Theo de Raadt",
        "description": "Theo de Raadt (\/ˈθiː.oʊ dɛˈrɔːt\/; Dutch: [ˈteː.joː dəˈraːt]; born May 19, 1968) is a software engineer who lives in Calgary, Alberta, Canada. He is the founder and leader of the OpenBSD and OpenSSH projects, and was also a founding member of the NetBSD project.\n\n"
    },
    {
        "name": "Tim Paterson",
        "description": "Tim Paterson (born 1956) is an American computer programmer, best known for creating 86-DOS, an operating system for the Intel 8086. This system emulated the API of CP\/M, which was created by Gary Kildall. 86-DOS later formed the basis of MS-DOS, the most widely used personal computer operating system in the 1980s.\nPaterson was educated in the Seattle Public Schools, graduating from Ingraham High School in 1974. He attended the University of Washington, working as a repair technician for The Retail Computer Store in the Green Lake area of Seattle, Washington, and graduated magna cum laude with a degree in Computer Science in June 1978. He went to work for Seattle Computer Products as a designer and engineer. He designed the hardware of Microsoft's Z-80 SoftCard which had a Z80 CPU and ran the CP\/M operating system on an Apple II.\nA month later, Intel released the 8086 CPU, and Paterson went to work designing an S-100 8086 board, which went to market in November 1979. The only commercial software that existed for the board was Microsoft's Standalone Disk BASIC-86. The standard CP\/M operating system at the time was not available for this CPU and without a true operating system, sales were slow. Paterson began work on QDOS (Quick and Dirty Operating System) in April 1980 to fill that void, copying the APIs of CP\/M from sources including the published CP\/M manual so that it would be highly compatible. QDOS was soon renamed as 86-DOS. Version 0.10 was complete by July 1980. By version 1.14 86-DOS had grown to 4,000 lines of assembly code. In December 1980 Microsoft secured the rights to market 86-DOS to other hardware manufacturers.\nWhile acknowledging that he made 86-DOS compatible with CP\/M, Paterson has maintained that the 86-DOS program was his original work and has denied allegations that he referred to CP\/M code while writing it. When a book appeared in 2004 claiming that 86-DOS was an unoriginal \"rip-off\" of CP\/M, Paterson sued the authors and publishers for defamation. The judge found that Paterson failed to 'provide any evidence regarding \"serious doubts\" about the accuracy of the Gary Kildall chapter. Instead, a careful review of the Lefer notes ... provides a research picture tellingly close to the substance of the final chapter' and the case was dismissed on the basis that the book's claims were constitutionally protected opinions and not provably false.\nPaterson left SCP in April 1981 and worked for Microsoft from May 1981 to April 1982. After a brief second stint with SCP, Paterson started his own company, Falcon Technology (aka Falcon Systems). In 1983, Microsoft contracted Paterson to port MS-DOS to the MSX computers standard they were developing with ASCII. Paterson accepted the contract to help fund his company and completed the work on the MSX-DOS operating system in 1984. Falcon Technology was bought by Microsoft in 1986 to reclaim royalty-free licenses to MS-DOS, eventually becoming part of Phoenix Technologies. Paterson did a second stint with Microsoft from 1986 to 1988, and a third stint from 1990 to 1998, during which time he worked on Visual Basic.\nAfter leaving Microsoft a third time, Paterson founded another software development company, Paterson Technology, and also made several appearances on the Comedy Central television program Battlebots. Paterson has also raced rally cars in the SCCA Pro Rally series, and even engineered his own trip computer which he integrated into the axle of a four-wheel drive Porsche 911."
    },
    {
        "name": "Aaron Swartz",
        "description": "Aaron Hillel Swartz (November 8, 1986 – January 11, 2013) was an American computer programmer, entrepreneur, writer, political organizer, and Internet hacktivist. He was involved in the development of the web feed format RSS and the Markdown publishing format, the organization Creative Commons, the website framework web.py, and the social news site Reddit, in which he became a partner after its merger with his company, Infogami.\nSwartz's work also focused on civic awareness and activism. He helped launch the Progressive Change Campaign Committee in 2009 to learn more about effective online activism. In 2010, he became a research fellow at Harvard University's Safra Research Lab on Institutional Corruption, directed by Lawrence Lessig. He founded the online group Demand Progress, known for its campaign against the Stop Online Piracy Act.\nOn January 6, 2011, Swartz was arrested by MIT police on state breaking-and-entering charges, after connecting a computer to the MIT network in an unmarked and unlocked closet, and setting it to download academic journal articles systematically from JSTOR using a guest user account issued to him by MIT. Federal prosecutors later charged him with two counts of wire fraud and eleven violations of the Computer Fraud and Abuse Act, carrying a cumulative maximum penalty of $1 million in fines, 35 years in prison, asset forfeiture, restitution, and supervised release.\nHe committed suicide while under federal indictment for his alleged computer crimes. Swartz declined a plea bargain under which he would have served six months in federal prison. Two days after the prosecution rejected a counter-offer by Swartz, he was found dead in his Brooklyn apartment, where he had hanged himself.\nIn June 2013, Swartz was inducted posthumously into the Internet Hall of Fame."
    },
    {
        "name": "Adi Shamir",
        "description": "Adi Shamir (Hebrew: עדי שמיר‎‎; born July 6, 1952) is an Israeli cryptographer. He is a co-inventor of the RSA algorithm (along with Ron Rivest and Len Adleman), a co-inventor of the Feige–Fiat–Shamir identification scheme (along with Uriel Feige and Amos Fiat), one of the inventors of differential cryptanalysis and has made numerous contributions to the fields of cryptography and computer science."
    },
    {
        "name": "Bill Schelter",
        "description": "William Frederick Schelter (1947 – July 30, 2001) was a professor of mathematics at The University of Texas at Austin and a Lisp developer and programmer. Schelter is credited with the development of the GNU Common Lisp (GCL) implementation of Common Lisp and the GPL'd version of the computer algebra system Macsyma called Maxima. Schelter authored Austin Kyoto Common Lisp (AKCL) under contract with IBM. AKCL formed the foundation for Axiom, another computer algebra system. AKCL eventually became GNU Common Lisp. He is also credited with the first port of the GNU C compiler to the Intel 386 architecture, used in the original implementation of the Linux kernel.\nSchelter obtained his Ph.D. at McGill University in 1972. His mathematical specialties were noncommutative ring theory and computational algebra and its applications, including automated theorem proving in geometry.\nIn the summer of 2001, age 54, he died suddenly of a heart attack while traveling in Russia.\n\n"
    },
    {
        "name": "Blake Ross",
        "description": "Blake Aaron Ross (born June 12, 1985) is an American software engineer who is best known for his work as the co-creator of the Mozilla Firefox internet browser with Dave Hyatt. In 2005, he was nominated for Wired magazine's top Rave Award, Renegade of the Year, opposite Larry Page, Sergey Brin and Jon Stewart. He was also a part of Rolling Stone magazine's 2005 hot list. From 2007, he worked for Facebook as Director of Product until resigning in early 2013. In 2015, he wrote a fan fiction original screenplay to the HBO television comedy series Silicon Valley, which gained attention."
    },
    {
        "name": "Bob Sabiston",
        "description": "Bob Sabiston (born 1967) is an American film art director, computer programmer, and creator of the Rotoshop software program for computer animation. Sabiston began developing software as an undergraduate and then graduate researcher in the MIT Media Lab from 1986 to 1991. While at MIT, and also after moving to Austin, Texas, in 1993, Sabiston used his 2D\/3D software to create several short films, including God's Little Monkey (1994), \"Beat Dedication\" (1988), and \"Grinning Evil Death\" (1990). \"Grinning Evil Death\" was widely seen on the first episode of MTV's \"Liquid Television\" show. \"God's Little Monkey\" won the Prix Ars Electronica Golden Nica award for 1994.\nIn 1997, he developed his interpolating rotoscope program, Rotoshop, for an animation contest sponsored by MTV. The software was used to produce a series of 25 30-second interstitials in New York, collectively entitled \"Project Incognito.\" He moved back to Austin in 1998 and with the help of local artists made the short film \"RoadHead.\" This was followed in 1999 by short \"Snack and Drink\" in collaboration with Tommy Pallotta. \"Snack and Drink\" won several film festival awards and resides in the MOMA video collection. The shorts collection \"Figures of Speech\" followed in late 1999, for PBS. In 2000, Sabiston hired thirty graphic artists in the Austin area to help make Richard Linklater's film Waking Life.\nAfter Waking Life Sabiston spent several years making more rotoscoped short films, including \"Yard\", \"Earthlink Sucks\", \"Grasshopper\". He directed a series of shorts for the PBS show \"Life360\". In 2003 he directed a short segment for the Lars von Trier film The Five Obstructions. Both \"Grasshopper\" and \"The Five Obstructions\" were shown at the Sundance Film Festival in 2004.\nIn 2004 Sabiston was hired as Head of Animation for Richard Linklater's A Scanner Darkly. He modified the software substantially for the film. Since 2005 he has also directed the \"Talk to Chuck\" campaign of animated advertisements for Charles Schwab.\nSabiston developed Rotoshop as a means to make rotoscoping easier for artists by automating the interpolation of hand-drawn shapes and lines over video. The software is proprietary and currently not available for use outside of Sabiston's production company, Flat Black Films.\nSabiston is also the creator of Inchworm Animation, a paint and animation program for the Nintendo DSi. It was released on April 25, 2011 in North America and subsequently in Europe, Australia, and Japan. A follow-up successor to the app, Butterfly: Inchworm Animation II was announced in October 2016 for the Nintendo 3DS. It was released the same month via the North American Nintendo eShop. A European and Japanese release is set to follow suit. The new app supports new raster and animation tools, sounds effects, and has native online sharing functions.\nSince 2008 Sabiston has developed several apps for iOS: the 3d mind-mapping app \"Headspace\", the modeling\/3d-printing app \"Voxel\", the videogame \"Retroid\", and a drawing keyboard \"Jot Keyboard\". In 2015 he released \"Lowlander\", a tribute to Richard Garriott's classic videogame \"Ultima II\"."
    },
    {
        "name": "Bob Scheifler",
        "description": "Robert William Scheifler (born June 24, 1954, Kirkwood, Missouri) is an American computer scientist. He is most notable for leading the development of the X Window System from the project's inception in 1984 until the closure of the MIT X Consortium in 1996.  He later became one of the architects of the Jini architecture at Sun Microsystems.\nBob has stated that his goal in developing the X Window System was to raise the floor in windowing systems for the entire market, and despite its early adoption primarily by commercial players with proprietary extensions, X ended up as a standard, open system. X is an important part of Linux to this day.\nScheifler holds a B.S. in Mathematics and an M.S. in computer science from the Massachusetts Institute of Technology."
    },
    {
        "name": "Carl Sassenrath",
        "description": "Carl Sassenrath (born 1957 in California) is an architect of operating systems and computer languages. He brought multitasking to personal computers in 1985 with the creation of the Amiga Computer operating system kernel, and he is currently the designer of the REBOL computer language as well as the CTO of REBOL Technologies.\n\n"
    },
    {
        "name": "Chris Sawyer",
        "description": "Chris Sawyer is a Scottish video game designer and programmer who is best known for creating the Transport Tycoon and RollerCoaster Tycoon series. He was also the founder of 31X, a mobile game development company."
    },
    {
        "name": "Cliff Shaw",
        "description": "John Clifford Shaw (1922–1991) was a systems programmer at the RAND Corporation. He is a coauthor of the first artificial intelligence program, the Logic Theorist, and was one of the developers of Information Processing Language, a programming language of the 1950s. It is considered the true \"father\" of the JOSS language. One of the most significant events that occurred in the programming was the development of the concept of list processing by Allen Newell, Herbert A. Simon and Cliff Shaw during the development of the language IPL-V. He invented the linked list, on which almost all of computer technology now depends."
    },
    {
        "name": "Guido van Rossum",
        "description": "Guido van Rossum (Dutch pronunciation: [ˈɣido vɑn ˈrɔsʏm, -səm], born 31 January 1956) is a Dutch programmer who is best known as the author of the Python programming language. In the Python community, Van Rossum is known as a \"Benevolent Dictator For Life\" (BDFL), meaning that he continues to oversee the Python development process, making decisions where necessary. He was employed by Google from 2005 until 7 December 2012, where he spent half his time developing the Python language. In January 2013, Van Rossum started working for Dropbox."
    },
    {
        "name": "Jeff Rulifson",
        "description": "Johns Frederick (Jeff) Rulifson (born August 20, 1941) is an American computer scientist."
    },
    {
        "name": "John Romero",
        "description": "Alfonso John Romero (born October 28, 1967) is an American director, designer, programmer, and developer in the video game industry. He is best known as a co-founder of id Software and designer for many of their games, including Wolfenstein 3D, Dangerous Dave, Hexen, Doom and Quake. His game designs and development tools, along with new programming techniques created and implemented by id Software's lead programmer John D. Carmack, led to a mass popularization of the first person shooter, or FPS, in the 1990s. He is credited with coining the FPS multiplayer term \"deathmatch\"."
    },
    {
        "name": "Mark Russinovich",
        "description": "Mark Eugene Russinovich (born c. 1966) is CTO of Microsoft Azure. He was a cofounder of software producers Winternals before it was acquired by Microsoft in 2006."
    },
    {
        "name": "Mike Shaver",
        "description": "Mike Shaver (born February 17, 1977 in Grande Prairie, Alberta, Canada) is an Engineering Director at Facebook. He is also known for his work on several open source projects. He has been involved in the development of many of the technologies that enable interactive web pages, such as the JavaScript language.\nShaver attended high school at Lisgar Collegiate Institute in Ottawa, where he began working with Ingenia Communications Corporation, an Ottawa-area computer consultancy that later dissolved. His efforts saw him rise from a summer student who worked as a system administrator and software developer to chief systems architect and eventually Chief technical officer. Shaver eventually left to work at Netscape Communications and later zerøknowledge, Cluster File Systems, and the Oracle Corporation. Beginning as a visiting developer, he quickly rose through the ranks and eventually gained Internet fame by becoming a founding member of the Mozilla Organization in 1998.\nHe served as VP of Engineering and VP of Technical Strategy for the Mozilla Corporation where he helped people understand, build, and benefit from an open Web.\nHe was also at the center of the \"ten fucking days\" imbroglio wherein he wrote on his business card \"ten fucking days\" referencing a recent ten-day turnaround for a security flaw from notification to releasing a fixed version of Firefox. His intent was to show confidence in Mozilla's ability to quickly address security issues, but it was misunderstood as a general or official Mozilla policy."
    },
    {
        "name": "Muni Sakya",
        "description": "Muni Sakya is a Nepalese computer programmer credited with helping to usher in information technology in Nepal. He's also known for designing computer systems that can be operated in the Nepali language."
    },
    {
        "name": "Randal L. Schwartz",
        "description": "Randal L. Schwartz (born November 22, 1961), also known as merlyn, is an American author, system administrator and programming consultant.\nHe is known for his expertise in the Perl programming language, his promotional role within the Perl community, as a co-host of FLOSS Weekly, and for a controversial felony conviction resulting from State of Oregon vs. Randal Schwartz, later officially expunged.\n\n"
    },
    {
        "name": "Ron Rivest",
        "description": "Ronald Linn Rivest (\/rɪˈvɛst\/; born May 6, 1947) is a cryptographer and an Institute Professor at MIT. He is a member of MIT's Department of Electrical Engineering and Computer Science (EECS) and a member of MIT's Computer Science and Artificial Intelligence Laboratory (CSAIL). He was a member of the Election Assistance Commission's Technical Guidelines Development Committee, tasked with assisting the EAC in drafting the Voluntary Voting System Guidelines.\nRivest is one of the inventors of the RSA algorithm (along with Adi Shamir and Len Adleman). He is the inventor of the symmetric key encryption algorithms RC2, RC4, RC5, and co-inventor of RC6. The \"RC\" stands for \"Rivest Cipher\", or alternatively, \"Ron's Code\". (RC3 was broken at RSA Security during development; similarly, RC1 was never published.) He also authored the MD2, MD4, MD5 and MD6 cryptographic hash functions. In 2006, he published his invention of the ThreeBallot voting system, a voting system that incorporates the ability for the voter to discern that their vote was counted while still protecting their voter privacy. Most importantly, this system does not rely on cryptography at all. Stating \"Our democracy is too important\", he simultaneously placed ThreeBallot in the public domain."
    },
    {
        "name": "Rusty Russell",
        "description": "Rusty Russell is an Australian free software programmer and advocate, known for his work on the Linux kernel's networking subsystem and the Filesystem Hierarchy Standard."
    },
    {
        "name": "Steve Russell (computer scientist)",
        "description": "Steve \"Slug\" Russell (born 1937) is an American computer scientist most famous for creating Spacewar!, one of the earliest video games."
    },
    {
        "name": "Zed Shaw",
        "description": "Zed A. Shaw is a software developer most commonly known for creating the Mongrel web server for Ruby web applications, as well as his articles on technology, business, and technical communities. His most famous and well-covered piece was his article called \"Rails is a Ghetto\" which has since been removed from his site. Zed is also behind an initiative entitled, \"Programming, Motherfucker\" the manifesto for which he claims that his group of programmers are \"tired of being told we're autistic idiots who need to be manipulated to work in a Forced Pair Programming chain gang.\" \n\n"
    },
    {
        "name": "Alexander Stepanov",
        "description": "Alexander Alexandrovich Stepanov (Russian: Алекса́ндр Алекса́ндрович Степа́нов), born November 16, 1950 in Moscow, is a Russian computer programmer, best known as an advocate of generic programming and as the primary designer and implementer of the C++ Standard Template Library, which he started to develop around 1992 while employed at HP Labs. He had earlier been working for Bell Labs close to Andrew Koenig and tried to convince Bjarne Stroustrup to introduce something like Ada generics in C++. He is credited with the notion of concept.\nHe is the author (with Paul McJones) of Elements of Programming, a book that grew out of a \"Foundations of Programming\" course that Stepanov taught at Adobe Systems (while employed there). He is also the author (with Daniel E. Rose) of From Mathematics to Generic Programming.\nHe retired in January 2016 from A9.com."
    },
    {
        "name": "Bjarne Stroustrup",
        "description": "Bjarne Stroustrup (Danish: [ˈbjɑːnə ˈsdʁʌʊ̯ˀsdʁɔb]; born 30 December 1950) is a Danish computer scientist, most notable for the creation and development of the widely used C++ programming language. He is a visiting professor at Columbia University, and works at Morgan Stanley as a Managing Director in New York."
    },
    {
        "name": "Charles Simonyi",
        "description": "Charles Simonyi (Hungarian: Simonyi Károly, pronounced [ˈʃimoɲi ˈkaːroj]; born September 10, 1948), son of Károly Simonyi, is a Hungarian-born American computer programmer, businessman, and space tourist. He was head of Microsoft's application software group, where he oversaw the creation of Microsoft's flagship Office suite of applications. He now heads his own company, Intentional Software, with the aim of developing and marketing his concept of intentional programming. In April 2007, aboard Soyuz TMA-10, he became the fifth space tourist and the second Hungarian in space. In March 2009, aboard Soyuz TMA-14, he made a second trip to the International Space Station. His estimated net worth is US$1.4 billion."
    },
    {
        "name": "Christopher Strachey",
        "description": "Christopher S. Strachey (\/ˈstreɪtʃi\/; 16 November 1916 – 18 May 1975) was a British computer scientist. He was one of the founders of denotational semantics, and a pioneer in programming language design. He was a member of the Strachey family, prominent in government, arts, administration, and academia."
    },
    {
        "name": "Colin Simpson (electronics professor)",
        "description": ""
    },
    {
        "name": "Emily Short",
        "description": "Emily Short is an interactive fiction (IF) writer, perhaps best known for her debut game Galatea and her use of psychologically complex NPCs, or non-player game characters. She has been called \"a visionary in the world of text-based games for years\", and is the author of over thirty-five works of IF in addition to being chief editor of the IF Theory Book.\nShe writes a regular column on IF for Rock, Paper, Shotgun."
    },
    {
        "name": "Gerald Jay Sussman",
        "description": "Gerald Jay Sussman (born February 8, 1947) is the Panasonic Professor of Electrical Engineering at the Massachusetts Institute of Technology (MIT). He received his S.B. and Ph.D. degrees in mathematics from MIT in 1968 and 1973 respectively. He has been involved in artificial intelligence research at MIT since 1964. His research has centered on understanding the problem-solving strategies used by scientists and engineers, with the goals of automating parts of the process and formalizing it to provide more effective methods of science and engineering education. Sussman has also worked in computer languages, in computer architecture and in VLSI design.\n\n"
    },
    {
        "name": "Gottfrid Svartholm",
        "description": "Per Gottfrid Svartholm Warg (born 17 October 1984), alias anakata, is a Swedish computer specialist, known as the former co-owner of the web hosting company PRQ and co-founder of the BitTorrent site The Pirate Bay together with Fredrik Neij and Peter Sunde.\nParts of an interview with Svartholm commenting on the May 2006 police raid of The Pirate Bay are featured in Good Copy Bad Copy and Steal This Film. He is a main focus of the documentary TPB AFK.\nIn May 2013, WikiLeaks revealed Svartholm Warg collaborated with the organization for the 2010 release of Collateral Murder, the helicopter cockpit gunsight video of a July 2007 airstrike by U.S. forces in Baghdad. According to WikiLeaks, Svartholm served as technical consultant and managed infrastructure critical to the organization.\nOn 27 November 2013 he was extradited to Denmark, where he was charged with infiltrating the Danish social security database, driver’s licence database, and the shared IT system used in the Schengen zone. Awaiting his court trial, he was being held in solitary confinement . The court trial ended on 31 October 2014 and he was found guilty by the jury and sentenced to three and a half years in prison. He immediately appealed the sentence, but, fearing that he may try to evade his sentence, the judges ruled that he should be held in confinement until the appeal court trial.\nAfter spending three years in different prisons from Sweden and Denmark, he was eventually released on 29 September 2015 and is ready to get back to work again in IT."
    },
    {
        "name": "Guy Steele",
        "description": ""
    },
    {
        "name": "Henry Spencer",
        "description": "Henry Spencer (born 1955) is a Canadian computer programmer and space enthusiast. He wrote \"regex\", a widely used software library for regular expressions, and co-wrote C News, a Usenet server program. He also wrote The Ten Commandments for C Programmers. He is coauthor, with David Lawrence, of the book Managing Usenet. While working at the University of Toronto he ran the first active Usenet site outside the U.S., starting in 1981. His records from that period were eventually acquired by Google to provide an archive of Usenet in the 1980s.\nThe first international Usenet site was run in Ottawa, in 1981; however, it is generally not remembered, as it served merely as a read-only medium. Later in 1981, Spencer acquired a Usenet feed from Duke University, and brought \"utzoo\" online; the earliest public archives of Usenet date from May 1981 as a result.\nThe small size of Usenet in its youthful days, and Spencer's early involvement, made him a well-recognised participant; this is commemorated in Vernor Vinge's 1992 novel A Fire Upon the Deep. The novel featured an interstellar communications medium remarkably similar to Usenet, down to the author including spurious message headers; one of the characters who appeared solely through postings to this was modeled on Spencer (and, slightly obliquely, named for him).\nHe is also credited with the claim that \"Those who do not understand Unix are condemned to reinvent it, poorly.\""
    },
    {
        "name": "Herb Sutter",
        "description": "Herb Sutter is a prominent C++ expert. He is also a book author and a columnist for Dr. Dobb's Journal. He joined Microsoft in 2002 as a platform evangelist for Visual C++ .NET, rising to lead software architect for C++\/CLI. Sutter served as secretary and convener of the ISO C++ standards committee for over 10 years. In September 2008 he was replaced by P.J. Plauger. He then re-assumed the convener position, after Plauger resigned in October 2009. In recent years Sutter was lead designer for C++\/CX and C++ AMP."
    },
    {
        "name": "Jacek Sieka",
        "description": ""
    },
    {
        "name": "Joel Spolsky",
        "description": "Avram Joel Spolsky (born 1965) is a software engineer and writer. He is the author of Joel on Software, a blog on software development, and the creator of the project management software Trello. He was a Program Manager on the Microsoft Excel team between 1991 and 1994. He later founded Fog Creek Software in 2000 and launched the Joel on Software blog. In 2008, he launched the Stack Overflow programmer Q&A site in collaboration with Jeff Atwood. Using the Stack Exchange software product which powers Stack Overflow, the Stack Exchange Network now hosts over 100 Q&A sites."
    },
    {
        "name": "Ken Silverman",
        "description": "Ken Silverman (born November 1, 1975) is an American game programmer, best known for writing the Build engine used in Duke Nukem 3D, Shadow Warrior, Blood, and more than a dozen other games in the mid- to late-1990s.\nOnce considered the primary rival of John Carmack (later succeeded by Tim Sweeney), Silverman started work on the Build engine sometime before his first semester at Brown University in 1993, under a contract with Apogee Software. In the wake of Duke Nukem 3D and other Build engine games, Silverman left the commercial game industry.\nKen has been CTO and co-founder of Ardfry Imaging, LLC responsible for the PNG Compression tool PNGOUT. Currently, Ken is founder and Chief Computer Scientist at Voxiebox, makers of the Voxiebox holographic 3D arcade game system."
    },
    {
        "name": "Ludvig Strigeus",
        "description": "Ludvig Strigeus (Ludde) is a Swedish programmer, best known for developing software such as the BitTorrent client µTorrent, OpenTTD, and Spotify.\nStrigeus was born in January 1981, and he graduated from Chalmers University of Technology with a Master of Science degree in computer science and engineering. He currently resides in Gothenburg, Sweden, and works as a software engineer at Spotify.\nIn 2005, his development team won PuzzleCrack, a week-long puzzlehunt competition that combines problem-solving with computer hacking. Due to a rare muscular disease, Strigeus uses a wheelchair."
    },
    {
        "name": "Matthew Smith (games programmer)",
        "description": "Matthew Smith (born 1966) is a British computer game programmer. He created the games Manic Miner and Jet Set Willy for the ZX Spectrum, released in 1983 and 1984 respectively.\n\n"
    },
    {
        "name": "Quentin Stafford-Fraser",
        "description": "James Quentin Stafford-Fraser is a computer scientist and entrepreneur based in Cambridge, England. He was one of the team that created the first webcam: the Trojan room coffee pot: Quentin pointed a camera at the coffee pot and wrote the XCoffee client program which allowed the image of the pot to be displayed on a workstation screen. When web browsers gained the ability to display images, the system was modified to make the coffee pot images available over HTTP and thus became the first webcam.\nQuentin wrote the original VNC client (viewer) and server for the Windows operating system, while at the Olivetti Research Laboratory.\nHe is a regular public speaker and his work has attracted significant media coverage.\nQuentin is also a part-time Research Associate at the University of Cambridge Computer Lab [1]. In 2013 he was a member of the winning team on Christmas University Challenge, representing Gonville & Caius College, Cambridge."
    },
    {
        "name": "Rich Skrenta",
        "description": "Richard \"Rich\" Skrenta (born 1967 (age 49–50) in Pittsburgh, Pennsylvania) is a computer programmer and Silicon Valley entrepreneur who created the web search engine blekko."
    },
    {
        "name": "Richard Stallman",
        "description": "Richard Matthew Stallman (born March 16, 1953), often known by his initials, rms, is an American software freedom activist and programmer. He campaigns for software to be distributed in a manner such that its users receive the freedoms to use, study, distribute and modify that software. Software that ensures these freedoms is termed free software. Stallman launched the GNU Project, founded the Free Software Foundation, developed the GNU Compiler Collection and GNU Emacs, and wrote the GNU General Public License.\nStallman launched the GNU Project in September 1983 to create a Unix-like computer operating system composed entirely of free software. With this, he also launched the free software movement. He has been the GNU project's lead architect and organizer, and developed a number of pieces of widely used GNU software including, among others, the GNU Compiler Collection, the GNU Debugger and the GNU Emacs text editor. In October 1985 he founded the Free Software Foundation.\nStallman pioneered the concept of copyleft, which uses the principles of copyright law to preserve the right to use, modify and distribute free software, and is the main author of free software licenses which describe those terms, most notably the GNU General Public License (GPL), the most widely used free software license.\nIn 1989 he co-founded the League for Programming Freedom. Since the mid-1990s, Stallman has spent most of his time advocating for free software, as well as campaigning against software patents, digital rights management, and other legal and technical systems which he sees as taking away users' freedoms. This has included software license agreements, non-disclosure agreements, activation keys, dongles, copy restriction, proprietary formats and binary executables without source code.\nAs of 2016, he has received fifteen honorary doctorates and professorships (see Honors and awards)."
    },
    {
        "name": "Zeev Suraski",
        "description": "Zeev Suraski (Hebrew: זאב סורסקי‎‎ pronounced [zeˈʔev suˈʁaski]) is an Israeli programmer, PHP developer and co-founder of Zend Technologies. A graduate of the Technion in Haifa, Israel, Suraski and Andi Gutmans created PHP 3 in 1997. In 1999 they wrote the Zend Engine, the core of PHP 4, and founded Zend Technologies, which has since overseen PHP advances. The name Zend is a portmanteau of their forenames, Zeev and Andi.\nSuraski is an emeritus member of the Apache Software Foundation, and was nominated for the FSF Award for the Advancement of Free Software in 1999. Zeev Suraski is the CTO for Zend Technologies.\nHe was the lead contributor to PHP since 1997."
    },
    {
        "name": "Alan Turing",
        "description": "Alan Mathison Turing OBE FRS (\/ˈtjʊərɪŋ\/; 23 June 1912 – 7 June 1954) was an English computer scientist, mathematician, logician, cryptanalyst and theoretical biologist. He was highly influential in the development of theoretical computer science, providing a formalisation of the concepts of algorithm and computation with the Turing machine, which can be considered a model of a general purpose computer. Turing is widely considered to be the father of theoretical computer science and artificial intelligence.\nDuring the Second World War, Turing worked for the Government Code and Cypher School (GC&CS) at Bletchley Park, Britain's codebreaking centre. For a time he led Hut 8, the section responsible for German naval cryptanalysis. He devised a number of techniques for speeding the breaking of German ciphers, including improvements to the pre-war Polish bombe method, an electromechanical machine that could find settings for the Enigma machine. Turing played a pivotal role in cracking intercepted coded messages that enabled the Allies to defeat the Nazis in many crucial engagements, including the Battle of the Atlantic; it has been estimated that this work shortened the war in Europe by more than two years and saved over fourteen million lives.\nAfter the war, he worked at the National Physical Laboratory, where he designed the ACE, among the first designs for a stored-program computer. In 1948 Turing joined Max Newman's Computing Machine Laboratory at the Victoria University of Manchester, where he helped develop the Manchester computers and became interested in mathematical biology. He wrote a paper on the chemical basis of morphogenesis, and predicted oscillating chemical reactions such as the Belousov–Zhabotinsky reaction, first observed in the 1960s.\nTuring was prosecuted in 1952 for homosexual acts, when by the Labouchere Amendment, \"gross indecency\" was still criminal in the UK. He accepted chemical castration treatment, with DES, as an alternative to prison. Turing died in 1954, 16 days before his 42nd birthday, from cyanide poisoning. An inquest determined his death as suicide, but it has been noted that the known evidence is also consistent with accidental poisoning. In 2009, following an Internet campaign, British Prime Minister Gordon Brown made an official public apology on behalf of the British government for \"the appalling way he was treated.\" Queen Elizabeth II granted him a posthumous pardon in 2013."
    },
    {
        "name": "Andrew S. Tanenbaum",
        "description": "Andrew Stuart \"Andy\" Tanenbaum (sometimes referred to by the handle ast) (born March 16, 1944) is an American computer scientist and professor emeritus of computer science at the Vrije Universiteit Amsterdam in the Netherlands.\nHe is best known as the author of MINIX, a free Unix-like operating system for teaching purposes, and for his computer science textbooks, regarded as standard texts in the field. He regards his teaching job as his most important work. Since 2004 he has operated Electoral-vote.com, a website dedicated to analysis of polling data in federal elections in the United States."
    },
    {
        "name": "Andrew Tridgell",
        "description": "Andrew \"Tridge\" Tridgell (born 28 February 1967) is an Australian computer programmer. He is the author of and a contributor to the Samba file server, and co-inventor of the rsync algorithm.\nHe has analysed complex proprietary protocols and algorithms, to allow compatible free and open source software implementations.\n\n"
    },
    {
        "name": "Audrey Tang",
        "description": "Audrey Tang (born April 18, 1981; formerly known as Autrijus Tang) is a Taiwanese free software programmer, who has been described as one of the \"ten greats of Taiwanese computing.\" In August 2016, she was invited to join the Taiwan Executive Yuan as a minister without portfolio, making her the first transgender official in the top executive cabinet."
    },
    {
        "name": "Avie Tevanian",
        "description": "Avadis \"Avie\" Tevanian is an American computer scientist. He was senior vice president of software engineering at Apple from 1997 to 2003, and then chief software technology officer from 2003 to 2006. He was a long-standing friend of Steve Jobs.\nTevanian wrote Mac Missiles, a clone for the Macintosh platform of the 1980s arcade game Missile Command. He is of Armenian descent.\nTevanian is from Westbrook, Maine. He has a B.A. in mathematics from the University of Rochester, and M.S. and Ph.D. degrees in computer science from Carnegie Mellon University. In United States v. Microsoft, he was a witness for the United States Department of Justice, testifying against Microsoft.\nTevanian left Apple on March 31, 2006, and joined the board of Dolby Labs. In May 2006, he joined the board of Tellme Networks, which was later sold to Microsoft. On January 12, 2010, he became managing director of Elevation Partners.\n\n"
    },
    {
        "name": "Bob Truel",
        "description": "Bob Truel is a computer programmer. He met Rich Skrenta in ninth grade in Mt. Lebanon, Pennsylvania and has since co-founded several Internet ventures with him and others, including DMOZ with Bryn Dole, Chris Tolles, and Jeremy Wenokur in 1998, Newhoo in 1998, Topix.net with Tom and Michael Markson in 2002, and search engine blekko with Michael Markson in 2007."
    },
    {
        "name": "Bob Wallace",
        "description": "Bob Wallace (May 29, 1949 – September 20, 2002) was the ninth Microsoft employee, first popular user of the term shareware, creator of the word processing program PC-Write, founder of the software company Quicksoft and an \"online drug guru\" who devoted much time and money into the research of psychedelic drugs. Bob was also noted for ending his Usenet posts with the phrase, \"Bob Wallace (just my opinion).\""
    },
    {
        "name": "Jon Stephenson von Tetzchner",
        "description": "Jon Stephenson von Tetzchner or, in Icelandic, Jón (born 29 August 1967 in Reykjavík, Iceland) is an Icelandic programmer and businessman. He founded the company Vivaldi Technologies and launched a community site called Vivaldi.net. Tetzchner is also a co-founder and the former CEO of Opera Software."
    },
    {
        "name": "Ken Thompson (computer programmer)",
        "description": "From currently unnecessary disambiguation: This is a redirect from a page name that has a currently unneeded disambiguation qualifier. Examples are:\nJupiter (planet)Jupiter\nJapanese Bobtail catJapanese Bobtail (an unnecessary natural disambiguation)\nThe Fool (1990 British film)The Fool (1990 film)"
    },
    {
        "name": "Larry Tesler",
        "description": "Lawrence Gordon Tesler (born April 24, 1945) is a computer scientist who works in the field of human–computer interaction. Tesler has worked at Xerox PARC, Apple, Amazon, and Yahoo!.\nTesler has a strong preference for modeless software, in which a user's action has a consistent effect, rather than changing its meaning depending on previous actions, as in the vi text editor. His Gypsy editor, for example, provided a 'click and type' interface in which the user could, at any time, enter text at the current insertion point, or click where the insertion point should be repositioned. Previously, most editors used the keyboard to enter text or to issue commands, depending on the current mode. To promote his preference, as of 2010, Tesler equipped his Subaru automobile with a personalized California license plate with the license number \"NO MODES\". Along with others, he has also been using the phrase \"Don't Mode Me In\" for years, as a rally cry to eliminate or reduce modes."
    },
    {
        "name": "Larry Wall",
        "description": "Larry Wall (born September 27, 1954) is a computer programmer and author, most widely known as the creator of the Perl programming language.\n\n"
    },
    {
        "name": "Linus Torvalds",
        "description": "Linus Benedict Torvalds (\/ˈlaɪnəsˈtɔːrvɔːldz\/; Swedish: [ˈliːn.ɵs ˈtuːr.valds]; born December 28, 1969) is a Finnish software engineer who is the creator and, for a long time, principal developer, of the Linux kernel; which became the kernel for operating systems such as the Linux operating system, Android and Chrome OS. He also created the distributed revision control system Git and the diving logging and planning software Subsurface. He was honored, along with Shinya Yamanaka, with the 2012 Millennium Technology Prize by the Technology Academy Finland \"in recognition of his creation of a new open source operating system for computers leading to the widely used Linux kernel\". He is also the recipient of the 2014 IEEE Computer Society Computer Pioneer Award.\n\n"
    },
    {
        "name": "Michael Tiemann",
        "description": "Michael Tiemann is Vice President of Open Source Affairs at Red Hat, Inc., and former President of the Open Source Initiative. He was the Chief Technical Officer of Red Hat. He has served on a number of boards, including the Embedded Linux Consortium, the GNOME Foundation Advisory Board, and the Board of Directors of ActiveState Tool Corp. He is also co-owner with Amy Tiemann of Manifold Recording Studios.\nHe co-founded Cygnus Solutions in 1989. His programming contributions to free software include authorship of the GNU C++ compiler and work on the GNU C compiler and the GNU Debugger. Tiemann is featured in the 2001 documentary Revolution OS. Opensource.com profiled him in 2014, calling him one of \"open source's great explainers.\"\nHe earned a bachelor's degree from the Moore School of Electrical Engineering in 1986 at the University of Pennsylvania.\n\n"
    },
    {
        "name": "Pat Villani",
        "description": "Pasquale \"Pat\" J. Villani (18 April 1954 – 27 August 2011) was an American computer programmer, author, and advocate of free software, best known for his creation of DOS-C, a DOS emulator written in the C language and subsequently adapted as the kernel of the FreeDOS operating system and a number of other projects including DOSEMU for Linux. He used to sign his edits with \"patv\"."
    },
    {
        "name": "Patrick Volkerding",
        "description": "Patrick Volkerding (born October 20, 1966) is the founder and maintainer of the Slackware Linux distribution. Volkerding is Slackware's \"Benevolent Dictator for Life\" (BDFL), and is also known informally as \"The Man.\"\n\n"
    },
    {
        "name": "Paul Vixie",
        "description": "Paul Vixie is an American Internet pioneer, the author of several RFCs and some Unix software.\nVixie attended George Washington High School in San Francisco, California. He received a Ph.D in computer science from Keio University in 2011.\nHe authored the standard UNIX system programs SENDS, proxynet, rtty and Vixie cron. At one point he ran his own consulting business, Vixie Enterprises."
    },
    {
        "name": "Roy Trubshaw",
        "description": "To a related topic: This is a redirect to an article about a similar topic or related term.\nRedirects from related terms are different than redirects from related words, since a related topic or term is more likely to warrant a full subtopic or detailed identification in the target page, and has a much better possibility of someday becoming an article."
    },
    {
        "name": "Simon Tatham",
        "description": "Simon Tatham (born 3 May 1977) is a British programmer known primarily for creating and maintaining PuTTY, a free software implementation of Telnet and SSH clients for Unix and Windows API platforms, along with an xterm terminal emulator. He is also well known as the original author of Netwide Assembler (NASM), and for his essay, \"How to Report Bugs Effectively\", which many software developers direct users to read before reporting bugs to them.\nHe also maintains a popular collection of small computer programs which implement one-player puzzle games. All of them run natively on Nintendo DS, Symbian S60, Unix (GTK+; Android, Mac OS X), and Windows.\nHe attended Cambridge University, and currently works at ARM Limited."
    },
    {
        "name": "Tim Sweeney (game developer)",
        "description": "Tim Sweeney (born in 1970) is an American computer game programmer and the founder of Epic Games, being best known for his work on ZZT and the Unreal Engine.\nSweeney established Epic as a shareware company while he was a student majoring in mechanical engineering at the University of Maryland. He said that he had been interested in game development and computer programming since he was 10 years old, and finally started making games out of his parents' basement where he lived. Epic got its start when Sweeney created ZZT, the company's first game, released as a shareware in 1991. In interviews Sweeney has credited that game's success with fueling the early growth of his company.\nSweeney worked on Epic's Unreal Engine, used in the Unreal series of first-person shooters and multiple other video games.\nIn 2005, Sweeney attended Wake Tech Community College Digital Game Xpo as a guest speaker. He showed a demo of the Unreal Engine and talked about 3D Buzz's book \"Mastering Unreal Technology: The Art of Level Design\".\nOn February 9, 2012, Sweeney was inducted into the Academy of Interactive Arts & Sciences (AIAS) Hall of Fame for his technological innovations in the gaming industry.\nOn July 10, 2013, Tim and the co-founder of Epic Games, Mark Rein, were named Development Legends at the Develop Industry Excellence Awards."
    },
    {
        "name": "Wietse Venema",
        "description": "Wietse Zweitze Venema (born 1951) is a Dutch programmer and physicist best known for writing the Postfix email system. He also wrote TCP Wrapper and collaborated with Dan Farmer to produce the computer security tools SATAN and The Coroner's Toolkit."
    },
    {
        "name": "Arthur Whitney (computer scientist)",
        "description": "Arthur Whitney is a Canadian computer scientist most notable for developing the APL-inspired programming languages A+ and K and co-founding the company Kx Systems."
    },
    {
        "name": "Bruce Wilcox",
        "description": "Bruce Wilcox (born 1951) is an artificial intelligence programmer.\n\n"
    },
    {
        "name": "Dave Winer",
        "description": "Dave Winer (born May 2, 1955 in Brooklyn, New York City) is an American software developer, entrepreneur, and writer who resides in New York City. Winer is noted for his contributions to outliners, scripting, content management, and web services, as well as blogging and podcasting. He is the founder of the software companies Living Videotext, Userland Software and Small Picture Inc., a former contributing editor for the Web magazine HotWired, the author of the Scripting News weblog, a former research fellow at Harvard Law School, and current visiting scholar at New York University's Arthur L. Carter Journalism Institute."
    },
    {
        "name": "David Wheeler (computer scientist)",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Don Woods (programmer)",
        "description": "Don Woods (born April 30, 1954) is an American perennial hacker and computer programmer. He is probably best known for his role in the development of the Colossal Cave Adventure game."
    },
    {
        "name": "Evan Williams (Internet entrepreneur)",
        "description": "Evan Clark Williams (born March 31, 1972) is an American computer programmer and Internet entrepreneur who has founded several Internet companies. Williams was previously Chairman and CEO of Twitter, one of the internet's top ten websites."
    },
    {
        "name": "Jim Weirich",
        "description": "James Nolan \"Jim\" Weirich (November 18, 1956 – February 19, 2014) was well known in the software industry as a developer, speaker, teacher, and contributor to the Ruby Programming Language community. Among his many contributions he created the popular Rake build tool for Ruby. He was active in the Ruby community worldwide, speaking at events in Asia, South America, Europe, and the United States."
    },
    {
        "name": "John Walker (programmer)",
        "description": "John Walker (born c. 1950) is a computer programmer, author and co-founder of the computer-aided design software company Autodesk."
    },
    {
        "name": "John Warnock",
        "description": "John Edward Warnock (born October 6, 1940) is an American computer scientist and businessman best known as the co-founder with Charles Geschke of Adobe Systems Inc., the graphics and publishing software company. Warnock was President of Adobe for his first two years and Chairman and CEO for his remaining sixteen years at the company. Although retired as CEO in 2000, he still co-chairs the board with Geschke. Warnock has pioneered the development of graphics, publishing, Web and electronic document technologies that have revolutionized the field of publishing and visual communications."
    },
    {
        "name": "Joseph Weizenbaum",
        "description": "Joseph Weizenbaum (8 January 1923 – 5 March 2008) was a German-American computer scientist and a professor emeritus at MIT. The Weizenbaum Award is named after him. He is considered one of the fathers of modern artificial intelligence."
    },
    {
        "name": "Niklaus Wirth",
        "description": "Niklaus Emil Wirth (born 15 February 1934) is a Swiss computer scientist, best known for designing several programming languages, including Pascal, and for pioneering several classic topics in software engineering. In 1984 he won the Turing Award, generally recognized as the highest distinction in computer science, for developing a sequence of innovative computer languages."
    },
    {
        "name": "Pei-Yuan Wei",
        "description": "Pei-Yuan Wei (Chinese: 魏培源; pinyin: Wèi Péiyuán) is the creator of ViolaWWW, the first popular graphical web browser."
    },
    {
        "name": "Peter J. Weinberger",
        "description": "Peter Jay Weinberger (born August 6, 1942) is a computer scientist best known for his early work at Bell Labs. He now works at Google.\nWeinberger was an undergraduate at Swarthmore College, graduating in 1964. He received his PhD in mathematics (number theory) in 1969 from the University of California, Berkeley under Derrick Henry Lehmer for a thesis entitled \"Proof of a Conjecture of Gauss on Class Number Two\". After holding a position in the Department of Mathematics at the University of Michigan, Ann Arbor, where he continued his work in analytic number theory, he moved to AT&T Bell Labs.\nAt Bell Labs, Weinberger contributed to the design of the AWK programming language (he is the \"W\" in AWK), and the Fortran compiler f77. A detailed explanation of his contributions to AWK and other Unix tools is found in an interview transcript at Princeton University. Another interview sheds some light on his work at Google.\nBoth interviews also confirm rumors about his involvement in early digital photography, especially the abuse of a photograph of his face for demonstrating digital imaging effects. When Peter Weinberger was promoted to head of Computer Science Research at Bell Labs, his picture was merged with the AT&T \"death star\" logo of the mid-80s, creating the PJW Face image that has appeared in innumerable locations, including T-shirts, coffee mugs, CDs, and at least one water tower. The sole remaining PJW Face at Bell Labs is somewhat in disarray, but there are plans afoot to repair it.\nPrior to joining Google, Weinberger was chief technology officer at Renaissance Technologies. Weinberger has been a member of the JASON defense advisory group since 1990."
    },
    {
        "name": "Robert Watson (computer scientist)",
        "description": "Robert Nicholas Maxwell Watson (born 3 May 1977) is a FreeBSD developer, and founder of the TrustedBSD Project. He is currently employed as a University Lecturer in Systems, Security, and Architecture in the Security Research Group at the University of Cambridge Computer Laboratory."
    },
    {
        "name": "Roberta Williams",
        "description": "Roberta Williams (born February 16, 1953) is an American video game designer, writer, and a co-founder of Sierra On-Line (later known as Sierra Entertainment), who developed her first game while living in Simi Valley, California. She is most famous for her pioneering work in the field of graphic adventure games with titles such as Mystery House, the King's Quest series, and Phantasmagoria. She is married to Ken Williams and retired from her career in 1999. Roberta Williams is one of the most influential PC game designers of the 1980s and 1990s, and has been credited with creating the graphic adventure genre.\n\n"
    },
    {
        "name": "Sophie Wilson",
        "description": "Sophie Wilson FRS FREng (born Roger Wilson in Leeds, England, in 1957) is a British computer scientist and software engineer. Wilson designed the Acorn Micro-Computer, the first of a long line of computers sold by Acorn Computers Ltd, including its programming language BBC BASIC. Wilson later designed the instruction set of the ARM processor, which became the de facto model used in 21st-century smartphones."
    },
    {
        "name": "Stephen Wolfram",
        "description": "Stephen Wolfram (born 29 August 1959) is a British-born American computer scientist, physicist, and businessman. He is known for his work in computer science, mathematics, and in theoretical physics. He is the author of the book A New Kind of Science. In 2012 he was named an inaugural fellow of the American Mathematical Society.\nAs a businessman, he is the founder and CEO of the software company Wolfram Research where he worked as chief designer of Mathematica and the Wolfram Alpha answer engine. His recent work has been on knowledge-based programming, expanding and refining the programming language of Mathematica into what is now called the Wolfram Language. His book An Elementary Introduction to the Wolfram Language appeared in 2015 and Idea Makers appeared in 2016."
    },
    {
        "name": "Steve Wozniak",
        "description": "Stephen (or Stephan) Gary \"Steve\" Wozniak (\/ˈwɒzniæk\/, born August 11, 1950), nicknamed \"Woz\", is an American inventor, electronics engineer, programmer, and technology entrepreneur who co-founded Apple Inc. He is known as a pioneer of the personal computer revolution of the 1970s and 1980s, along with Apple co-founder Steve Jobs.\nWozniak single-handedly developed the 1976 Apple I, which was the computer that launched Apple. He primarily designed the 1977 Apple II, while Jobs oversaw the development of its unusual case and Rod Holt developed the unique power supply."
    },
    {
        "name": "Why the lucky stiff",
        "description": "Jonathan Gillette, known by the pseudonym why the lucky stiff (often abbreviated as _why), is a writer, cartoonist, artist, and programmer notable for his work with the Ruby programming language. Annie Lowrey described him as \"one of the most unusual, and beloved, computer programmers\" in the world. Along with Yukihiro Matsumoto and David Heinemeier Hansson, he was seen as one of the key figures in the Ruby community.\n_why made a presentation enigmatically titled \"A Starry Afternoon, a Sinking Symphony, and the Polo Champ Who Gave It All Up for No Reason Whatsoever\" at the 2005 O'Reilly Open Source Convention. It explored how to teach programming and make the subject more appealing to adolescents. _why gave a presentation and performed with his band, the Thirsty Cups, at RailsConf in 2006.\nOn 19 August 2009, why's accounts on Twitter and GitHub and his personally maintained websites went offline. Shortly before he disappeared, why the lucky stiff tweeted, \"programming is rather thankless. u see your works become replaced by superior ones in a year. unable to run at all in a few more.\" \n_why's colleagues have assembled collections of his writings and projects.\nOn 5 January 2013, _why's site was back online, although, as of October 2013, it was only serving a blank page. In March 2014, the site re-launched as the personal blog of an anonymous individual from Australia with no apparent connection to _why."
    },
    {
        "name": "Will Wright (game designer)",
        "description": "William Ralph \"Will\" Wright (born January 20, 1960) is an American video game designer and co-founder of the former game development company Maxis, and then part of Electronic Arts (EA). In April 2009, he left EA to run Stupid Fun Club Camp, an entertainment think tank in which Wright and EA are principal shareholders.\nThe first computer game Wright designed was Raid on Bungeling Bay in 1984, but it was SimCity that brought him to prominence. The game was released by Maxis, a company Wright formed with Jeff Braun, and he built upon the game's theme of computer simulation with numerous other titles including SimEarth and SimAnt.\nWright's greatest success to date comes from being the original designer for The Sims. The game spawned multiple sequels, including The Sims 2, The Sims 3, and The Sims 4 and expansion packs, and Wright has earned many awards for his work. His latest work, Spore, was released in September 2008 and features gameplay based upon the model of evolution and scientific advancement. The game sold 406,000 copies within three weeks of its release."
    },
    {
        "name": "Jamie Zawinski",
        "description": "James Werner \"Jamie\" Zawinski (born November 3, 1968), commonly known as jwz, is an American computer programmer with contributions to the free software projects Mozilla and XEmacs, and early versions of the Netscape Navigator web browser. He maintains the XScreenSaver project which provides screenblanking for Mac OS X and for Unix and Unix-like computer operating systems using the X Window System.\nZawinski is currently the proprietor of the DNA Lounge, a nightclub in San Francisco.\n\n"
    },
    {
        "name": "Jerry Yang (entrepreneur)",
        "description": "From a page move: This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name."
    },
    {
        "name": "Mark Zuckerberg",
        "description": "Mark Elliot Zuckerberg (born May 14, 1984) is an American computer programmer and Internet entrepreneur. He is the chairman, chief executive officer and co-founder of social networking website Facebook. His net worth is estimated to be US$50 billion as of December 2016, ranking him the 5th richest person in the world.\nTogether with his college roommates and fellow Harvard University students Eduardo Saverin, Andrew McCollum, Dustin Moskovitz, and Chris Hughes, he launched Facebook from Harvard's dormitory rooms. The group then introduced Facebook to other campuses. Facebook expanded rapidly, with one billion users by 2012. Zuckerberg was involved in various legal disputes that were initiated by others in the group, who claimed a share of the company based upon their involvement during the development phase of Facebook.\nIn December 2012, Zuckerberg and his wife Priscilla Chan announced they would give the majority of their wealth over the course of their lives to \"advancing human potential and promoting equality\" in the spirit of The Giving Pledge. On December 1, 2015, they announced they would eventually give 99% of their Facebook shares (worth about $45 billion at the time) to the Chan Zuckerberg Initiative.\nSince 2010, Time magazine has named Zuckerberg among the 100 wealthiest and most influential people in the world as a part of its Person of the Year distinction. In December 2016, Zuckerberg was ranked 10th on Forbes list of The World's Most Powerful People."
    },
    {
        "name": "Matei Zaharia",
        "description": "Matei Zaharia is a Romanian-Canadian computer scientist specializing in big data, distributed systems, and cloud computing. He is a co-founder and Chief Technologist of Databricks, and an assistant professor of computer science at Stanford University. He created the Apache Spark project and co-created the Apache Mesos project during his PhD at UC Berkeley, and also designed the core scheduling algorithms used in Apache Hadoop, including the most widely used fair scheduler."
    },
    {
        "name": "Philip Zimmermann",
        "description": ""
    },
    {
        "name": "Victor Yngve",
        "description": "Victor H. Yngve (July 5, 1920 – January 15, 2012) was professor emeritus of linguistics at the University of Chicago. He was one of the earliest researchers in computational linguistics and natural language processing, the use of computers to analyze and process languages. He created the first program to produce random but well-formed output sentences, given a text (a children's book called Engineer Small and the Little Train). Most importantly, he showed in computer processing terms why the human brain can only process sentences of a certain kind of complexity, ones that do not exceed a \"depth limit\" (which has nothing to do with length) of the kind established independently by George Miller with his depth limit of \"seven plus or minus two\" sentence constituents in memory at any given time. Yngve was also the author of COMIT, the first string processing language (compare SNOBOL, TRAC, and Perl), which was developed on the IBM 700\/7000 series computers by Yngve and collaborators at MIT from 1957-1965. Yngve created the language for supporting computerized research in the field of linguistics, and more specifically, the area of machine translation for natural language processing."
    }
]